{
  "profile": "<p>When open, I tend to reply within a few days! <small>(I try to reply to every email I get, but patience is greatly appreciated. Please send a follow up after a week if I haven&#039;t responded by then!)</small></p><p>I can usually find something of interest on any list! Feel free to reach out even if you don&#039;t have my wants :)</p><details><summary><span style=\"color: #ffffff;\">Trading Info</span></summary><div data-type=\"details-content\"><ul><li><p>Started trading: Sep 2024</p></li><li><p>I prefer smaller scale trades, but I&#039;m happy with large ones as well</p></li><li><p>Any MKV + VOB combination will be traded together, but videos with multiple release formats will generally be considered a 1:1 ratio per format. These are noted as such in my trader notes</p></li><li><p>I prefer to receive links through MEGA. I will accept Google Drive links, but MEGA is my preferred method</p></li><li><p>My links stay active for a week unless you tell me you need more time</p></li></ul></div></details><details><summary>Collection Info</summary><div data-type=\"details-content\"><ul><li><p>Sizes are listed from my Mac, which is why file sizes are larger</p></li><li><p>I do my best to make sure everything is labelled correctly and not a rip, but there is a chance something is wonky. If you notice anything, please let me know so I can correct it!</p></li><li><p>Anything without a format has recently been added to my collection. These will be updated asap!</p></li><li><p>Audios are all listed with the amount of tracks I have, as well as non-DVD videos with multiple files (ex: the recording is split between two acts). Without the given indicator, you can assume there is only video one file for the performance. Audios will generally still have a &quot;x1&quot; in this case to minimize confusion</p></li></ul></div></details>",
  "slug": "twigsaretasty",
  "username": "twigsaretasty",
  "name": "twigsaretasty",
  "pronouns": "she/her",
  "email": "twigsaretasty@gmail.com",
  "status": "closed",
  "last_seen": "2025-06-29T01:01:59.000000Z",
  "recordings": 580,
  "wants": 184
}