{
    "The 25th Annual Putnam County Spelling Bee": [
        {
            "id": "e-9975",
            "tour": "Off-Broadway",
            "date": "2005-02-15",
            "time": "E",
            "master": "Unknown",
            "cast": "Lisa Howard (Rona Lisa Peretti), Celia Keenan-Bolger (Olive Ostrovsky), Dan Fogler (William Barfee), Sarah Saltzberg (Logainne Schwartzandgrubenierre), Derrick Baskin (Mitch Mahoney), Jesse Tyler Ferguson (Leaf Coneybear), Deborah S. Craig (Marcy Park), Jose Llana (Chip Tolentino), Jay Reiss (Douglas Panch)",
            "notes": "Theres a fair number of digital glitches and it takes a few minutes for the camera to get aimed, but overall a great video with clear sound. Includes NY1 review and interview segment. Best of the three videos. Multiple VOB & smalls versions circulate, with sizes including 4.4 GB, 2.86 GB, and 1.49 GB. Check with traders.",
            "format": "VOB (with smalls) + MP4",
            "size": "3.07 GB + 4.54 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-1"
        },
        {
            "id": "e-1110350",
            "tour": "Second US National Tour (Non-Equity)",
            "date": "2008-11-16",
            "time": "M",
            "master": "juniper47",
            "cast": "Nikki Switzer (Rona Lisa Peretti), Brittany Ross (Olive Ostrovsky), Christian Busath (William Barfee), Joanna Krupnick (Logainne Schwartzandgrubenierre), Don Juan Seward II (Mitch Mahoney), Ryan Goodale (Leaf Coneybear), Zandi DeJesus (Marcy Park), Kavin Panmeechao (Chip Tolentino), Anthony Lopez (Douglas Panch)",
            "notes": "Filmed in 16:9, SD. Almost no obstruction except for bottom of screen in widest shots. Fun cast, great audience energy, and the audience spellers were great, too! External audio fed in and synced with video.",
            "format": "VOB (with smalls)",
            "size": "4.65 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        }
    ],
    "42nd Street": [
        {
            "id": "e-15004",
            "tour": "Second West End Revival",
            "date": "2018-11",
            "time": "E",
            "master": "Proshot",
            "cast": "Clare Halse (Peggy Sawyer), Philip Bertioli (Billy Lawlor), Bonnie Langford (Dorothy Brock), Tom Lister (Julian Marsh), Jasna Ivir (Maggie Jones), Christopher Howell (Bert Barry), Graeme Henderson (Andy Lee), Matthew Goodgame (Pat Denning), Bruce Montague (Abner Dillon), Emma Caffrey (Ann \"Anytime Annie\" Reilly), Ella Martine (Lorraine Flemming), Clare Rickard (Phyllis Dale), Paul Knight (Oscar)",
            "notes": "The West End revival of 42nd Street starring Bonnie Langford as Dorothy Brock who previously played as Peggy in the UK Tour. Released to cinemas, there are stills some encore screenings going on. This can also be streamed on BroadwayHD. Quality and file format varies across traders.\n\nThere are currently two file versions being traded. One is a 4GB MP4/MKV and a 8GB MKV.  Some may also trade a 2GB MP4/MKV file.",
            "format": "MKV",
            "size": "9.61 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-0"
        }
    ],
    "All Shook Up": [
        {
            "id": "e-28817",
            "tour": "Broadway",
            "date": "2005-04-09",
            "time": "E",
            "master": "Unknown",
            "cast": "Cheyenne Jackson (Chad), Nikki M. James (Lorraine), Sharon Wilkins (Sylvia), Curtis Holbrook (Dean Hyde), Jenn Gambatese (Natalie Haller/Ed), Mark Price (Dennis), Jonathan Hadary (Jim Haller), Alix Korey (Mayor Matilda Hyde), John Jellison (Sheriff Earl), Leah Hocking (Miss Sandra)",
            "notes": "EXCELLENT video capture of the show!  Also includes: Pre-Broadway, and Opening Night stories from NY1, as well as reviews from Broadway Backstage and NY1, plus scanned Playbill info<br><br>MY NOTES: I'm missing some of the extras. I have a NY1 interview that appears to be from the workshop/pre-broadway. I don't have scanned playbill info",
            "format": "VOB (with smalls)",
            "size": "2.04 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-2"
        }
    ],
    "Amélie": [
        {
            "id": "e-20438",
            "tour": "UK Tour",
            "date": "2019-06",
            "time": "Unknown",
            "master": "hitmewithyourbethshot",
            "cast": "Audrey Brisson (Amélie Poulain), Danny Mac (Nino Quincampoix), Johnson Willis (Raymond Dufayel/Collignon), Chris Jared (Raymond Dufayel), Jez Unwin (Raphaël Poulain/Bretodeau), Rachel Dawson (Amandine Poulain/Philomene), Faoileann Cunningham (Georgette/Sylvie/Collignon's Mother), Kate Robson-Stuart (Suzanne), Oliver Grant (Lucien/Mysterious Man/Adrien Wells), Sophie Crawford (Gina), Caolan McCarthy (Elton John/Hipolito/Suicidal Tourist), Samuel Morgan-Grahame (Fluffy/Collignon's Father/Joseph), Josh Sneesby (Blind Beggar/Garden Gnome), Charley Magalit (Cecile), Emma Jane Morton (Delphine), Nuwan Hugh Perera (Jean-Yves)",
            "notes": "",
            "format": "MP4 x6",
            "size": "4.76 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-2"
        }
    ],
    "Anastasia": [
        {
            "id": "e-369",
            "tour": "Broadway",
            "date": "2017-09-17",
            "time": "E",
            "master": "NYCG8R",
            "cast": "Christy Altomare (Anya), Derek Klena (Dmitry), Ramin Karimloo (Gleb Vaganov), John Bolton (Vlad Popov), Caroline O'Connor (Countess Lily Malevsky-Malevitch), Mary Beth Peil (Dowager Empress Maria Feodorovna), Molly Rushing (Young Anastasia/Paulina), Nicole Scimeca (Little Anastasia/Prince Alexei Romanov), Constantine Germanacos (Tsar Nicholas II/Count Ipolitov), Lauren Blackman (Tsarina Alexandra), Shina Ann Morris (Tatiana Romanov/Dunya), Allison Walsh (Olga Romanov/Odette in Swan Lake), Sissy Bell (Marfa/Maria Romanov), Ken Krugman (Count Leopold/Gorlinsky), Janet Dickinson (Countess Gregory), Kyle Brown (Prince Siegfried in Swan Lake), James A. Pierce III (Von Rothbart in Swan Lake), Wes Hart (Russian Doorman)",
            "notes": "Actors Benefit Performance. Includes post-show speeches.",
            "format": "VOB (with smalls)",
            "size": "4.53 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-0"
        },
        {
            "id": "e-173",
            "tour": "Pre-Broadway / Hartford Stage",
            "date": "2016-06-15",
            "time": "M",
            "master": "SJ Bernly",
            "cast": "Christy Altomare (Anya), Derek Klena (Dmitry), Manoel Felciano (Gleb Vaganov), John Bolton (Vlad Popov), Caroline O'Connor (Countess Lily Malevsky-Malevitch), Mary Beth Peil (Dowager Empress Maria Feodorovna), Nicole Scimeca (Little Anastasia/Prince Alexei Romanov), Constantine Germanacos (Tsar Nicholas II/Count Ipolitov), Lauren Blackman (Tsarina Alexandra), Shina Ann Morris (Tatiana Romanov/Dunya), Samantha Sturm (Olga Romanov), Alida Michal (Marfa/Maria Romanov/Odette in Swan Lake), Max Clayton (Prince Siegfried in Swan Lake), Johnny Stellard (Von Rothbart in Swan Lake)",
            "notes": "This new musical is absolutely fantastic and is likely to do very well when it hits Broadway this season. Christy is perfectly cast as Anya, and she has great chemistry with Derek, Mary, and the rest of the cast. The music, sets, and costumes are all beautifully done as well. This is nearly perfectly captured with no obstruction and just a couple quick very dropouts. It’s filmed in 16:9, with a mix of wides, mediums, and close-ups. The sound is excellent. Includes playbill scans.",
            "format": "VOB (with smalls)",
            "size": "8.82 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-1"
        }
    ],
    "Annie": [
        {
            "id": "e-1011",
            "tour": "Second Broadway Revival",
            "date": "2012-10-03",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Lilla Crawford (Annie), Katie Finneran (Miss Hannigan), Anthony Warlow (Oliver \"Daddy\" Warbucks), Brynn O'Malley (Grace Farrell), Clarke Thorell (Rooster Hannigan)",
            "notes": "Excellent HD capture of this sparkly first performance Broadway Revival. Lilla is great in the role of Annie and really delivers. Katie, as you would guess, makes a terrific Hannigan and so funny in the role! A great top-notch revival! A",
            "format": "VOB (with smalls)",
            "size": "7.96 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-2"
        }
    ],
    "Anything Goes": [
        {
            "id": "e-395",
            "tour": "Second Broadway Revival",
            "date": "2011-04-03",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Sutton Foster (Reno Sweeney), Colin Donnell (Billy Crocker), Joel Grey (Moonface Martin), Laura Osnes (Hope Harcourt), John McMartin (Elisha J. Whitney), Jessica Walter (Mrs. Evangeline Harcourt), Adam Godley (Lord Evelyn Oakleigh), Jessica Stone (Erma)",
            "notes": "MASTER NOTES: Sensational revival and stunning production. Sutton of course is talented beyond words and it truly shows. Such a fun revival and everything is beautifully captured here. A<br><br>GENERAL NOTES: T/W: This video contains a PETA advertisement at the beginning, which contains graphic images and may be distressing.  This was included by the master on release.",
            "format": "VOB (with smalls)",
            "size": "4.61 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-2"
        }
    ],
    "Assassins": [
        {
            "id": "e-5725",
            "tour": "Broadway",
            "date": "2004-04-10",
            "time": "E",
            "master": "Unknown",
            "cast": "Michael Cerveris (John Wilkes Booth), Denis O'Hare (Charles Guiteau), James Barbour (Leon Czolgosz), Mario Cantone (Samuel Byck), Jeffrey Kuhn (Giuseppe Zangara), Mary Catherine Garrison (Lynette \"Squeaky\" Fromme), Neil Patrick Harris (Lee Harvey Oswald/Balladeer), Becky Ann Baker (Sara Jane Moore), Marc Kudisch (The Proprietor), Alexander Gemignani (John Hinckley Jr.), Anne L. Nathan (Emma Goldman)",
            "notes": "After rummaging through old trading sites and checking different videos it seems that April 10 (the version with no generation loss) is the correct date and is from the master copy. This master's videos are notorious for having playback glitches and this video is an example of that. While there's no real fix for the glitchy playback, it has been recommend on sites to convert the disc to an MKV file or play it through certain apps, specifically the Mac DVD player app.\n\nThere are 2 full length videos from this production that circulate with various dates and copies. This one is most commonly listed as April 4th or 10th, but has also been listed as April 20th, 24th, and has even been mixed up with the May 29th video. Check your copy against the screenshots to see which one you have.\n\nTwo versions of this particular recording circulate: one with no playback glitches but lots of generation loss (April, 2004 or April 4) and one with glitchy playback but no generation loss (April 10, 2004, Master copy screenshots below)<br><br>MY NOTES: I have four copies of this video. Three are VOB with smalls. I believe I have two versions of the non-bugged lower quality copy, 4.57 GB and 4.28 GB. I also have the bugged higher quality copy at 3.78 GB. A MP4 (2.22 GB) copy of the higher quality files is also included.",
            "format": "VOB (with smalls)",
            "size": "4.28 GB (no bugs) + 3.78 GB (bugs)",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-1"
        },
        {
            "id": "e-1119815",
            "tour": "Off-Broadway Revival",
            "date": "2022-01",
            "time": "E",
            "master": "juniper47",
            "cast": "Steven Pasquale (John Wilkes Booth), Will Swenson (Charles Guiteau), Brandon Uranowitz (Leon Czolgosz), Andy Grotelueschen (Samuel Byck), Wesley Taylor (Giuseppe Zangara), Tavi Gevinson (Lynette \"Squeaky\" Fromme), Ethan Slater (Lee Harvey Oswald/Balladeer), Judy Kuhn (Sara Jane Moore), Eddie Cooper (The Proprietor), Adam Chanler-Berat (John Hinckley Jr.), Lee Harrington (u/s Emma Goldman), Brad Giovanine (Ensemble), Whit K. Lee (Ensemble), Rob Morrison (Ensemble), Katrina Yaukey (Ensemble)",
            "notes": "<p>Filmed on phone, edited in post to zoom and pan to action on stage. Closer zooms are a little grainy, but still watchable. Due to close proximity and angle, some performers are cut off from the waist up when closest to camera, and there is some wide-angle distortion on the far sides. But still a great capture of this revival.</p>",
            "format": "MP4",
            "size": "7.77 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-1"
        }
    ],
    "Avenue Q": [
        {
            "id": "e-1046",
            "tour": "First US National Tour",
            "date": "2009-04-07",
            "time": "E",
            "master": "SJ Bernly",
            "cast": "Rob McClure (Princeton/Rod), Anika Larsen (Kate Monster/Lucy the Slut), David Benoit (Nicky/Trekkie Monster/Bad Idea Bear), Maggie Lakis (Bad Idea Bear/Mrs. Thistletwat), Danielle K. Thomas (Gary Coleman), Sala Iwamatsu (Christmas Eve), Cole Porter (Brian)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "5.05 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-1"
        }
    ],
    "Back to the Future: The Musical": [
        {
            "id": "e-1145151",
            "tour": "Broadway",
            "date": "2023-07-01",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Casey Likes (Marty McFly), Roger Bart (Doc Brown), Hugh Coles (George McFly), Liana Hunt (Lorraine Baines), Nathaniel Hackmann (Biff Tannen), Jelani Remy (Goldie Wilson/Marvin Berry), Merritt David Janes (Principal Strickland/Lou), Mikaela Secada (Jennifer Parker), Amber Ardolino (Linda McFly), Daryl Tofa (Dave McFly/Slick), Victoria Byrd (Betty), Becca Petersen (Babs), Will Branner (3D), Jonalyn Saxer (Clocktower Woman/Spokesperson), Nick Drake (Reginald), Brendon Chan (Ensemble), Joshua Kenneth Allen Johnson (s/w Ensemble), Marc Heitzman (Ensemble), Hannah Kevitt (Ensemble), JJ Niemann (Ensemble), Emma Pittman (Ensemble)",
            "notes": "MASTER NOTES: <p>Excellent 4K capture of this show's third preview! Heads are visible along the bottom, but only the left side has some obstruction. A little action is blocked off, mostly when characters are sitting or laying down on the floor. Some wandering / readjustment and unfocusing throughout, and the beginning of act two is especially messy. Some washout on wider shots. Some overloaded audio from cheering. Includes curtain call and encore sequence, audio is fed from external source.</p><br><br>GENERAL NOTES: <p>Joshua was on for Kevin Curtis's track.</p>",
            "format": "MP4",
            "size": "11.14 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        }
    ],
    "The Band's Visit": [
        {
            "id": "e-4748",
            "tour": "Broadway",
            "date": "2018-06",
            "time": "E",
            "master": "NYCG8R",
            "cast": "Katrina Lenk (Dina), Sasson Gabai (Tewfiq), John Cariani (Itzik), Ari'el Stachel (Haled), Etai Benson (Papi), Adam Kantor (Telephone Guy), Andrew Polk (Avrum), Jonathan Raviv (Sammy), Ahmad Maksoud (u/s Camal), Rachel Prather (Julia), Bill Army (Zelger), Kristen Sieh (Iris), Sharone Sayegh (Anna), Alok Tewari (Simon)",
            "notes": "Very nice video of the show with Sasson Gabai, who starred as Tewfiq in the film version. Great clear picture and sound throughout",
            "format": "VOB (with smalls)",
            "size": "4.51 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-0"
        }
    ],
    "Be More Chill": [
        {
            "id": "e-22625",
            "tour": "Broadway",
            "date": "2019-03",
            "time": "Unknown",
            "master": "NYCG8R",
            "cast": "Will Roland (Jeremy Heere), George Salazar (Michael Mell), Stephanie Hsu (Christine Canigula), Jason Tam (The SQUIP), Lauren Marcus (Brooke Lohst), Katlyn Carlson (Chloe Valentine), Tiffany Mann (Jenna Rolan), Britton Smith (Jake Dillinger), Gerard Canonico (Rich Goranski), Jason SweetTooth Williams (Mr. Heere/Mr. Reyes/Scary Stockboy)",
            "notes": "Great clear video with excellent picture and good sound.",
            "format": "VOB (with smalls)",
            "size": "4.53 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        }
    ],
    "Beetlejuice": [
        {
            "id": "e-26548",
            "tour": "Broadway",
            "date": "2019-07",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Alex Brightman (Beetlejuice), Sophia Anne Caruso (Lydia Deetz), Kerry Butler (Barbara Maitland), Rob McClure (Adam Maitland), Adam Dannheisser (Charles Deetz), Leslie Rodriguez Kritzer (Delia Deetz/Miss Argentina), Kelvin Moon Loh (Otho), Danny Rutigliano (Maxie Dean), Jill Abramovitz (Maxine Dean/Juno), Dana Steingold (Girl Scout)",
            "notes": "Good HD capture from the right orchestra with beautiful zooms and way less obstruction than the March video. Please do not post screenshots of this video on Twitter ever. Gifs on Tumblr are okay after the NFT date, but don't go linking things to actors and shows.",
            "format": "MP4",
            "size": "6.05 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        },
        {
            "id": "e-1142003",
            "tour": "First US National Tour",
            "date": "2023-02-18",
            "time": "E",
            "master": "Medium Observation",
            "cast": "Justin Collette (Beetlejuice), Isabella Esler (Lydia Deetz), Britney Coleman (Barbara Maitland), Will Burton (Adam Maitland), Jesse Sharp (Charles Deetz), Kate Marilley (Delia Deetz), Juliane Godfrey (u/s Miss Argentina), Abe Goldfarb (Otho), Brian Vaughn (Maxie Dean), Karmine Alers (Maxine Dean/Juno), Jackera Davis (Girl Scout), Matthew Michael Janisse (s/w Ensemble)",
            "notes": "Extremely nice video of Juliane's Miss Argentina debut. Some washout but only in extreme wideshots. Overall a fantastic capture from the middle mezz in Rochester!",
            "format": "MP4",
            "size": "11.39 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-0"
        }
    ],
    "Between the Lines": [
        {
            "id": "e-2004448",
            "tour": "Off-Broadway",
            "date": "2022",
            "time": "Unknown",
            "master": "Proshot",
            "cast": "Arielle Jacobs (Delilah), Julia Murney (Grace/Queen Maureen), Jake David Smith (Prince Oliver), Jerusha Cavazos (Janice/Marina), Sean Stack (Martin/Troll/Process Server), Wren Rivera (Ondine/Jules), Hillary Fisher (Allie McAndrews/Princess Seraphima), John Rapson (Rapskullio/Dad/Dr. Ducharme), Will Burton (Frump/Ryan), Vicki Lewis (Jessamyn Jacobs/Lady in Waiting/Kyrie/Mrs. Brown/Ms. Winx)",
            "notes": "",
            "format": "MP4",
            "size": "4.8 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-0"
        }
    ],
    "The Book of Mormon": [
        {
            "id": "e-31060",
            "tour": "Chicago",
            "date": "2012-12-23",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Nic Rouleau (Elder Price), Ben Platt (Elder Cunningham), Syesha Mercado (Nabulungi), Pierce Cassedy (Elder McKinley), James Vincent Meredith (Mafala Hatimbi), David Aron Damane (General), Christopher Shyer (Mission President)",
            "notes": "Beautiful HD capture of the Chicago cast. I cannot say enough wonderful things about this company! They really are rock solid and give terrific performances! Nic and Ben are really sensational and have great chemistry. A+",
            "format": "VOB (with smalls)",
            "size": "8.68 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-1"
        }
    ],
    "Boop! The Musical": [
        {
            "id": "e-1151841",
            "tour": "Chicago Tryout",
            "date": "2023-12-03",
            "time": "M",
            "master": "Medium Observation",
            "cast": "Jasmine Rogers (Betty Boop), Ainsley Melham (Dwayne), Faith Prince (Valentina), Stephen DeRosa (Grampy), Phillip Huber (Pudgy), Angelica Hale (Trisha), Erich Bergen (Raymond), Anastacia McCleskey (Carol Evans), Lawrence Alexander (Ensemble), Colin Bradbury (Ensemble), Tristen Buettel (Ensemble), Joshua Burrage (Ensemble), Gabi Campo (Ensemble), Daniel Castiglione (Ensemble), Rebecca Corrigan (Ensemble), Josh Drake (Ensemble), RJ Higton (Ensemble), Nina Lafarga (Ensemble), Morgan McGhee (Ensemble), Aubie Merrylees (Ensemble), Ryah Nixon (Ensemble), Christian Probst (Ensemble), Ricky Schroeder (Ensemble), Gabriella Sorrentino (Ensemble), Brooke Taylor (Ensemble)",
            "notes": "Nice video from the second week of previews and Version 3.0. Some scenes are majorly wideshot due to the nature of the show, along with usher activity. Some washout can be seen at times but it's not too bad.",
            "format": "MP4",
            "size": "11.18",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        }
    ],
    "Bright Star": [
        {
            "id": "e-399",
            "tour": "Broadway",
            "date": "2016-06-26",
            "time": "E",
            "master": "SJ Bernly",
            "cast": "Carmen Cusack (Alice Murphy), Paul Alexander Nolan (Jimmy Ray Dobbs), A.J. Shively (Billy Cane), Michael Mulheren (Mayor Josiah Dobbs), Hannah Elless (Margo Crawford), Stephen Bogardus (Daddy Cane), Dee Hoty (Mama Murphy), Stephen Lee Anderson (Daddy Murphy), Emily Padgett (Lucy Grant), Maddie Shea Baldwin (Edna)",
            "notes": "Final performance. An electric performance right from the start. The enthusiastic audience is extremely supportive, and the cast gives emotional performances. Steve Martin joins the band for the EntrActe, and there's a standing ovation for him, as well as for Carmen following At Long Last. There were no speeches given, but the curtain call was much longer than usual with Steve, Edie, and Walter all taking bows, and Steve doing a short impromptu tap number. This is beautifully captured with no obstructions. There is a one minute blackout over the first scene just before She's Gone, but the rest of the show is complete. There is some slight washout in a few of the wider shots. It's filmed in 16:9, with a mix of wides, mediums, and close-ups. The sound is excellent. Includes the entire extended curtain call and playbill scans.",
            "format": "VOB (with smalls)",
            "size": "8.51 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-1"
        }
    ],
    "Cabaret": [
        {
            "id": "e-5740",
            "tour": "Third Broadway Revival",
            "date": "2014-11-29",
            "time": "E",
            "master": "Lanelle",
            "cast": "Alan Cumming (Emcee), Emma Stone (Sally Bowles), Bill Heck (Clifford Bradshaw), Linda Emond (Fräulein Schneider), Danny Burstein (Herr Schultz), Aaron Krohn (Ernst Ludwig), Gayle Rankin (Fräulein Kost), Katrina Yaukey (u/s Lulu/u/s Ensemble)",
            "notes": "Missing the first few seconds of Wilkommen, but otherwise complete. Very steady, focused, and mostly unobstructed. Includes curtain call and Alans BCEFA speech.\n\nAct: 1 of the DVD starts at Willkommen Reprise and Act: 2 starts at the Scene prior to If You Could See Her. However the actual VOBS of the DVD is complete.",
            "format": "VOB (with smalls)",
            "size": "6.94 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-0"
        },
        {
            "id": "e-1129265",
            "tour": "Fifth West End Revival",
            "date": "2022-03",
            "time": "E",
            "master": "Jagweed",
            "cast": "Eddie Redmayne (Emcee), Emily Benjamin (u/s Sally Bowles), Omari Douglas (Clifford Bradshaw), Liza Sadovy (Fräulein Schneider), Elliot Levey (Herr Schultz), Stewart Clarke (Ernst Ludwig), Anna-Jane Casey (Fräulein Kost/Fritzie), Sally Frith (Frenchie), Andre Refig (Max), Daniel Perry (Victor), Theo Maddix (Lulu), Christopher Tendai (Bobby), Sophie Maria Wojna (Rosie), Ela Lisondra (s/w Helga), Matthew Gent (Hans), Lillie-Pearl Wildman (Texas)",
            "notes": "This is the only known recording of Emily Benjamin in the role of Sally Bowles with the original West End revival cast. I would say this is a near perfect capture of this production; very little obstruction, steady, with a mix of wides, mediums and close ups. Recording includes the curtain call and marquee.",
            "format": "M4V",
            "size": "10.7 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-1"
        },
        {
            "id": "e-1129264",
            "tour": "Fifth West End Revival",
            "date": "2022-01",
            "time": "E",
            "master": "Jagweed",
            "cast": "Eddie Redmayne (Emcee), Jessie Buckley (Sally Bowles), Omari Douglas (Clifford Bradshaw), Liza Sadovy (Fräulein Schneider), Elliot Levey (Herr Schultz), Stewart Clarke (Ernst Ludwig), Anna-Jane Casey (Fräulein Kost/Fritzie), Sally Frith (Frenchie), Andre Refig (Max), Daniel Perry (Victor), Theo Maddix (Lulu), Christopher Tendai (Bobby), Sophie Maria Wojna (Rosie), B Terry (Helga), Matthew Gent (Hans), Lillie-Pearl Wildman (Texas)",
            "notes": "This is the only publicly released video recording of this acclaimed, sold out production with the original West End revival cast. This was my first time recording and as a result, mistakes were made. Foolishly, I set the exposure to automatic, so the recording suffered from spotlight washout (I haven't made this mistake since). The washout has mostly been fixed in editing but it's impossible to fully correct. The recording has more zooms than I would like, to prevent further washout. Fortunately, this production is minimalistic and performance-focused so it doesn't hinder the overall experience of the show. The recording is mainly filmed in close-ups and mediums. A head is sometimes visible in the wide shots of the musical numbers. Recording includes the curtain call and marquee.",
            "format": "M4V",
            "size": "10.48 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        },
        {
            "id": "e-2005140",
            "tour": "Fourth Broadway Revival",
            "date": "2024-09-16",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Adam Lambert (Emcee), Auli'i Cravalho (Sally Bowles), Calvin Leon Smith (Clifford Bradshaw), Bebe Neuwirth (Fräulein Schneider), Steven Skybell (Herr Schultz), Henry Gottfried (Ernst Ludwig), Michelle Aravena (Fräulein Kost/Fritzie), Gabi Campo (Frenchie), Loren Lester (Max/Herman), Marty Lauter (Victor), David Merino (Lulu), Julian Ramos (Bobby), Kayla Jenerson (s/w Rosie), Ayla Ciccone-Burton (Helga), Colin Cunliffe (Hans), MiMi Scardulla (Texas)",
            "notes": "Excellent 4K capture of the new cast (debuts for Adam, Auli’i, Calvin and Michelle)! Some wandering / readjustment and unfocusing throughout. A bit of occasional obstruction from people walking the aisles. Includes curtain call, audio is fed from external source.",
            "format": "MP4",
            "size": "12.5 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-2"
        }
    ],
    "Catch Me If You Can": [
        {
            "id": "e-1356",
            "tour": "Broadway",
            "date": "2011-04-27",
            "time": "E",
            "master": "NYCG8R",
            "cast": "Aaron Tveit (Frank Abagnale Jr.), Norbert Leo Butz (Agent Carl Hanratty), Tom Wopat (Frank Abagnale Sr.), Rachel de Benedet (Paula Abagnale), Kerry Butler (Brenda Strong), Linda Hart (Carol Strong), Timothy McCuen Piggee (Agent Cod)",
            "notes": "A nice capture of the short lived show. Disc also includes around 100 minutes of interviews, B-Roll, behind the scenes, etc. Great video with nice picture and clear sound. A",
            "format": "VOB (with smalls)",
            "size": "4.64 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        }
    ],
    "Cats": [
        {
            "id": "e-2001362",
            "tour": "Off-Broadway (The Jellicle Ball)",
            "date": "2024-06-21",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "\"Tempress\" Chasity Moore (Grizabella), André De Shields (Old Deuteronomy), Junior LaBeija (Gus), Tara Lashan Clinkscales (u/s Bombalurina), Dudney Joseph Jr. (Munkustrap), Sydney James Harcourt (Rum Tum Tugger), Bebe Nicole Simpson (Demeter), Emma Sofia (Cassandra/Skimbleshanks), Garnet Williams (u/s Bustopher Jones), Jonathan Burke (Mungojerrie), Dava Huesca (Rumpleteazer), Shereen Pimentel (Jellylorum), Xavier Reyes (Jennyanydots), Robert \"Silk\" Mason (Mr. Mistoffelees), Antwayn Hopper (Macavity), Primo (Tumblebrutus), Teddy Wilson Jr. (Sillabub), Kendall Grayson Stroud (Electra), Baby Byrne (Victoria), Shelby Griswold (u/s Booth/u/s Police Officer/u/s Server), Frank Viveros (Booth/Police Officer/Server), Capital Kaos (DJ)",
            "notes": "<p>Excellent 4K capture of this much-anticipated production. Some action on the balconies or in the audience couldn’t be captured, and because a lot of the staging uses the entire theatre, there are frequent wideshots. Some very minor obstruction in the top right that blocks off a tiny bit of action. Some moments of wandering and unfocusing. Includes curtain call, audio is fed from external source.</p>",
            "format": "MP4",
            "size": "10.77 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-1"
        }
    ],
    "Charlie and the Chocolate Factory": [
        {
            "id": "e-1975",
            "tour": "Broadway",
            "date": "2017-04-20",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Christian Borle (Willy Wonka), Ryan Foust (Charlie Bucket), John Rubinstein (Grandpa Joe), Emily Padgett (Mrs. Bucket), Michael Wartella (Mike Teavee), Jackie Hoffman (Mrs. Teavee), Emma Sofia (Veruca Salt), Ben Crawford (Mr. Salt), Trista Dollison (Violet Beauregarde), Alan H. Green (Mr. Beauregarde), F. Michael Haynie (Augustus Gloop), Kathy Fitzgerald (Mrs. Gloop)",
            "notes": "Great HD capture of the new musical based on classic Roald Dahl novel. A fresh dark take on the material, which was fun and very enjoyable! A great comedic cast and innovative production. A",
            "format": "VOB (with smalls)",
            "size": "8.47 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-0"
        },
        {
            "id": "e-10137",
            "tour": "West End",
            "date": "2015-01-22",
            "time": "E",
            "master": "Lanelle",
            "cast": "Alex Jennings (Willy Wonka), Zachary Loonie (Charlie Bucket), Billy Boyle (u/s Grandpa Joe), Daniel Rhodes (Mike Teavee), Amy Carter (Veruca Salt), Rhianna Dorris (Violet Beauregarde), Vincent Finch (Augustus Gloop)",
            "notes": "Fun show with very imaginative staging, though I do wish they used more songs from (either) movie. The first 5 minutes of Act One has some wandering and blackouts, but after that it is a steady and unobstructed shot. Includes curtain call.",
            "format": "VOB (with smalls)",
            "size": "7.31 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-2"
        }
    ],
    "Chicago": [
        {
            "id": "e-1136466",
            "tour": "First Broadway Revival",
            "date": "2022-06",
            "time": "Unknown",
            "master": "diamondsareforever",
            "cast": "Pamela Anderson (Roxie Hart), Lana Gordon (Velma Kelly), Ryan Silverman (Billy Flynn), Raymond Bokhour (Amos Hart), Brenda Braxton (Matron \"Mama\" Morton), Ryan Lowe (Mary Sunshine)",
            "notes": "Pretty perfect capture of this cast; there are a few moments where the person in front of me leans and blocks some side action. Do not post online.",
            "format": "MP4 x2",
            "size": "3.44 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        }
    ],
    "A Chorus Line": [
        {
            "id": "e-1315",
            "tour": "Hollywood Bowl",
            "date": "2016-07-29",
            "time": "E",
            "master": "SJ Bernly",
            "cast": "Mario Lopez (Zach), Sarah Bowden (Cassie), Spencer Liff (Larry), Mara Davi (Maggie), J. Elaine Marcos (Connie), Sabrina Bryan (Val), Michael Starr (Don), Kelsey Walston (Bebe), Justin Michael Wilcox (Al), Cornelius Jones Jr. (Richie), Denis Lambert (Greg), Krysta Rodriguez (Diana), Robert Fairchild (Mike), Tiana Okoye (Judy), Leigh Zimmerman (Sheila), Courtney Lopez (Kristine), Jason Tam (Paul), Ross Lynch (Mark)",
            "notes": "This all-star cast gives energetic and nuanced performances; the cast as a whole is a stand-out with absolutely incredible dance numbers. Nicely filmed with no obstructions, no washout, just a couple of quick dropouts. Filmed the stage directly; screens are never shown. Filmed in 16:9 with a mix of wides, mediums and close-ups. Show is 125 minutes on one disc. Includes curtain call and playbill scans.",
            "format": "VOB (with smalls)",
            "size": "4.42 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-1"
        }
    ],
    "Cinderella (Andrew Lloyd Webber)": [
        {
            "id": "e-1110380",
            "tour": "West End",
            "date": "2021-06",
            "time": "E",
            "master": "sandrabanana",
            "cast": "Carrie Hope Fletcher (Cinderella), Ivano Turco (Prince Sebastian), Rebecca Trehearn (The Queen), Victoria Hamilton-Barritt (The Stepmother), Laura Baldwin (Adele), Georgina Castle (Marie), Gloria Onitiri (The Godmother), Caleb Roberts (Prince Charming), Vinny Coyle (Arthur), Sam Robinson (Dorian), Giovanni Spano (Gawain), Michael Afemaré (Ensemble), Lauren Byrne (Ensemble), Michelle Bishop (Ensemble), Sophie Camble (Ensemble), Tobias Charles (Ensemble), Nicole Deon (Ensemble), Jonathan David Dudley (Ensemble), Michael Hamway (Ensemble), James Lee Harris (Ensemble), Kate Ivory Jordan (Ensemble), Jessica Kirton (Ensemble), Kelsie-Rae Marshall (Ensemble), Georgina Onuorah (Ensemble), Georgia Tapp (Ensemble), Matthieu Vinetot (Ensemble), Alexandra Waite-Roberts (Ensemble), Rodney Vubya (Ensemble)",
            "notes": "first video of andrew lloyd webber's cinderella taken during the first week of previews. recorded from the side with no obstructions and the revolving stage and seats are shown clearly. there is one mishap in act 1 where the sheet doesnt come off the statue. no swings were on to the best of my knowledge. original 4k files can be included if wanted.\nSCREENSHOTS NOT PERMITTED: contact master for info/screenshots.<br><br>MY NOTES: 1080p version",
            "format": "MP4 x2",
            "size": "4.63 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-2"
        }
    ],
    "Come From Away": [
        {
            "id": "e-1115623",
            "tour": "Broadway",
            "date": "2021-09",
            "time": "Unknown",
            "master": "juniper47",
            "cast": "Rachel Tucker (Beverley/Annette), James Seol (Kevin T./Garth), Joel Hatch (Claude/Others), Paul Whitty (Oz/Others), Emily Walton (Janice/Others), Caesar Samayoa (Kevin J./Ali), Jim Walton (Nick/Doug), Sharon Wheatley (Diane/Others), Q Smith (Hannah/Others), Astrid Van Wieren (Beulah/Others), Pearl Sun (t/r Bonnie/t/r Others), De'Lon Grant (Bob/Others)",
            "notes": "Filmed in 4K, also available as 1080p HD, external clear audio source. Shortly after re-opening. Beautiful picture (further enhanced in post editing), very steady, following action well. A little washout in widest shots, bottom-left occasionally obstructed by the head of a woman who could not sit still, but shot around well as possible. Super enthusiastic audience, giving the entire evening an even more special feeling, and the cast delivered an utterly heartfelt performance of such an uplifting musical. Do not list with exact date—only as September, 2021.",
            "format": "MP4",
            "size": "20.7 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-1"
        },
        {
            "id": "e-1113553",
            "tour": "Broadway",
            "date": "2021-05",
            "time": "Unknown",
            "master": "Proshot",
            "cast": "Jenn Colella (Beverley/Annette), Tony LePage (Kevin T./Garth), Joel Hatch (Claude/Others), Paul Whitty (Oz/Others), Emily Walton (Janice/Others), Caesar Samayoa (Kevin J./Ali), Jim Walton (Nick/Doug), Sharon Wheatley (Diane/Others), Q Smith (Hannah/Others), Astrid Van Wieren (Beulah/Others), Petrina Bromley (Bonnie/Others), De'Lon Grant (Bob/Others)",
            "notes": "Pro-Shot released on Apple TV+ on September 10, 2021, featuring most OBC members",
            "format": "MKV",
            "size": "8.48 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-0"
        }
    ],
    "Company": [
        {
            "id": "e-1129337",
            "tour": "Third Broadway Revival",
            "date": "2022-07-31",
            "time": "M",
            "master": "juniper47",
            "cast": "Katrina Lenk (Bobbie), Patti LuPone (Joanne), Terence Archie (Larry), Matt Doyle (Jamie), Etai Benson (Paul), Jennifer Simard (Sarah), Christopher Sieber (Harry), Rashidra Scott (Susan), Greg Hildreth (Peter), Nikki Renée Daniels (Jenny), Christopher Fitzgerald (David), Claybourne Elder (Andy), Bobby Conte Thornton (PJ), Manu Narayan (Theo), Kathryn Allison (New Yorker), Britney Coleman (New Yorker), Jacob Dickey (New Yorker), Javier Ignacio (New Yorker), Anisha Nagarajan (New Yorker), Heath Saunders (New Yorker)",
            "notes": "Filmed in 4K, released in 1080p and 4K, from almost dead center mezzanine. A head can be seen in some shots, but almost never obstructs the actors aside from maybe their legs here and there. Difficult to shoot some scenes steadily due to need to stretch as tall as possible to see over the head. An electric closing performance, several lengthy standing ovations throughout the show. Includes video of curtain call and speeches at the end. Never to be sold except by master, never to be posted in part or in whole anywhere online.",
            "format": "MP4 x2",
            "size": "29.61 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        }
    ],
    "Concerts (Miscellaneous)": [
        {
            "id": "e-1111793",
            "tour": "Celebrating 25 Years of Disney on Broadway",
            "date": "2019-11-04",
            "time": "E",
            "master": "Proshot",
            "cast": "Ashley Brown (Performer), Lindiwe Dlamini (Performer), Bongi Duma (Performer), Tshidi Manye (Performer), S'bu Ngema (Performer), Ashley Park (Performer), Christian Borle (Performer), James Monroe Iglehart (Performer), Adam Pascal (Performer), Sherie Rene Scott (Performer), Jelani Alladin (Performer), Bradley Gibson (Performer), Alton Fitzgerald White (Performer), Ramona Keller (Performer), Tamika Lawrence (Performer), Kissy Simmons (Performer), Rema Webb (Performer), Syndee Winters (Performer), Susan Egan (Performer), Krysta Rodriguez (Performer), Michael James Scott (Performer), Andrew Barth Feldman (Performer), Kara Lindsay (Performer), Josh Strickland (Performer), Kerry Butler (Performer), Norm Lewis (Performer)",
            "notes": "",
            "format": "MP4",
            "size": "1.28 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-2"
        }
    ],
    "Dear Evan Hansen": [
        {
            "id": "e-338",
            "tour": "Broadway",
            "date": "2017-08-11",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Michael Lee Brown (u/s Evan Hansen), Garrett Long (u/s Heidi Hansen), Olivia Puckett (u/s Zoe Murphy), Jennifer Laura Thompson (Cynthia Murphy), Michael Park (Larry Murphy), Mike Faist (Connor Murphy), Will Roland (Jared Kleinman), Kristolyn Lloyd (Alana Beck)",
            "notes": "Excellent HD capture of understudies going on for the three lead roles. Michael does a terrific job filling Evan's shoes, bringing his own interpretation and power. A",
            "format": "VOB (no smalls)",
            "size": "8.24 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-1"
        },
        {
            "id": "e-88",
            "tour": "Broadway",
            "date": "2016-11",
            "time": "Unknown",
            "master": "SunsetBlvd79",
            "cast": "Ben Platt (Evan Hansen), Rachel Bay Jones (Heidi Hansen), Laura Dreyfuss (Zoe Murphy), Jennifer Laura Thompson (Cynthia Murphy), Michael Park (Larry Murphy), Mike Faist (Connor Murphy), Will Roland (Jared Kleinman), Kristolyn Lloyd (Alana Beck)",
            "notes": "Excellent HD capture of the Broadway transfer. In the long journey to Broadway, the show still lives up to all its hype and greatness. The cast gives amazing performances and leaves it all on the stage. A.\nAdmin Note: The date of this video is speculated to be November 15 or 16, however it was released as November, 2016.",
            "format": "VOB (with smalls)",
            "size": "7.91 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-1"
        }
    ],
    "Death Becomes Her": [
        {
            "id": "e-2000016",
            "tour": "Pre-Broadway / Chicago",
            "date": "May, 2024 (2)",
            "time": "Unknown",
            "master": "soysaucepierre",
            "cast": "Megan Hilty (Madeline Ashton), Jennifer Simard (Helen Sharp), Christopher Sieber (Ernest Menville), Michelle T. Williams (Viola Van Horn), Taurean Everett (Chagall), Josh Lamon (Stefan), Sarita Colón (Ensemble), Kaleigh Cronin (Ensemble), Natalie Charle Ellis (Ensemble), Gabriella Enriquez (Ensemble), Michael Graceffa (Ensemble), Neil Haskell (Ensemble), Kolton Krouse (Ensemble), Sarah Meahl (Ensemble), Diana Vaden (Ensemble), Sir Brock Warren (Ensemble), Bud Weber (Ensemble), Ryan Worsing (Ensemble), Warren Yang (Ensemble), Marija Juliette Abney (Ensemble)",
            "notes": "<p>Masters first complete video of this show. The first 2 minutes of Act 1 and the first 5 minutes of Act 2 are audio only due to usher activity. Other than that, there are only a couple short dropouts. The start of Act 2 is wide blindshot but gets better after a few minutes. Act 1 has an annoying head that covers some of stage left (somebody sat right in front of me roughly one minute into the show) but the head is gone in Act 2. Some readjustment, washout, and pixelation throughout. A good mix of mediums and closeups with a few wideshots. Shot from Mezz Left.</p>",
            "format": "MP4",
            "size": "9.47 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-0"
        }
    ],
    "Dogfight": [
        {
            "id": "e-407",
            "tour": "Off-Broadway",
            "date": "2012-08-15",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Lindsay Mendez (Rose Fenny), Derek Klena (Eddie Birdlace), Josh Segarra (Boland), Nick Blaemire (Bernstein), Annaleigh Ashford (Marcy), Becca Ayers (Mama), Steven Booth (Gibbs), Adam Halpin (Stevens), F. Michael Haynie (Fector), James Moye (Lounge Singer), Dierdre Friel (Ruth Two Bears)",
            "notes": "A beautiful coming of age story with great performances from the cast. Annaleigh is wonderful here as usual. Great HD capture in a very small theater; in wider shots, heads can be in the frame toward the bottom, but mostly shot over them. A-",
            "format": "VOB (with smalls)",
            "size": "7.89 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-1"
        }
    ],
    "The Drowsy Chaperone": [
        {
            "id": "e-5781",
            "tour": "Broadway",
            "date": "2006-07-29",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Bob Martin (Man in Chair), Sutton Foster (Janet Van De Graaff), Beth Leavel (The Drowsy Chaperone), Troy Britton Johnson (Robert Martin), Danny Burstein (Aldolpho), Eddie Korbich (George), Georgia Engel (Mrs. Tottendale), Noble Shropshire (Underling), Kecia Lewis-Evans (Trix), Jason Kravits (Gangster #1), Garth Kravits (Gangster #2)",
            "notes": "Beautiful filming and picture. Great shots! A+<br><br>MY NOTES: The smalls don't actually work but I've been told that they may just be broken for this video :(",
            "format": "VOB (with smalls)",
            "size": "3.37 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-2"
        }
    ],
    "Elf": [
        {
            "id": "e-1070",
            "tour": "Broadway",
            "date": "2010-11-16",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Sebastian Arcelus (Buddy), Amy Spanger (Jovie), Beth Leavel (Emily), Mark Jacoby (Walter Hobbs), George Wendt (Santa), Matthew Gumley (Michael), Valerie Wright (Deb), Michael McCormick (Mr. Greenway), Michael Mandell (Macy's Manager)",
            "notes": "<p>Stunning, vibrant and beautiful capture of this charming show. The show is such fun, colorful and perfect for the holidays. Great performances from the cast and very nice songs and story! A+</p>",
            "format": "VOB (with smalls)",
            "size": "4.12 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        }
    ],
    "Falsettos": [
        {
            "id": "e-64",
            "tour": "First Broadway Revival",
            "date": "2017-01",
            "time": "Unknown",
            "master": "Proshot",
            "cast": "Christian Borle (Marvin), Andrew Rannells (Whizzer), Stephanie J. Block (Trina), Brandon Uranowitz (Mendel), Anthony Rosenthal (Jason), Tracie Thoms (Dr. Charlotte), Betsy Wolfe (Cordelia)",
            "notes": "Filmed January 3 & 4, 2017 and aired on PBS on October 27, 2017.",
            "format": "MKV",
            "size": "11.02 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-0"
        },
        {
            "id": "e-5787",
            "tour": "Second US National Tour",
            "date": "1994",
            "time": "Unknown",
            "master": "Unknown",
            "cast": "Michael Rupert (Marvin), Stephen Bogardus (Whizzer), Barbara Walsh (Trina), Chip Zien (Mendel), Sivan Cotel (Jason), Heather MacRae (Dr. Charlotte), Carolee Carmello (Cordelia)",
            "notes": "The same video that has been titled 1993 Los Angeles. Dates confirmed via contemporary reviews (ie: Variety) April 28-July 3, 1994. There are two very different quality transfers shown now in the screenshots. The smaller size VOBs are the nicer looking ones. The worse transfer also starts a little later, missing the first sung line of Four Jews in a Room Bitching.<br><br>MY NOTES: I also have the worse transfer, also VOB with smalls at 4.16 GB",
            "format": "VOB (with smalls)",
            "size": "2.43 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-0"
        },
        {
            "id": "e-1445",
            "tour": "First Broadway Revival",
            "date": "2016-10-28",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Christian Borle (Marvin), Andrew Rannells (Whizzer), Stephanie J. Block (Trina), Brandon Uranowitz (Mendel), Anthony Rosenthal (Jason), Tracie Thoms (Dr. Charlotte), Betsy Wolfe (Cordelia)",
            "notes": "Beautiful HD capture of the Revival following opening night. Such a talented cast and the chemistry amongst them is incredible. Beautifully executed and not to be missed! A",
            "format": "VOB (with smalls)",
            "size": "8.75 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        }
    ],
    "Frozen": [
        {
            "id": "e-1005669",
            "tour": "Broadway",
            "date": "2020-03-11",
            "time": "M",
            "master": "Unknown",
            "cast": "Ciara Renée (Elsa), McKenzie Kurtz (Anna), Anna Rae Haller (Young Elsa), Charlie Tassone (Young Anna), Ryann Redmond (Olaf), Noah J. Ricketts (Kristoff), Adam Jepsen (Sven), Ryan McCartan (Hans), Kevin Del Aguila (Oaken), Robert Creighton (Weselton), Donald Jones Jr. (Pabbie), Tracee Beazer (Bulda), Tyrone L. Robinson (King Agnarr), Ann Sanders (Queen Iduna), Robin Masella (Head Handmaiden), Jacob Smith (Bishop)",
            "notes": "18 short clips running 24 minutes long, filmed on a cell phone from the rear left mezzanine, includes Let it Go, I Cant Lose You, Fixer Upper, Monster, Colder by the Minute, Finale, and Curtain Call. The full show does not exist. 1080p YouTube rip, gifted upon request.<br><br>MY NOTES: Apparently this is mislabeled and is actually March 10",
            "format": "MP4 x18",
            "size": "738.3 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-02-0"
        },
        {
            "id": "e-350",
            "tour": "Broadway",
            "date": "2018-05-03",
            "time": "E",
            "master": "NYCG8R",
            "cast": "Caissie Levy (Elsa), Patti Murin (Anna), Mimi Ryder (Young Elsa), Zoe Glick (Young Anna), Greg Hildreth (Olaf), Jelani Alladin (Kristoff), Andrew Pirozzi (Sven), John Riddle (Hans), Kevin Del Aguila (Oaken), Robert Creighton (Weselton), Timothy Hughes (Pabbie), Olivia Phillip (Bulda), James Brown III (King Agnarr), Ann Sanders (Queen Iduna), Wendi Bergamini (Head Handmaiden), Jacob Smith (Bishop), Tracee Beazer (Ensemble), Ashley Blanchet (Ensemble), Claire Camp (Ensemble), Lauren Nicole Chapman (Ensemble), Jeremy Davis (Ensemble), Kali Grinder (Ensemble), Zach Hess (Ensemble), Donald Jones Jr. (Ensemble), Nina Lafarga (Ensemble), Ross Lekites (Ensemble), Austin Lesch (Ensemble), Synthia Link (Ensemble), Adam Perry (Ensemble), Nicholas Ward (Ensemble), Noah J. Ricketts (Ensemble)",
            "notes": "Great capture from the Broadway transfer and a few minor changes from the Denver run. Nicely captured from the balcony.",
            "format": "VOB (with smalls)",
            "size": "4.52 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-2"
        },
        {
            "id": "e-29167",
            "tour": "Broadway",
            "date": "2020-02",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Ciara Renée (Elsa), McKenzie Kurtz (Anna), Anna Rae Haller (Young Elsa), Charlie Tassone (Young Anna), Ryann Redmond (Olaf), Noah J. Ricketts (Kristoff), Adam Jepsen (Sven), Ryan McCartan (Hans), Kevin Del Aguila (Oaken), Robert Creighton (Weselton), Donald Jones Jr. (Pabbie), Tracee Beazer (Bulda), Tyrone L. Robinson (King Agnarr), Ann Sanders (Queen Iduna), Robin Masella (Head Handmaiden), Jacob Smith (Bishop), Kate Bailey (Ensemble), Keely Beirne (Ensemble), Claire Camp (Ensemble), Spencer Clark (s/w Ensemble), Michael Fatica (Ensemble), Charissa Hogeland (Ensemble), Nina Lafarga (Ensemble), Austin Lesch (Ensemble), Ellen Marlow (Ensemble), Julius Anthony Rubio (Ensemble), Anthony Sagaria (Ensemble), Jake David Smith (Ensemble), Bronwyn Tarboton (s/w Ensemble), Harris M Turner (Ensemble), Charlie Williams (Ensemble), Cajai Kennedy (Ensemble)",
            "notes": "Beautiful HD capture of the new Broadway cast! Filmed from the left orchestra with a mix of wides, mediums, and closeups. Features the new song I Can't Lose You that replaces For the First Time in Forever (Reprise). Last known full video of the Broadway production before the untimely closing the following month.",
            "format": "MP4",
            "size": "5.47 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-2"
        },
        {
            "id": "e-24842",
            "tour": "Broadway",
            "date": "2020-01",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Alyssa Fox (s/b Elsa), Patti Murin (Anna), Suri Marrero (Young Elsa), Fiona Morgan Quinn (Young Anna), Chad Burris (t/r Olaf), Harris M Turner (u/s Kristoff), Andrew Pirozzi (Sven), Joe Carroll (Hans), Kevin Del Aguila (Oaken), Robert Creighton (Weselton), Jeff Pew (u/s Pabbie), Keely Beirne (u/s Bulda), Tyrone L. Robinson (King Agnarr), Alicia Albright (u/s Queen Iduna), Robin Masella (Head Handmaiden), Brian Steven Shaw (s/w Bishop)",
            "notes": "Stunning HD capture of Alyssa as Elsa, Chad's temporary residence in the company, and one of Harris' first shows as Kristoff. Filmed from the left orchestra with a mix of wides, mediums, and many closeups.",
            "format": "MP4",
            "size": "5.53 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-0"
        }
    ],
    "Funny Girl": [
        {
            "id": "e-8834",
            "tour": "UK Tour",
            "date": "2017-08",
            "time": "Unknown",
            "master": "Proshot",
            "cast": "Sheridan Smith (Fanny Brice), Darius Campbell Danesh (Nick Arnstein), Rachel Izen (Mrs. Brice), Joshua Lay (Eddie), Nigel Barber (Florenz Ziegfield), Jennifer Harding (Emma/Mrs. Nadler), Zoe Ann Brown (Mrs. Meeker), Myra Sands (Mrs. Strakosh), Tom Partridge (Paul/Mr. Renaldi/Tenor), Lloyd Davies (John/Cornet Man), Alexandra Waite-Roberts (Bubbles), Flora Dawson (Mimsey), Alexandra Wright (Polly), Gillian Parkhouse (Vera), Martin Callaghan (Mr. Keeney), Peter Nash (Cornet Man), Bronte Lavine (Ensemble), Sam Wingfield (Ensemble)",
            "notes": "Professionally filmed live at the Manchester Palace Theatre. Multiple versions circulate, including one that is lower quality and windowboxed (first screenshot), and another which is 1080p (10 GB)<br><br>MY NOTES: I have the window boxed version, I'm looking for the other version",
            "format": "MKV",
            "size": "1.8 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-3"
        },
        {
            "id": "e-2002318",
            "tour": "Third US National Tour",
            "date": "2024-06",
            "time": "E",
            "master": "MTTZ",
            "cast": "Katerina McCrimmon (Fanny Brice), Stephen Mark Lukas (Nick Arnstein), Melissa Manchester (Mrs. Brice), Izaiah Montaque Harris (Eddie), Walter Coppage (Florenz Ziegfield), Leah Platt (Emma/Mrs. Nadler), Cindy Chang (Mrs. Meeker), Eileen T'Kaye (Mrs. Strakosh), Sean Seamus Thompson (u/s Tom Keeney)",
            "notes": "<p>Fantastic capture of this stunning tour from start to finish! Katerina was on fire in this performance and was giving her everything. Shot in a great mix of wides, mediums, and semi close-ups. Some wandering, shaking, and re-adjusting throughout and especially in the second act that doesn't take much away from the viewing experience.</p>",
            "format": "MP4",
            "size": "10.25 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-0"
        },
        {
            "id": "e-1124920",
            "tour": "First Broadway Revival",
            "date": "2022-04",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Julie Benko (s/b Fanny Brice), Jeremiah James (s/b Nick Arnstein), Jane Lynch (Mrs. Brice), Jared Grimes (Eddie), Peter Francis James (Florenz Ziegfield), Ephie Aardema (Emma/Mrs. Nadler), Debra Cardona (Mrs. Meeker), Toni Dibuoni (Mrs. Strakosh), Martin Moran (Tom Keeney/Actor), Stephen Mark Lukas (Paul/Mr. Renaldi/Bartender), Kurt Csolak (John/Cornet Man/Rat-tat-tat-tat Man), Afra Hines (Bubbles), Alicia Lundgren (Maude), Katie Mitchell (Mimsey), Danielle Kelsey (Polly), Amber Ardolino (Vera), Aliah James (Virginia), Colin Bradbury (s/w Cornet Man), John Manzari (Rat-tat-tat-tat Man), Daniel Beeman (Tenor/Porter), Masumi Iwai (Ensemble), Mariah Reives (Ensemble)",
            "notes": "Julie's debut!",
            "format": "MP4",
            "size": "7.33 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-1"
        }
    ],
    "The Great Gatsby": [
        {
            "id": "e-1158072",
            "tour": "Broadway",
            "date": "2024-05-09",
            "time": "M",
            "master": "bikinibottomday",
            "cast": "Jeremy Jordan (Jay Gatsby), Eva Noblezada (Daisy Buchanan), Noah J. Ricketts (Nick Carraway), Samantha Pauly (Jordan Baker), Sara Chase (Myrtle Wilson), Ryah Nixon (u/s Myrtle Wilson), Eric Anderson (Meyer Wolfsheim), John Zdrojeski (Tom Buchanan), Paul Whitty (George Wilson), Dariana Mullen (Gilda Gray), Kayla Pecchioni (Mrs. McKee), Traci Elaine Lee (Bystander #1), Dan Rosales (Bystander #2), Austin Colby (Ensemble), Curtis Holland (Ensemble), Mariah Reives (Ensemble), Dave Schoonover (Ensemble), Katie Webber (Ensemble), Tanairi Sade Vazquez (Ensemble)",
            "notes": "Excellent 4K capture of this new musical! Thirty second blackout after Past is Catching Up To Me. Both acts have very minor obstruction that shouldn't block any action. Ryah went on for Myrtle in Act Two. Some moments of wandering and unfocusing. Some washout on wider shots. Includes curtain call, audio fed from external source.",
            "format": "MP4",
            "size": "11.05 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        },
        {
            "id": "e-1155831",
            "tour": "Paper Mill Playhouse",
            "date": "2023-10",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Jeremy Jordan (Jay Gatsby), Eva Noblezada (Daisy Buchanan), Noah J. Ricketts (Nick Carraway), Samantha Pauly (Jordan Baker), Sara Chase (Myrtle Wilson), Stanley Wayne Mathis (Meyer Wolfsheim), John Zdrojeski (Tom Buchanan), Paul Whitty (George Wilson), Dan Rosales (Mr. McKee), Dariana Mullen (Gilda Gray), Ayla Ciccone-Burton (Mrs. McKee/Twin), Natalie Charle Ellis (Catherine), Pascal Pastrana (Cop), Maya Sistruck (Twin/Ensemble), Colin Cunliffe (Ol' Owl Eyes), Raymond Baynard (Ensemble), Austin Colby (Ensemble), Curtis Holland (Ensemble), Mariah Reives (Ensemble), Julio Rey (Ensemble), Tanairi Sade Vazquez (Ensemble), Katie Webber (Ensemble)",
            "notes": "",
            "format": "MP4",
            "size": "6.62 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-2"
        }
    ],
    "Groundhog Day": [
        {
            "id": "e-1098",
            "tour": "Broadway",
            "date": "2017-04-01",
            "time": "M",
            "master": "SunsetBlvd79",
            "cast": "Andy Karl (Phil Connors), Barrett Doss (Rita Hanson), John Sanders (Ned Ryerson), Raymond J. Lee (Ralph), Vishal Vaidya (Larry), Heather Ayers (Mrs. Lancaster), Katy Geraghty (Debbie), Josh Lamon (Buster), Joseph Medeiros (Deputy), Jenna Rubaii (Joelle), Sean Montgomery (Sheriff), Gerard Canonico (Fred), Andrew Call (Gus), Travis Waldschmidt (Jeff), Rebecca Faulkenberry (Nancy Taylor), Tari Kelly (Piano Teacher), Michael Fatica (Chubby Man), Rheaume Crenshaw (Doris), William Parry (Jenson), Taylor Iman Jones (Lady Storm Chaser)",
            "notes": "Excellent HD capture of the new musical based on the movie. Such an amazing set and Andy gives a terrific performance. The set malfunctioned once and they had to pause and restart the song.",
            "format": "VOB (with smalls)",
            "size": "8.66 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-2"
        }
    ],
    "Gypsy": [
        {
            "id": "e-432",
            "tour": "Fourth Broadway Revival",
            "date": "2008-03-25",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Patti LuPone (Rose), Boyd Gaines (Herbie), Laura Benanti (Louise), Leigh Ann Larkin (June), Alison Fraser (Tessie Tura), Marilyn Caskey (Electra), Lenora Nemetz (Mazeppa/Miss Cratchitt), Tony Yazbeck (Tulsa)",
            "notes": "MASTER NOTES: A not-to-be-missed production, very detailed and near perfection. Beautifully captured and performances that embody the definition of musical theater. Great close-ups. Some blackouts but not on the musical numbers. Balcony edge can be seen sometimes. Masterclass performances. A<br><br>GENERAL NOTES: T/W: This video contains a PETA advertisement at the beginning, which contains graphic images and may be distressing.  This was included by the master on release.",
            "format": "VOB (with smalls)",
            "size": "4.49 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        }
    ],
    "Hadestown": [
        {
            "id": "e-2004761",
            "tour": "Broadway",
            "date": "2024-09",
            "time": "M",
            "master": "TheatreCouple14",
            "cast": "Jordan Fisher (Orpheus), Maia Reficco (Eurydice), Yola (Persephone), Phillip Boykin (Hades), Stephanie Mills (Hermes), Belén Moyano (Fate), Jessie Shelton (Fate), Emily Afton (u/s Fate), Malcolm Armwood (Worker), Timothy H. Lee (Worker), Brandon Cameron (s/w Worker), Tara Jackson (s/w Worker), Yael \"YaYa\" Reich (s/w Worker)",
            "notes": "MASTER NOTES: Excellent wide-shot phone video taken from the right Orchestra. Very few moments on the far left not captured (mostly Hermes narrating, and some of Yola dancing in Our Lady of the Underground). Doubt comes in is mostly black, unfortunately. Yaya's last show, Stephanie gives her bow to Yaya and flowers are given during We raise our cups. This cast is exceptional. The best I've ever seen this show in-person.<br><br>GENERAL NOTES: Includes video, audio (tracked and untracked), and understudy board photo.<br><br>MY NOTES: also MP3 x39 + x2 (640 MB)",
            "format": "MP4",
            "size": "7.85 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        },
        {
            "id": "e-2000492",
            "tour": "Broadway",
            "date": "2024-05-29",
            "time": "E",
            "master": "Medium Observation",
            "cast": "Jordan Fisher (Orpheus), Isa Briones (Eurydice), Ani DiFranco (Persephone), Phillip Boykin (Hades), Jon Jon Briones (Hermes), Jessie Shelton (Fate), Kay Trinidad (Fate), Brit West (Fate), Malcolm Armwood (Worker), Sayo Oni (Worker), Emily Afton (Worker), Alex Puette (Worker), Grace Yoo (Worker)",
            "notes": "<p>Near perfect capture of this incredible cast. there is a brief 30 second blackout at the end of road to hell. some readjusting and shakiness is seen throughout. includes we raise our cups.</p>",
            "format": "MP4",
            "size": "11.02 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-0"
        },
        {
            "id": "e-1155333",
            "tour": "Broadway",
            "date": "2024-02-09",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Jordan Fisher (Orpheus), Lola Tung (Eurydice), Ani DiFranco (Persephone), Phillip Boykin (Hades), Lillias White (Hermes), Belén Moyano (Fate), Kay Trinidad (Fate), Brit West (Fate), Emily Afton (Worker), Malcolm Armwood (Worker), Chibueze Ihuoma (Worker), Alex Puette (Worker), Grace Yoo (Worker)",
            "notes": "Excellent 4K capture of Lola and Ani's debuts! Minor head obstruction at the bottom and some occasional brief additional obstruction. Some wandering/readjustment and unfocusing throughout. Includes curtain call and We Raise Our Cups, audio fed from external source.",
            "format": "MP4",
            "size": "10.64 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-2"
        },
        {
            "id": "e-1151337",
            "tour": "Broadway",
            "date": "2023-11-24",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Jordan Fisher (Orpheus), Solea Pfeiffer (Eurydice), Betty Who (Persephone), Phillip Boykin (Hades), Malcolm Armwood (u/s Hermes), Belén Moyano (Fate), Tara Jackson (u/s Fate), Brit West (Fate), Alex Lugo (s/w Worker), Brandon Cameron (s/w Worker), Eddie Noel Rodríguez (s/w Worker), Tanner Ray Wilson (s/w Worker), Grace Yoo (Worker)",
            "notes": "Excellent 4K capture of Jordan in his first week! Three short blackouts in Act One, after All I've Ever Known (30 seconds), in the middle of Hey Little Songbird (25 seconds), and the intro to Wait For Me (15 seconds). Occasional wandering/readjusting and unfocusing. Includes curtain call, We Raise Our Cups, and the post-show BC/EFA speech, audio fed from external source.",
            "format": "MP4",
            "size": "10.56 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-0"
        }
    ],
    "Hairspray": [
        {
            "id": "e-8387",
            "tour": "Broadway",
            "date": "2002-07-29",
            "time": "E",
            "master": "Unknown",
            "cast": "Marissa Jaret Winokur (Tracy Turnblad), Harvey Fierstein (Edna Turnblad), Kerry Butler (Penny Pingleton), Linda Hart (Velma Von Tussle), Laura Bell Bundy (Amber Von Tussle), Dick Latessa (Wilbur Turnblad), Matthew Morrison (Link Larkin), Jackie Hoffman (Prudy Pingleton/Female Authority Figure), Shoshana Bean (Shelley), Joel Vig (Male Authority Figure), Kamilah Martin (Dynamite #1), Shayna Steele (Dynamite #2), Judine Richard (Dynamite #3)",
            "notes": "Digital, Shot from first row mezz. Lots of close ups.",
            "format": "VOB (with smalls)",
            "size": "2.41 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-0"
        }
    ],
    "Hamilton": [
        {
            "id": "e-74",
            "tour": "Broadway",
            "date": "2015-12-29",
            "time": "E",
            "master": "SJ Bernly",
            "cast": "Lin-Manuel Miranda (Alexander Hamilton), Phillipa Soo (Eliza Hamilton), Leslie Odom Jr. (Aaron Burr), Renée Elise Goldsberry (Angelica Schuyler), Christopher Jackson (George Washington), Daveed Diggs (Marquis de Lafayette/Thomas Jefferson), Okieriete Onaodowan (Hercules Mulligan/James Madison), Anthony Ramos (John Laurens/Philip Hamilton), Jasmine Cephas Jones (Peggy Schuyler/Maria Reynolds), Jonathan Groff (King George III), Sydney James Harcourt (Philip Schuyler/James Reynolds/Doctor), Daniel J. Watts (t/r Samuel Seabury), Neil Haskell (s/w Charles Lee), Ephraim Sykes (George Eacker)",
            "notes": "The man, the myth, the legend. This year's most talked about show, fully captured. Enjoy. This is a great capture overall; there are some heads at the bottom and sides that can be seen occasionally, especially in wider shots, but they are worked around when necessary and rarely affect the action. There are no major blackouts, just a few quick dropouts, mostly between scenes. It's filmed in 16:9, with a mix of wides, mediums, and close-ups. The sound is excellent. Includes curtain call and playbill scans.",
            "format": "VOB (with smalls)",
            "size": "8.82 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-2"
        },
        {
            "id": "e-1122077",
            "tour": "Second US National Tour (Philip)",
            "date": "2021-11",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Pierre Jean Gonzalez (Alexander Hamilton), Stephanie Jae Park (Eliza Hamilton), Jared Dixon (Aaron Burr), Ta'Rea Campbell (Angelica Schuyler), Marcus Choi (George Washington), Warren Egypt Franklin (Marquis de Lafayette/Thomas Jefferson), Desmond Sean Ellington (Hercules Mulligan/James Madison), Elijah Malcomb (John Laurens/Philip Hamilton), Paige Smallwood (Peggy Schuyler/Maria Reynolds), Neil Haskell (King George III), Nick Sanchez (Philip Schuyler/James Reynolds/Doctor), Aaron J. Albano (Samuel Seabury), Gabriel Hyman (Charles Lee), Trevor Miles (George Eacker), Nicole DeRoux (Ensemble), Jonathan Christopher (Ensemble), DeMarius R. Copes (Ensemble), Kristen Hoagland (Ensemble), Samantha Pollino (Ensemble), Quiantae Thomas (Ensemble)",
            "notes": "",
            "format": "MP4",
            "size": "7.51 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-1"
        }
    ],
    "Heathers: The Musical": [
        {
            "id": "e-1131544",
            "tour": "Off-West End Revival",
            "date": "2022-05",
            "time": "Unknown",
            "master": "Proshot",
            "cast": "Ailsa Davidson (Veronica Sawyer), Simon Gordon (Jason \"J.D.\" Dean), Maddison Firth (Heather Chandler), Vivian Panka (Heather Duke), Teleri Hughes (Heather McNamara), Rory Phelan (Ram Sweeney), Liam Doyle (Kurt Kelly), Mhairi Angus (Martha Dunnstock), Vicki Lee Taylor (Ms. Fleming/Veronica's Mom), Andy Brady (Ram's Dad/Veronica's Dad/Principal Gowan), Oliver Brooks (Kurt's Dad/Big Bud Dean/Coach Ripper), Benjamin Karran (Beleaguered Geek), Jermaine Woods (Preppy Stud/Officer Milner), Christopher Parkinson (Hipster Dork/Officer McCord), Hannah Lowther (New Wave Party Girl), Mary-Jean Caldwell (Stoner Chick), Eleanor Morrison-Halliday (Young Republicanette), May Tether (Drama Club Drama Queen)",
            "notes": "Pro-shot filmed in May 2022 with the Off-West End cast, and released on September 16, 2022. Originally released on Roku. Veronica Sawyer does her best to survive her senior year while navigating the beautiful but cruel Heathers, the new to school Jason J.D. Dean, and the constant pressure to fit in with everyone else.\nThree versions exist, the one released on Roku, the one released in UK cinemas without ad breaks or BTS moments, and one that contains a BTS of the filming process with no ad breaks.",
            "format": "MP4",
            "size": "5.64 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        },
        {
            "id": "e-65",
            "tour": "Off-Broadway",
            "date": "2014-05-25",
            "time": "E",
            "master": "SJ Bernly",
            "cast": "Barrett Wilbert Weed (Veronica Sawyer), Dan Domenech (u/s Jason \"J.D.\" Dean), Charissa Hogeland (u/s Heather Chandler), Alice Lee (Heather Duke), Elle McLemore (Heather McNamara), Jon Eidson (Ram Sweeney), Evan Todd (Kurt Kelly), Katie Ladner (Martha Dunnstock), Michelle Duffy (Ms. Fleming/Veronica's Mom), Anthony Crivello (Ram's Dad/Big Bud Dean/Coach Ripper), Daniel Cooney (Kurt's Dad/Veronica's Dad/Principal Gowan), Dustin Sullivan (Beleaguered Geek), AJ Meijer (Preppy Stud/Officer Milner), Matthew Schatz (s/w Hipster Dork/s/w Officer McCord), Molly Hager (s/w New Wave Party Girl), Rachel Flynn (Stoner Chick), Cait Fairbanks (Young Republicanette)",
            "notes": "MASTER NOTES: <p>A near perfect capture and the first known DVD of this shows Off-Broadway run. Barrett is incredibly talented: amazing vocals, acting and comedic timing. Dan and Charissa are both fantastic in their roles as well. The show is absolutely hysterical, much improved from the movie version. The first minute of Act One is blacked out, but the show is otherwise fully intact with no blackouts and only slight washout in a few wide shots. There is no obstruction, the video is steady, the sound is excellent, and its captured very well with the usual mix of wides, mediums, and close-ups. Its filmed in 16:9 and includes curtain call, encore, and playbill scans.</p><br><br>GENERAL NOTES: Available as both a widely circulated DVD, and a much rarer 1080p Blu-Ray.",
            "format": "VOB (with smalls)",
            "size": "6.15 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        }
    ],
    "Hell's Kitchen": [
        {
            "id": "e-2000756",
            "tour": "Broadway",
            "date": "2024-05-16",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Maleah Joi Moon (Ali), Shoshana Bean (Jersey), Kecia Lewis-Evans (Miss Liza Jane), Brandon Victor Dixon (Davis), Chris Lee (Knuck), Vanessa Ferguson (Tiny), Jackie Leon (Jessica), Nyseli Vega (Millie), Chad Carstarphen (Ray), Rema Webb (Crystal), Jakeim Hart (Q), Lamont Walker II (Riq), Reid Clarke (Ensemble), Chloe Davis (Ensemble), Nico DeJesus (Ensemble), Timothy L. Edwards (Ensemble), David Guzman (Ensemble), Raechelle Manalo (Ensemble), Sarah Parker (Ensemble), Niki Saludez (Ensemble)",
            "notes": "<p>Excellent 4K capture of this new musical! Increased moments of wandering and unfocusing. Spotlight washout somewhat frequently. First minute or so is blocked by people standing up. Very minor head obstruction on the sides. Includes curtain call, audio is fed from external source.</p>",
            "format": "MP4",
            "size": "11.51 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-1"
        }
    ],
    "How to Succeed in Business Without Really Trying": [
        {
            "id": "e-5807",
            "tour": "First Broadway Revival",
            "date": "1995 (3)",
            "time": "Unknown",
            "master": "Unknown",
            "cast": "Matthew Broderick (J. Pierrepont Finch), Ronn Carroll (J.B. Biggley), Megan Mullally (Rosemary Pilkington), Luba Mason (Hedy La Rue), Jeff Blumenkrantz (Bud Frump), Victoria Clark (Smitty), Lillias White (Miss Jones), Jonathan Freeman (Bert Bratt)",
            "notes": "Typical video of the day, audio is good.",
            "format": "VOB (with smalls)",
            "size": "2.47 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-0"
        },
        {
            "id": "e-1105",
            "tour": "Second Broadway Revival",
            "date": "2011-02-28",
            "time": "E",
            "master": "NYCG8R",
            "cast": "Daniel Radcliffe (J. Pierrepont Finch), John Larroquette (J.B. Biggley), Rose Hemingway (Rosemary Pilkington), Tammy Blanchard (Hedy La Rue), Christopher J. Hanke (Bud Frump), Mary Faber (Smitty)",
            "notes": "Fantastic video with no obstructions at all with great closeups throughout that features some material that has since been cut from the show; disc also includes around 45 minutes of reviews, opening night footage and interviews. A+",
            "format": "VOB (with smalls)",
            "size": "4.17 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-0"
        }
    ],
    "If/Then": [
        {
            "id": "e-186",
            "tour": "First US National Tour",
            "date": "2016-01-24",
            "time": "E",
            "master": "SJ Bernly",
            "cast": "Idina Menzel (Elizabeth), LaChanze (Kate), Trey Ellett (u/s Lucas), James Snyder (Josh), Daren A Herbert (Stephen), Janine DiVita (Anne), Marc delaCruz (David), Kyra Faith (Elena), Corey Greenan (Deputy Mayor/Others), Cliffton Hall (A Bartender/Others), Xavier Cano (A Soldier/Others), Alicia Taylor Tomasko (A Flight Attendant/Others), Tyler McGee (A Street Musician/Others), English Bernhardt (Paulette/Others), Deedee Magno Hall (Cathy/Others)",
            "notes": "Idina's last performance. An emotional performance by the whole cast, particularly Idina. Her feelings overcome her during Always Starting Over and the Finale, leading to roaring cheers of support from the crowd. There is also a fantastic blooper during What If: Elizabeth's phone rings and the phone is not in her pocket. Chaos ensues. A really fantastic capture with no obstruction, no washout, and just two quick dropouts in Act One. It's filmed in 16:9, with a mix of wides, mediums, and close-ups. The sound is excellent. Includes curtain call and playbill scans. A",
            "format": "VOB (with smalls)",
            "size": "8.49 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-0"
        }
    ],
    "In the Heights": [
        {
            "id": "e-437",
            "tour": "Broadway",
            "date": "2008-05-18",
            "time": "E",
            "master": "broadwayspunk",
            "cast": "Lin-Manuel Miranda (Usnavi), Mandy Gonzalez (Nina), Christopher Jackson (Benny), Krysta Rodriguez (u/s Vanessa), Olga Merediz (Abuela Claudia), Carlos Gomez (Kevin), Priscilla Lopez (Camila), Andréa Burns (Daniela), Stephanie Klemons (u/s Carla), Robin de Jesús (Sonny), Seth Stewart (Graffiti Pete)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "4.47 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        },
        {
            "id": "e-436",
            "tour": "Broadway",
            "date": "2008-02-14",
            "time": "E",
            "master": "Unknown",
            "cast": "Lin-Manuel Miranda (Usnavi), Mandy Gonzalez (Nina), Christopher Jackson (Benny), Karen Olivo (Vanessa), Olga Merediz (Abuela Claudia), Carlos Gomez (Kevin), Priscilla Lopez (Camila), Andréa Burns (Daniela), Janet Dacal (Carla), Robin de Jesús (Sonny), Seth Stewart (Graffiti Pete), Eliseo Roman (Piragua Guy), Tony Chiroldes (Ensemble), Rosie Lani Fiedelman (Ensemble), Joshua Henry (Ensemble), Afra Hines (Ensemble), Nina Lafarga (Ensemble), Doreen Montalvo (Ensemble), Javier Muñoz (Ensemble), Krysta Rodriguez (Ensemble), Luis Salgado (Ensemble), Shaun Taylor-Corbett (Ensemble), Rickey Tripp (Ensemble)",
            "notes": "Well filmed from the balcony on the first night of previews. Occasional heads appear in the bottom of the shot. A bit shaky at times, but overall pretty good, with great close ups.",
            "format": "VOB (with smalls)",
            "size": "4.7 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-1"
        },
        {
            "id": "e-1679",
            "tour": "Broadway",
            "date": "2008-03-05",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Javier Muñoz (u/s Usnavi), Mandy Gonzalez (Nina), Christopher Jackson (Benny), Karen Olivo (Vanessa), Olga Merediz (Abuela Claudia), Carlos Gomez (Kevin), Priscilla Lopez (Camila), Andréa Burns (Daniela), Janet Dacal (Carla), Robin de Jesús (Sonny), Seth Stewart (Graffiti Pete), Eliseo Roman (Piragua Guy)",
            "notes": "MASTER NOTES: Great capture of this great show with fantastic closeups! Javier does a smashing job. Great cast and energy. A<br><br>GENERAL NOTES: T/W: This video contains a PETA advertisement at the beginning, which contains graphic images and may be distressing.  This was included by the master on release.",
            "format": "VOB (with smalls)",
            "size": "4.48 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-0"
        }
    ],
    "Into the Woods": [
        {
            "id": "e-1137476",
            "tour": "Second Broadway Revival",
            "date": "2022-06-28",
            "time": "E",
            "master": "juniper47",
            "cast": "Patina Miller (Witch), Brian d'Arcy James (Baker), Sara Bareilles (Baker's Wife), Phillipa Soo (Cinderella), Julia Lester (Little Red Riding Hood), Cole Thompson (Jack), Gavin Creel (Wolf/Cinderella's Prince), Joshua Henry (Rapunzel's Prince), David Patrick Kelly (Narrator/Mysterious Man), Aymee Garcia (Jack's Mother), Nancy Opel (Cinderella's Stepmother), Brooke Ishibashi (Florinda), Ta'Nika Gibson (Lucinda), Albert Guerzon (Cinderella's Father), David Turner (Steward), Alysia Velez (Rapunzel), Annie Golden (Granny/Cinderella's Mother/Giant's Voice), Kennedy Kanagawa (Milky White)",
            "notes": "Filmed in 4K, released in 1080p and 4K. The very first preview of the Broadway transfer from Encores! earlier in the year. LOTS of cheers and screaming and laughter from fans excited about this production moving to Broadway. A fair amount of obstruction from heads that is worked around as best as possible—examples of the obstruction can be seen in the screenshots.",
            "format": "MP4",
            "size": "9.03 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-1"
        },
        {
            "id": "e-1134120",
            "tour": "Encores!",
            "date": "May, 2022 (2)",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Heather Headley (Witch), Neil Patrick Harris (Baker), Sara Bareilles (Baker's Wife), Denée Benton (Cinderella), Julia Lester (Little Red Riding Hood), Cole Thompson (Jack), Gavin Creel (Wolf/Cinderella's Prince), Jordan Donica (Rapunzel's Prince), David Patrick Kelly (Narrator/Mysterious Man), Ann Harada (Jack's Mother), Lauren Mitchell (Cinderella's Stepmother), Brooke Ishibashi (Florinda), Ta'Nika Gibson (Lucinda), Albert Guerzon (Cinderella's Father), David Turner (Steward), Shereen Pimentel (Rapunzel), Annie Golden (Granny/Cinderella's Mother/Giant's Voice), Kennedy Kanagawa (Milky White)",
            "notes": "",
            "format": "MP4",
            "size": "7.63 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        },
        {
            "id": "e-1146093",
            "tour": "Second US National Tour",
            "date": "2023-07-30",
            "time": "E",
            "master": "Sbeve/QuoxWoodTrees",
            "cast": "Montego Glover (Witch), Sebastian Arcelus (Baker), Stephanie J. Block (Baker's Wife), Krysta Rodriguez (Cinderella), Katy Geraghty (Little Red Riding Hood), Cole Thompson (Jack), Gavin Creel (Wolf/Cinderella's Prince), Jason Forbach (Rapunzel's Prince), David Patrick Kelly (Narrator/Mysterious Man), Aymee Garcia (Jack's Mother), Nancy Opel (Cinderella's Stepmother), Erica Durham (Florinda), Ta'Nika Gibson (Lucinda), Josh Breckenridge (Cinderella's Father), Jim Stanek (Steward), Alysia Velez (Rapunzel), Felicia Curry (Granny/Cinderella's Mother/Giant's Voice), Kennedy Kanagawa (Milky White)",
            "notes": "Decent quality video of the closing performance of ITW Broadway/Tour. Complete video with minimal dropouts, frequent shakiness from readjusting. Minimal obstructions that I work over well. A must-watch for fans of the production/show! Incredibly emotional performance from SJB and the cast - they went all out for their final show. Included is full audio from this performance and a quality-enhanced edited version by @bsangeloni!<br><br>MY NOTES: Also includes audio (M4A x2)",
            "format": "MP4",
            "size": "9.42 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-2"
        },
        {
            "id": "e-1147909",
            "tour": "Second Broadway Revival",
            "date": "2023-01",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Joaquina Kalukango (Witch), Sebastian Arcelus (Baker), Stephanie J. Block (Baker's Wife), Diane Phelan (Cinderella), Katy Geraghty (Little Red Riding Hood), Cole Thompson (Jack), Gavin Creel (Wolf/Cinderella's Prince), Joshua Henry (Rapunzel's Prince), David Patrick Kelly (Narrator/Mysterious Man), Ann Harada (Jack's Mother), Nancy Opel (Cinderella's Stepmother), Brooke Ishibashi (Florinda), Ta'Nika Gibson (Lucinda), Albert Guerzon (Cinderella's Father), Jim Stanek (Steward), Alysia Velez (Rapunzel), Annie Golden (Granny/Cinderella's Mother/Giant's Voice), Kennedy Kanagawa (Milky White)",
            "notes": "Closing",
            "format": "MP4",
            "size": "7.31 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-2"
        },
        {
            "id": "e-1136630",
            "tour": "Second Broadway Revival",
            "date": "2022-12-21",
            "time": "M",
            "master": "bikinibottomday",
            "cast": "Joaquina Kalukango (Witch), Brian d'Arcy James (Baker), Stephanie J. Block (Baker's Wife), Denée Benton (Cinderella), Delphi Borich (u/s Little Red Riding Hood), Cole Thompson (Jack), Gavin Creel (Wolf/Cinderella's Prince), Joshua Henry (Rapunzel's Prince), David Patrick Kelly (Narrator/Mysterious Man), Ann Harada (Jack's Mother), Nancy Opel (Cinderella's Stepmother), Brooke Ishibashi (Florinda), Ta'Nika Gibson (Lucinda), Albert Guerzon (Cinderella's Father), Jim Stanek (Steward), Alysia Velez (Rapunzel), Annie Golden (Granny/Cinderella's Mother/Giant's Voice), Kennedy Kanagawa (Milky White)",
            "notes": "Great 4K capture of Joaquina as the Witch! There is minor head obstruction, particularly on the left side which blocks a little action, but is almost entirely worked around. Some moments of wandering and unfocusing. Includes curtain call, audio fed from external source.",
            "format": "MP4",
            "size": "11.42 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-1"
        },
        {
            "id": "e-18736",
            "tour": "Broadway",
            "date": "1989-05",
            "time": "Unknown",
            "master": "Proshot",
            "cast": "Bernadette Peters (Witch), Chip Zien (Baker), Joanna Gleason (Baker's Wife), Kim Crosby (Cinderella), Danielle Ferland (Little Red Riding Hood), Ben Wright (Jack), Robert Westenberg (Wolf/Cinderella's Prince), Chuck Wagner (Rapunzel's Prince), Tom Aldredge (Narrator/Mysterious Man), Barbara Bryne (Jack's Mother), Joy Franz (Cinderella's Stepmother), Kay McClelland (Florinda), Lauren Mitchell (Lucinda), Edmund Lyndeck (Cinderella's Father), Philip Hoffman (Steward), Pamela Winslow (Rapunzel), Maureen Davis (Sleeping Beauty), Cindy Robinson (Snow White), Merle Louise (Granny/Cinderella's Mother/Giant's Voice)",
            "notes": "Proshot. Aired on March 15, 1991, but in reality it was filmed between May 23 – 25, 1989. Filmed as a part of the Season 10 premiere episode of PBSs American Playhouse. Almost the entire original Broadway cast (the only exception being Snow White, who was pregnant) returned to film it.<br><br>MY NOTES: looking for replacement",
            "format": "MPG",
            "size": "2.76 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-0"
        }
    ],
    "Jekyll and Hyde (Wildhorn)": [
        {
            "id": "e-14241",
            "tour": "Third US National Tour / Pre-Broadway",
            "date": "2013-03-19",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Constantine Maroulis (Dr. Henry Jekyll/Edward Hyde), Deborah Cox (Lucy Harris), Teal Wicks (Emma Carew/Lisa Carew), Laird Mackintosh (Gabriel John Utterson), Jason Wooten (Simon Stride), Blair Ross (Lady Beaconsfield), Brian Gallagher (Lord Savage), David Benoit (Bishop of Basingstoke)",
            "notes": "Filmed Pre-Broadway. Beautiful HD capture of the final tour stop before heading to Broadway, with no obstructions. A reimagined revival of the classic Wildhorn musical. Clear picture and good sound; nice video. 2 DVDs. A",
            "format": "VOB (with smalls)",
            "size": "4.3 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-1"
        }
    ],
    "Jersey Boys": [
        {
            "id": "e-27022",
            "tour": "Broadway",
            "date": "2005-11-19",
            "time": "E",
            "master": "Unknown",
            "cast": "John Lloyd Young (Frankie Valli), Christian Hoff (Tommy Devito), J. Robert Spencer (Nick Massi), Daniel Reichard (Bob Gaudio)",
            "notes": "Very nicely filmed, although occasional heads at bottom of screen during wide shots. Includes scanned Playbill information, and from NY1: a pre-Broadway piece, an opening night party story, a review, and an interview with John Lloyd Young.",
            "format": "VOB (with smalls)",
            "size": "3.72 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-1"
        }
    ],
    "& Juliet": [
        {
            "id": "e-23272",
            "tour": "West End",
            "date": "2019-11",
            "time": "Unknown",
            "master": "hitmewithyourbethshot",
            "cast": "Miriam-Teak Lee (Juliet), Cassidy Janson (Anne Hathaway), Oliver Tompsett (William Shakespeare), Jordan Luke Gage (Romeo), Tim Mahendran (Francois), Arun Blair-Mangat (May), Melanie La Barrie (Nurse \"Angelique\"), David Bedella (Lance), Jocasta Almgill (Lady Capulet/Nell), Ivan de Freitas (Lord Capulet/Sly), Kirstie Skivington (Benvolio/Eleanor), Antoine Murray-Straughan (Augustine), Nathan Lorainey-Dineen (Gregory), Sophie Usher (s/w Gwynne), Alex Tranter (Henry), Rhian Duncan (Imogen), Kieran Lai (Kempe), Danielle Fiamanya (Lucy), Dillon Scott-Lewis (Richard), Kerri Norville (Susanna)",
            "notes": "",
            "format": "MP4",
            "size": "6.76 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-0"
        }
    ],
    "The King and I": [
        {
            "id": "e-6343",
            "tour": "Fourth Broadway Revival",
            "date": "2015-03-28",
            "time": "M",
            "master": "NYCG8R",
            "cast": "Kelli O'Hara (Anna Leonowens), Ken Watanabe (King of Siam), Jake Lucas (Louis Leonowens), Ruthie Ann Miles (Lady Thiang), Ashley Park (Tuptim), Conrad Ricamora (Lun Tha), Jon Viktor Corpuz (Prince Chualongkorn), Edward Baker-Duly (Sir Edward Ramsey), Murphy Guyer (Captain Orton), Paul Nakauchi (Kralahome)",
            "notes": "Excellent HD video filmed from center mezzanine with very clear picture, very nice close-ups and good clear sound.",
            "format": "MP4",
            "size": "7.73 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-2"
        }
    ],
    "Legally Blonde": [
        {
            "id": "e-5584",
            "tour": "First US National Tour",
            "date": "2009-06-07",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Lauren Zakrin (u/s Elle Woods), D.B. Bonds (Emmett Forrest), Nick Dalton (u/s Warner Huntington III), Natalie Joy Johnson (Paulette), Megan Lewis (Vivienne Kensington), Coleen Sexton (Brooke Wyndham/Shandi), Ken Land (Professor Callahan), Rhiannon Hansen (Margot), Cortney Wolfson (Serena), Crystal Joy (Pilar), Ven Daniel (Kyle/Dewey/Grandmaster Chad), Gretchen Burghart (Enid/Veronica), Alex Ellis (Kate/Chutney)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "4.4 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-1"
        },
        {
            "id": "e-5583",
            "tour": "Broadway",
            "date": "2007-09-16",
            "time": "E",
            "master": "Unknown",
            "cast": "Becky Gulsvig (u/s Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Annaleigh Ashford (Margot), Tracy Jai Edwards (Serena), Asmeret Ghebremichael (Pilar), Andy Karl (Kyle/Dewey/Grandmaster Chad), Natalie Joy Johnson (Enid/Veronica), Kate Wetherhead (Kate/Chutney)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "7.82 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-0"
        },
        {
            "id": "e-5582",
            "tour": "Broadway",
            "date": "2007-09-05",
            "time": "E",
            "master": "Unknown",
            "cast": "Laura Bell Bundy (Elle Woods), Noah Weisberg (u/s Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Kevin Pariseau (u/s Professor Callahan), Annaleigh Ashford (Margot), Tracy Jai Edwards (Serena), Asmeret Ghebremichael (Pilar), Andy Karl (Kyle/Dewey/Grandmaster Chad), Natalie Joy Johnson (Enid/Veronica), Kate Wetherhead (Kate/Chutney), Jason Gillman (u/s Dad), Lindsay Nicole Chambers (s/w Winthrop), Gaelen Gilliland (Mom/Courtney/Whitney), Rusty Mowery (s/w Aaron), Becky Gulsvig (Leilani)",
            "notes": "Starts at Elles entrance during Omigod You Guys.",
            "format": "VOB (with smalls)",
            "size": "4.41 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-1"
        },
        {
            "id": "e-5826",
            "tour": "West End",
            "date": "2010-04-29",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Sheridan Smith (Elle Woods), Alex Gaumond (Emmett Forrest), Sean Mulligan (u/s Warner Huntington III), Jill Halfpenny (Paulette), Caroline Keiff (Vivienne Kensington), Aoife Mulholland (Brooke Wyndham/Shandi), Peter Davison (Professor Callahan), Amy Lennox (Margot), Lucy Miller (u/s Serena), Ibinabo Jack (Pilar), Chris Ellis-Stanton (Kyle/Dewey/Grandmaster Chad), Suzie McAdam (Enid/Veronica)",
            "notes": "Great capture of the London cast. Sheridan is a great Elle and has a wonderful voice. This also includes the new version of Ireland that was rewritten for the London Cast.",
            "format": "VOB (with smalls)",
            "size": "4.4 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-0"
        },
        {
            "id": "e-6279",
            "tour": "Broadway",
            "date": "2007-09-09",
            "time": "E",
            "master": "Unknown",
            "cast": "Laura Bell Bundy (Elle Woods), Noah Weisberg (u/s Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Annaleigh Ashford (Margot), Tracy Jai Edwards (Serena), Asmeret Ghebremichael (Pilar), Andy Karl (Kyle/Dewey/Grandmaster Chad), Natalie Joy Johnson (Enid/Veronica), Kate Wetherhead (Kate/Chutney)",
            "notes": "<br><br>MY NOTES: I have the original VOBs as well as a merged MKV file. Both are the full video",
            "format": "VOB (with smalls) + MKV",
            "size": "7.79 GB + 7.66 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-3"
        },
        {
            "id": "e-6303",
            "tour": "Broadway",
            "date": "2007-07-01",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Laura Bell Bundy (Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Annaleigh Ashford (Margot), Leslie Rodriguez Kritzer (Serena), DeQuina Moore (Pilar), Andy Karl (Kyle/Dewey/Grandmaster Chad), Natalie Joy Johnson (Enid/Veronica), Kate Wetherhead (Kate/Chutney), Noah Weisberg (Aaron), Tracy Jai Edwards (s/w Cece/s/w D.A. Joyce Riley)",
            "notes": "DeQuina Moore's last performance<br><br>MY NOTES: Missing VIDEO_TS.VOB",
            "format": "VOB (incomplete smalls)",
            "size": "4.4 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-0"
        },
        {
            "id": "e-6685",
            "tour": "Pre-Broadway / San Francisco",
            "date": "2007-02-24",
            "time": "E",
            "master": "Unknown",
            "cast": "Laura Bell Bundy (Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Annaleigh Ashford (Margot), Leslie Rodriguez Kritzer (Serena), DeQuina Moore (Pilar), Andy Karl (Kyle/Dewey/Grandmaster Chad), Natalie Joy Johnson (Enid/Veronica), Kate Wetherhead (Kate/Chutney), Kevin Pariseau (Dad/Winthrop/Reporter), Gaelen Gilliland (Mom/Courtney/Whitney), Noah Weisberg (Aaron), Manuel Herrera (Padamadan/Nikos), Amber Efé (Judge/Store Manager), Beth Curry (Gabby/Stenographer), Matthew Risch (Carlos/Lowell), Becky Gulsvig (Leilani), April Berry (Kristine), Michelle Kittrell (Cece/D.A. Joyce Riley), Jason Gillman (Pforzheimer)",
            "notes": "Laura Bell Bundy's shoe falls off during So Much Better. She takes the other shoe off and finishes the song barefoot.",
            "format": "VOB (with smalls)",
            "size": "4.42 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-08-3"
        },
        {
            "id": "e-7565",
            "tour": "Broadway",
            "date": "2008-07-20",
            "time": "E",
            "master": "Unknown",
            "cast": "Laura Bell Bundy (Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nicolette Hart (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Kate Rockwell (Margot), Tracy Jai Edwards (Serena), Asmeret Ghebremichael (Pilar), Andy Karl (Kyle/Dewey/Grandmaster Chad), Natalie Joy Johnson (Enid/Veronica), Autumn Hurlbert (Leilani)",
            "notes": "Laura Bell Bundy, Andy Karl, and Natalie Joy Johnson's last performance on Broadway. Highlights include Omigod You Guys, So Much Better, Bend and Snap, Legally Blonde Remix, Find My Way and three different videos of the bows. Camera wanders a lot and the video is very blurry.",
            "format": "MP4 x10",
            "size": "98 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2024-10-0"
        },
        {
            "id": "e-7566",
            "tour": "Broadway",
            "date": "2008-10-19",
            "time": "E",
            "master": "Unknown",
            "cast": "Bailey Hanks (Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nicolette Hart (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Kate Rockwell (Margot), Tracy Jai Edwards (Serena), Asmeret Ghebremichael (Pilar), Bryan West (Kyle/Dewey/Grandmaster Chad), Lucia Spina (Enid/Veronica), Stephanie Fittro (Kate/Chutney), Kevin Pariseau (Dad/Winthrop), Cara Massey (Mom/Whitney), Barry Anderson (Aaron), Manuel Herrera (Padamadan/Nikos), Amber Efé (Judge), Beth Curry (Gabby/Stenographer), Kyle Brown (Carlos), Autumn Hurlbert (Leilani), April Berry (Kristine)",
            "notes": "Closing night on Broadway. Highlights include: What You Want, Whipped Into Shape, Take It Like A Man, Legally Blonde Remix (only 45 seconds), Find My Way/Finale (only the Finale part) and Curtain Call (multicam consisting of two videos edited together).",
            "format": "MP4 x6 + MOV (curtain call)",
            "size": "217.7 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2024-12-1"
        },
        {
            "id": "e-8198",
            "tour": "Broadway",
            "date": "2007-09-02",
            "time": "E",
            "master": "Unknown",
            "cast": "Laura Bell Bundy (Elle Woods), Andy Karl (u/s Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Annaleigh Ashford (Margot), Tracy Jai Edwards (Serena), Asmeret Ghebremichael (Pilar), Matthew Risch (u/s Kyle/u/s Dewey), Rod Harrelson (s/w Grandmaster Chad), Natalie Joy Johnson (Enid/Veronica), Kate Wetherhead (Kate/Chutney)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "4.46 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-08-3"
        },
        {
            "id": "e-8199",
            "tour": "North Shore Music Theatre",
            "date": "2011-11",
            "time": "Unknown",
            "master": "Proshot",
            "cast": "Kelly Felthous (Elle Woods), Barrett Hall (Emmett Forrest), Will Ray (Warner Huntington III), Gaelen Gilliland (Paulette), Kate Loprest (Vivienne Kensington), Taryn Darr (Brooke Wyndham/Shandi), Paul Jackel (Professor Callahan), Sara Andreas (Margot), Tiffany Engen (Serena), Allysa Shorte (Pilar), Trish LaRose (Enid/Veronica), Kevin Pariseau (Dad/Winthrop)",
            "notes": "Performed in the round, one camera on a tripod and sound patched in from the soundboard.",
            "format": "VOB (no smalls)",
            "size": "3.86 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-0"
        },
        {
            "id": "e-2546",
            "tour": "West End",
            "date": "2010-11-23",
            "time": "E",
            "master": "Unknown",
            "cast": "Sheridan Smith (Elle Woods), Alex Gaumond (Emmett Forrest), Simon Thomas (Warner Huntington III), Denise Van Outen (Paulette), Suzie McAdam (u/s Vivienne Kensington), Aoife Mulholland (Brooke Wyndham/Shandi), Peter Davison (Professor Callahan), Carley Stenson (Margot), Susan McFadden (Serena), Ibinabo Jack (Pilar)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "4.64 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-0"
        },
        {
            "id": "e-30977",
            "tour": "Broadway",
            "date": "2007-05-20",
            "time": "E",
            "master": "Unknown",
            "cast": "Laura Bell Bundy (Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Annaleigh Ashford (Margot), Leslie Rodriguez Kritzer (Serena), DeQuina Moore (Pilar), Natalie Joy Johnson (Enid/Veronica)",
            "notes": "Another great capture of the show. Has great sound and an over all nice sharp capture of the original cast.",
            "format": "VOB (with smalls)",
            "size": "3.24 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-1"
        },
        {
            "id": "e-1119793",
            "tour": "Second US National Tour",
            "date": "2010-10-09",
            "time": "E",
            "master": "Unknown",
            "cast": "Nikki Bohne (Elle Woods), Nic Rouleau (Emmett Forrest), Matthew Ragas (Warner Huntington III), Jillian Wallach (Paulette), Hannah Cruz (Vivienne Kensington), Shannon Mullen (Brooke Wyndham/Shandi), Kahlil Joseph (Professor Callahan), Maggie Taylor (Margot), Nadia Vynnytsky (Serena), Brit West (Pilar), Michael Milton (Kyle/Dewey/Grandmaster Chad), Sarah Beth Pfeifer (Enid/Veronica), Nicole Brancucci (Kate/Chutney)",
            "notes": "Highlights: Legally Blonde, Legally Blonde Remix, So Much Better, There! Right There!",
            "format": "MKV x4",
            "size": "101 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-01-3"
        },
        {
            "id": "e-1118590",
            "tour": "Broadway",
            "date": "2008-04-04",
            "time": "E",
            "master": "Kaitlyn Rosen",
            "cast": "Laura Bell Bundy (Elle Woods), Christian Borle (Emmett Forrest), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Haven Burton (Margot), Gaelen Gilliland (Mom/Courtney/Whitney), Amber Efé (Judge)",
            "notes": "Originally posted to YouTube by the master and ripped in maximum quality. Highlights run 12:58 in length and include Positive, Chip on My Shoulder (the final 40 seconds), So Much Better, and Legally Blonde Remix. The cast was guessed upon watching as there was no cast listed provided on the original video. This means that not every single performer is listed, only those visible onstage.",
            "format": "MP4 x4",
            "size": "32.6 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2024-12-1"
        },
        {
            "id": "e-1119792",
            "tour": "Second US National Tour",
            "date": "2011-03-31",
            "time": "E",
            "master": "Unknown",
            "cast": "Nikki Bohne (Elle Woods), Nic Rouleau (Emmett Forrest), Matthew Ragas (Warner Huntington III), Jillian Wallach (Paulette), Hannah Cruz (Vivienne Kensington), Shannon Mullen (Brooke Wyndham/Shandi), Kahlil Joseph (Professor Callahan), Maggie Taylor (Margot), Nadia Vynnytsky (Serena), Brit West (Pilar), Michael Milton (Kyle/Dewey/Grandmaster Chad), Sarah Beth Pfeifer (Enid/Veronica), Nicole Brancucci (Kate/Chutney)",
            "notes": "Highlights:\nSo Much Better\nPositive\nFinale/Bows",
            "format": "MKV x3",
            "size": "50.8 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-01-3"
        },
        {
            "id": "e-1119789",
            "tour": "Broadway",
            "date": "2008-08-02",
            "time": "E",
            "master": "Unknown",
            "cast": "Bailey Hanks (Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette)",
            "notes": "So Much Better and Ireland",
            "format": "MKV x2",
            "size": "15.6 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-01-3"
        },
        {
            "id": "e-1119748",
            "tour": "West End",
            "date": "2010-01-08",
            "time": "E",
            "master": "Unknown",
            "cast": "Sheridan Smith (Elle Woods), Jill Halfpenny (Paulette), Caroline Keiff (Vivienne Kensington), Aoife Mulholland (Brooke Wyndham/Shandi), Amy Lennox (Margot), Susan McFadden (Serena), Ibinabo Jack (Pilar), Suzie McAdam (Enid/Veronica), Nadine Higgin (Judge)",
            "notes": "Highlights include Bend and Snap, Legally Blonde Remix, and Find My Way.",
            "format": "MKV x3",
            "size": "52.1 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-01-3"
        },
        {
            "id": "e-1119277",
            "tour": "Broadway",
            "date": "2008-10-08",
            "time": "E",
            "master": "Unknown",
            "cast": "Bailey Hanks (Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette)",
            "notes": "Highlights include Chip on My Shoulder and So Much Better.",
            "format": "MP4 x2",
            "size": "94.8 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-01-3"
        },
        {
            "id": "e-1120533",
            "tour": "Australia",
            "date": "2014",
            "time": "Unknown",
            "master": "Press Reel",
            "cast": "Lucy Durack (Elle Woods), David Harris (Emmett Forrest), Rob Mills (Warner Huntington III), Ali Calder (Vivienne Kensington), Erika Heynatz (Brooke Wyndham/Shandi), Cameron Daddo (Professor Callahan), Renee Burleigh (Margot), Ashlea Pike (Serena), Chloé Zuel (Pilar)",
            "notes": "Press Reels including Serious, Chip On My Shoulder, Whipped Into Shape and two clips of Legally Blonde Remix; plus a file with a clip of So Much Better and the previously mentioned songs. Also includes an interview with the cast. Filmed sometime in March-May 2014.",
            "format": "MKV x7",
            "size": "276.8 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-03-3"
        },
        {
            "id": "e-1122849",
            "tour": "Seoul",
            "date": "2010-01-23",
            "time": "Unknown",
            "master": "snsdchingoo",
            "cast": "Jessica Jung (Elle Woods), Kim Dong-Wook (Emmett Forrest), 고영빈 Go Young-Bin (Warner Huntington III)",
            "notes": "Approximately 21 minutes of highlights: the Harvard Variations scene (specifically Elles part of the scene), the scene before Chip On Your Shoulder with the bunny suit, the scene before Bend and Snap, and Take It Like A Man.\nRipped from YouTube, cast is purely guesswork minus Jessica. The Chip On Your Shoulder video has an interruption in the middle.",
            "format": "MP4 x4",
            "size": "52.7 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-01-3"
        },
        {
            "id": "e-1003768",
            "tour": "54 Below",
            "date": "2019-03-03",
            "time": "E",
            "master": "Proshot",
            "cast": "Carrie St. Louis (Elle Woods), Dan DeLuca (Emmett Forrest), Bobby Conte Thornton (Warner Huntington III), Haven Burton (Paulette), Raven Thomas (Vivienne Kensington), Tracy Jai Edwards (Brooke Wyndham/Shandi), Edward Watts (Professor Callahan), DeLaney Westfall (Margot), Amber Ardolino (Serena), Shea Renne (Pilar), Darius Wright (Kyle/Dewey/Grandmaster Chad), Gwynne Wood (Enid/Veronica), Jonathan Young (Ensemble), Sonya Venugopal (Ensemble), Lauren Urso (Ensemble), Esteban Suero (Ensemble), Salome Smith (Ensemble), Jessica Kundla (Ensemble)",
            "notes": "",
            "format": "MP4",
            "size": "1.75 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-3"
        },
        {
            "id": "e-1111835",
            "tour": "The Netherlands",
            "date": "2011-03",
            "time": "Unknown",
            "master": "Unknown",
            "cast": "Kim-Lian van der Meij (Elle Woods), Madelon van der Poel (alt Elle Woods/Margot), Joey Schalker (Emmett Forrest), Roy van Iersel (Warner Huntington III), Laura Vlasblom (Paulette), Barbara Hol (Vivienne Kensington), Cindy Bell (Brooke Wyndham/Shandi), Raymond Kurvers (Professor Callahan), Nicky van der Kuyp (Serena), Dapheny Oosterwolde (Pilar), Richard Rodermond (Kyle/Dewey/Grandmaster Chad), Pearl Jozefzoon (Judge/Store Manager), Jurriaan Bles (Nikos), Urivin Monte (Carlos)",
            "notes": "Highlights running for a little over and hour. Filmed from different angles, including some professionally shot clips, with great sound on most of the songs, though some are a bit quiet. Highlights include Omigod You Guys, Serious, What You Want, The Harvard Various, Blood in the Water, Positive, Ireland (Madelon as Elle), So Much Better, So Much Better (Madelon as Elle), Whipped Into Shape, Take It Like a Man, Bend and Snap, Gay or European, Legally Blonde, Legally Blonde (Madelon as Elle), Legally Blonde Remix & Find My Way, Find My Way (Madelon as Elle), as well as an opening night curtain call from October 10th, 2010. Edited and remastered by Theandcraft.",
            "format": "MP4 x19",
            "size": "4.17 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-04-2"
        },
        {
            "id": "e-1004186",
            "tour": "First US National Tour",
            "date": "2009-09-18",
            "time": "E",
            "master": "SJ Bernly",
            "cast": "Becky Gulsvig (Elle Woods), D.B. Bonds (Emmett Forrest), Jeff McLean (Warner Huntington III), Natalie Joy Johnson (Paulette), Megan Lewis (Vivienne Kensington), Coleen Sexton (Brooke Wyndham/Shandi), Ken Land (Professor Callahan), Rhiannon Hansen (Margot), Cortney Wolfson (Serena), Crystal Joy (Pilar), Ven Daniel (Kyle/Dewey/Grandmaster Chad), Lucia Spina (Enid/Veronica), JB Wing (Mom/Courtney/Whitney), Constantine Rousouli (Padamadan/Nikos), CJay Hardy Philip (Judge/Store Manager), Lauren Zakrin (Stenographer/Leilani), Rusty Mowery (Pforzheimer)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "5.75 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        },
        {
            "id": "e-1004176",
            "tour": "First US National Tour",
            "date": "2008-12-06",
            "time": "E",
            "master": "Unknown",
            "cast": "Becky Gulsvig (Elle Woods), D.B. Bonds (Emmett Forrest), Jeff McLean (Warner Huntington III), Natalie Joy Johnson (Paulette), Megan Lewis (Vivienne Kensington), Coleen Sexton (Brooke Wyndham/Shandi), Ken Land (Professor Callahan), Cortney Wolfson (Serena), Crystal Joy (Pilar), Ven Daniel (Kyle/Dewey/Grandmaster Chad), Gretchen Burghart (Enid/Veronica)",
            "notes": "RARE! Highlights running an hour and 20 minutes, includes Positive, Serious (reprise), Chip On My Shoulder, So Much Better, Whipped Into Shape, Bend And Snap.",
            "format": "VOB (with smalls)",
            "size": "1.86 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-03-3"
        },
        {
            "id": "e-1004175",
            "tour": "First US National Tour",
            "date": "2008-11-11",
            "time": "E",
            "master": "Unknown",
            "cast": "Becky Gulsvig (Elle Woods), D.B. Bonds (Emmett Forrest), Jeff McLean (Warner Huntington III), Natalie Joy Johnson (Paulette), Megan Lewis (Vivienne Kensington), Coleen Sexton (Brooke Wyndham/Shandi), Ken Land (Professor Callahan), Rhiannon Hansen (Margot), Cortney Wolfson (Serena), Crystal Joy (Pilar), Ven Daniel (Kyle/Dewey/Grandmaster Chad), Gretchen Burghart (Enid/Veronica), Alex Ellis (Kate/Chutney), Adam Zelasko (Padamadan/Nikos), Stacey Sargeant (Judge), Josh Walden (Carlos)",
            "notes": "RARE! Highlights running an hour and 10 minutes long. Includes all performances from the first act and Bend and Snap, There! Right There!, part of Legally Blonde and audio of Find My Way from the second. Really, really shaky.<br><br>MY NOTES: Missing VIDEO_TS.VOB",
            "format": "VOB (incomplete smalls)",
            "size": "1.94 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-03-3"
        },
        {
            "id": "e-2010905",
            "tour": "Music Theater Works",
            "date": "2024-12",
            "time": "M",
            "master": "soysaucepierre",
            "cast": "Kayla Shipman (Elle Woods), David Moreland (Emmett Forrest), Daniel Rausch (Warner Huntington III), Khaki Pixley (Paulette), Crystal Claros (Vivienne Kensington), Amanda Handegan (Brooke Wyndham), Korey White (Professor Callahan), Sabrina Bowen (Margot), Morgan Schoenecker (Serena), Selena Robinson (Pilar), Isaiah Engram (Kyle), Michael Davis Arnold (Dewey/Grandmaster Chad), Ava Stovall (Enid), Lanja Andriamihaja (Kate), Lili Galluzzo (Chutney), Will Leonard (Dad), Riley Dominiak (Mom), Connor Ripperger (Aaron), Alex Villaseñor (Nikos), Victor López (Carlos), Ibrahim Khan (Ensemble), Kiana Beverly (Ensemble), Eric Amundson (Ensemble), Matthew Millin (Ensemble), Madison Jaffe-Richter (Ensemble), Claire Campbell (Ensemble)",
            "notes": "NFT Date: 2025-09-23<br><br>Excellent capture of this fantastic regional production on their closing performance! First 3 minutes of Act 1 is audio only (it is mostly the Overature though) - first 30ish seconds of Act 2 as well. Start of Act 1 is a bit rough with 1 or 2 very short blackouts but I get locked in after Serious. My sleeve occasionally comes into the shot. Nice mix of wides and mediums, with some closeups. Moments of readjustment throughout. Audio fed from external source. <br>TLDR: i love little miss woods comma elle. A",
            "format": "MP4",
            "size": "10.12 GB",
            "nft": "Yes",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-2"
        },
        {
            "id": "e-2005241",
            "tour": "Brazil",
            "date": "2024-10",
            "time": "M",
            "master": "Unknown",
            "cast": "Myra Ruiz (Elle Woods), Hipólyto (Emmett Forrest), Renan Rosiq (Warner Huntington III), Leilah Moreno  (Paulette), Gigi Debei (Vivienne Kensington), Amanda Döring (Brooke Wyndham), Danilo Moura (Professor Callahan), Esther Arieiv (Margot), Vivian Bugno (Serena), Gabriela Gatti (Pilar), Vitor Loschiavo (Kyle), Mariana Ramires (Enid), Bia Vasconcellos (Chutney), Fábio Galvão (Nikos), Ricke Hadashi (Carlos)",
            "notes": "Act 1 is filmed from a different angle than Act 2. The quality is good overall. The cast delivered an outstanding performance. In some parts, the stage isn't fully visible. Does not include bows.",
            "format": "MP4 x2",
            "size": "3.49 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "limited",
            "amount": "full",
            "collected": "2025-05-2"
        },
        {
            "id": "e-2005308",
            "tour": "Brazil",
            "date": "2024-10-06",
            "time": "E",
            "master": "Unknown",
            "cast": "Myra Ruiz (Elle Woods), Hipólyto (Emmett Forrest), Renan Rosiq (Warner Huntington III), Leilah Moreno  (Paulette), Gigi Debei (Vivienne Kensington), Amanda Döring (Brooke Wyndham), Rafael Pucca (Professor Callahan), Esther Arieiv (Margot), Vivian Bugno (Serena), Gabriela Gatti (Pilar), Vitor Loschiavo (Kyle), Mariana Ramires (Enid), Bia Vasconcellos (Chutney), Fábio Galvão (Nikos), Ricke Hadashi (Carlos)",
            "notes": "The video has good quality overall. After 'Serious', the camera angle changes. The audience was lively, with plenty of laughter and cheering throughout. The cast delivered strong performances. Many references to 'Wicked'.",
            "format": "MP4 x2",
            "size": "3.49 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "limited",
            "amount": "full",
            "collected": "2025-03-0"
        },
        {
            "id": "e-18006",
            "tour": "First US National Tour",
            "date": "2009-02-22",
            "time": "E",
            "master": "Unknown",
            "cast": "Laura Bell Bundy (t/r Elle Woods), D.B. Bonds (Emmett Forrest), Jeff McLean (Warner Huntington III), Natalie Joy Johnson (Paulette), Megan Lewis (Vivienne Kensington), Coleen Sexton (Brooke Wyndham/Shandi), Ken Land (Professor Callahan), Kate Rockwell (t/r Margot), Cortney Wolfson (Serena), Crystal Joy (Pilar), Ven Daniel (Kyle/Dewey/Grandmaster Chad), Gretchen Burghart (Enid/Veronica)",
            "notes": "Limited highlights, includes from Legally Blonde to the end of the show (around 23 minutes in total).",
            "format": "MKV + VOB (with smalls)",
            "size": "972.3 MB + 1.01 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2024-09-2"
        },
        {
            "id": "e-18004",
            "tour": "Broadway",
            "date": "2008-03-16",
            "time": "E",
            "master": "juniper47",
            "cast": "Laura Bell Bundy (Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Gaelen Gilliland (u/s Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Haven Burton (Margot), Tracy Jai Edwards (Serena), Asmeret Ghebremichael (Pilar), Andy Karl (Kyle/Dewey/Grandmaster Chad), Natalie Joy Johnson (Enid/Veronica), Stephanie Fittro (Kate/Chutney), Tiffany Engen (s/w Mom/s/w Whitney), Rusty Mowery (s/w Padamadan), Lindsay Nicole Chambers (s/w Judge), Nick Kenkel (u/s Nikos)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "4.64 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-0"
        },
        {
            "id": "e-17988",
            "tour": "Broadway",
            "date": "2007-05-19",
            "time": "E",
            "master": "Unknown",
            "cast": "Laura Bell Bundy (Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Leslie Rodriguez Kritzer (e/c Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Annaleigh Ashford (Margot), Tracy Jai Edwards (u/s Serena), DeQuina Moore (Pilar), Andy Karl (Kyle/Dewey/Grandmaster Chad), Natalie Joy Johnson (Enid/Veronica), Kate Wetherhead (Kate/Chutney), Kevin Pariseau (Dad/Winthrop/Reporter), Gaelen Gilliland (Mom/Courtney/Whitney), Noah Weisberg (Aaron), Manuel Herrera (Padamadan/Nikos), Amber Efé (Judge/Store Manager), Beth Curry (Gabby/Stenographer), Matthew Risch (Carlos/Lowell), Becky Gulsvig (Leilani), April Berry (Kristine), Michelle Kittrell (Cece/D.A. Joyce Riley), Jason Gillman (Pforzheimer), Chico the Dog (Bruiser), Chloe the Dog (Rufus), Paul Canaan (Ensemble), Nick Kenkel (Ensemble), Jason Patrick Sands (Ensemble)",
            "notes": "A nice capture of the show. Missing about 3 and a half minutes of the show during Legally Blonde remix and about 8 seconds of skipping at the very end during the graduation. A-\nThe alleged full audio from this performance that circulates (and is listed on Ovrtur) is ripped from this video, and skips in the exact same spots. However, the video doesn't include bows while the audio rip does. No full show audio is known.",
            "format": "VOB (with smalls)",
            "size": "3.22 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-08-3"
        },
        {
            "id": "e-16822",
            "tour": "Vienna",
            "date": "2013-03-22",
            "time": "E",
            "master": "Rumpel",
            "cast": "Barbara Obermeier (Elle Woods), Jörg Neubauer (Emmett Forrest), Hendrik Schall (Warner Huntington III), Ana Milva Gomes (Paulette), Sanne Mieloo (Vivienne Kensington), Linda Geider (Brooke Wyndham/Shandi), Alexander Goebel (Professor Callahan), Anja Haesali (Margot), Birgit Wanka (Serena), Sidonie Smith (Pilar), Dániel Rákász (Kyle/Dewey/Grandmaster Chad)",
            "notes": "Includes lots of pro-shots and press-reel footage.",
            "format": "VOB (with smalls)",
            "size": "4.28 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-0"
        },
        {
            "id": "e-13261",
            "tour": "Pre-Broadway / San Francisco",
            "date": "2007-02-07",
            "time": "E",
            "master": "Unknown",
            "cast": "Laura Bell Bundy (Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Annaleigh Ashford (Margot), Leslie Rodriguez Kritzer (Serena), DeQuina Moore (Pilar), Andy Karl (Kyle/Dewey/Grandmaster Chad), Natalie Joy Johnson (Enid/Veronica), Kate Wetherhead (Kate/Chutney)",
            "notes": "Preview in San Francisco. Start in the middle of Omigod You Guys, a bit shaky.",
            "format": "VOB (with smalls)",
            "size": "6.62 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-08-3"
        },
        {
            "id": "e-10477",
            "tour": "Pre-Broadway / San Francisco",
            "date": "2007-02-13",
            "time": "E",
            "master": "Unknown",
            "cast": "Laura Bell Bundy (Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Annaleigh Ashford (Margot), Leslie Rodriguez Kritzer (Serena), DeQuina Moore (Pilar), Andy Karl (Kyle/Dewey/Grandmaster Chad), Natalie Joy Johnson (Enid/Veronica), Kate Wetherhead (Kate/Chutney)",
            "notes": "Some shakes, a lot of spotlight washout, and a few heads, but overall very good. Sound levels have been brought up but theres some camera noise. Has a couple bits which were changed for Broadway.",
            "format": "VOB (with smalls)",
            "size": "3.75 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-08-3"
        },
        {
            "id": "e-1228",
            "tour": "Broadway",
            "date": "2007-09-18",
            "time": "E",
            "master": "Proshot",
            "cast": "Laura Bell Bundy (Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Annaleigh Ashford (Margot), Tracy Jai Edwards (Serena), Asmeret Ghebremichael (Pilar), Andy Karl (Kyle/Dewey/Grandmaster Chad), Natalie Joy Johnson (Enid/Veronica), Kate Wetherhead (Kate/Chutney)",
            "notes": "MTV Proshot, Broadcast October 13th and October 14th 2007. There are two main formats that circulate of this pro-shot: VOBs with smalls and a remastered/upscaled MP4 - check with traders what format they have!",
            "format": "VOB (with smalls)",
            "size": "7.63 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-08-3"
        },
        {
            "id": "e-1146",
            "tour": "Broadway",
            "date": "2008-07-26",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Bailey Hanks (Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Amber Efé (u/s Paulette), Kate Shindle (Vivienne Kensington), Nicolette Hart (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Kate Rockwell (Margot), Tracy Jai Edwards (Serena), Asmeret Ghebremichael (Pilar), Ven Daniel (Kyle/Dewey/Grandmaster Chad), Lucia Spina (Enid/Veronica), Stephanie Fittro (Kate/Chutney), Barry Anderson (Aaron), Manuel Herrera (Padamadan/Nikos), Matthew Risch (Carlos), Autumn Hurlbert (Leilani)",
            "notes": "Featuring the winner of MTV's Search for Elle Woods series, Bailey. She did a wonderful job and very cute in the role. She also did not copy Laura's Elle and made it her own, which was great. Amber as Paulette did a wonderful job in the role and has such a big voice and very pretty. I never get tired of this show as it is so much fun. Beautifully captured with terrific closeups. A",
            "format": "VOB (with smalls)",
            "size": "4.29 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-0"
        },
        {
            "id": "e-1145",
            "tour": "Broadway",
            "date": "2008-05-15",
            "time": "E",
            "master": "juniper47",
            "cast": "Becky Gulsvig (u/s Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Gaelen Gilliland (u/s Paulette), Kate Shindle (Vivienne Kensington), Nicolette Hart (Brooke Wyndham/Shandi), Kevin Pariseau (u/s Professor Callahan), Kate Rockwell (Margot), Tracy Jai Edwards (Serena), Asmeret Ghebremichael (Pilar), Matthew Risch (u/s Kyle/u/s Dewey), Rod Harrelson (s/w Grandmaster Chad/s/w Carlos), Natalie Joy Johnson (Enid/Veronica), Tiffany Engen (u/s Kate/u/s Chutney), Jason Gillman (u/s Dad), Rusty Mowery (s/w Winthrop/s/w Reporter), Dani Spieler (s/w Mom/s/w Courtney/s/w Whitney), Bryce Ryness (Aaron), Manuel Herrera (Padamadan/Nikos), Casey Leigh Thompson (s/w Gabby/s/w Stenographer)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "4.65 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        },
        {
            "id": "e-1142",
            "tour": "Broadway",
            "date": "2007-04-14",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Laura Bell Bundy (Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Annaleigh Ashford (Margot), Leslie Rodriguez Kritzer (Serena), DeQuina Moore (Pilar), Andy Karl (Kyle/Dewey/Grandmaster Chad), Natalie Joy Johnson (Enid/Veronica), Kate Wetherhead (Kate/Chutney)",
            "notes": "Great fun show and nice capture. Laura was wonderful, alongside a fantastic cast. A-",
            "format": "VOB (with smalls)",
            "size": "4.37 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-0"
        },
        {
            "id": "e-1144",
            "tour": "Broadway",
            "date": "2008-03-02",
            "time": "E",
            "master": "broadwayspunk",
            "cast": "Haven Burton (u/s Elle Woods), Christian Borle (Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Becky Gulsvig (u/s Margot), Tracy Jai Edwards (Serena), Asmeret Ghebremichael (Pilar), Andy Karl (Kyle/Dewey/Grandmaster Chad), Natalie Joy Johnson (Enid/Veronica), Stephanie Fittro (Kate/Chutney)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "4.48 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-0"
        },
        {
            "id": "e-1143",
            "tour": "Broadway",
            "date": "2007-10-25",
            "time": "E",
            "master": "Unknown",
            "cast": "Becky Gulsvig (u/s Elle Woods), Andy Karl (u/s Emmett Forrest), Richard H. Blake (Warner Huntington III), Orfeh (Paulette), Kate Shindle (Vivienne Kensington), Nikki Snelson (Brooke Wyndham/Shandi), Michael Rupert (Professor Callahan), Haven Burton (Margot), Tracy Jai Edwards (Serena), Asmeret Ghebremichael (Pilar), Matthew Risch (u/s Kyle/u/s Dewey), Rod Harrelson (s/w Grandmaster Chad/s/w Carlos), Natalie Joy Johnson (Enid/Veronica), Kate Wetherhead (Kate/Chutney)",
            "notes": "Great capture of the two understudies in the role. Shot from the orchestra with amazing shots. Starts in the middle of Omigod You Guys.",
            "format": "VOB (with smalls)",
            "size": "4.41 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-1"
        },
        {
            "id": "e-1126337",
            "tour": "Titusville Playhouse",
            "date": "2022-05",
            "time": "Unknown",
            "master": "House Cam",
            "cast": "Tory Vagasy (Elle Woods), Dave Sierra (Emmett Forrest), Kyle Sullivan (Warner Huntington III), Jordyn Linkous (Paulette), Holly Fuller (Vivienne Kensington), Sarah Ruth Joyner (Brooke Wyndham/Shandi), Christopher deJongh (Professor Callahan), Sarah McKinney (Margot), Jasha Vaugh (Serena), Gabriela Astwood (Pilar), Tyler Talmage (Kyle/Dewey/Grandmaster Chad), Delaney McGough (Enid/Veronica), Erica deJongh (Kate/Chutney), Steven Smith (Dad/Winthrop), Lindsey Strembicki (Mom/Whitney), Josh Solomon (Aaron), Kristian Rodriguez (Padamadan/Nikos), Sofia Gonzales (Judge), Caitlin Van Driessche (Gabby/Stenographer), Pablo Pernia (Carlos), Madison Ripley (Leilani), Grace Boynton (Kristine), Ashley Vogt (Cece)",
            "notes": "SD House-Cam of Titusville Playhouses production of Legally Blonde. Audio levels are a bit low making it hard to hear at times. Some washout is also present",
            "format": "MKV",
            "size": "1.01 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-2"
        },
        {
            "id": "e-1141219",
            "tour": "Fourth US National Tour (Non-Equity)",
            "date": "2023-04-02",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Hannah Bonnett (Elle Woods), Woody White (Emmett Forrest), James Oblak (Warner Huntington III), Ashley Morton (Paulette), Lea Sevola (Vivienne Kensington), Kaelee Albritton (Brooke Wyndham/Mom/Courtney/Whitney), Chris Carsten (Professor Callahan/Dad/Winthrop), Jesse Lynn Harte (Margot), Taylor Lloyd (Serena), Rory Furey King (Pilar), Matthew Dean Hollis (Kyle/Dewey/Grandmaster Chad), Harley Barton (Enid/Veronica), Alexis Loiselle (Kate), Emma Wilcox (Chutney), Jack Gimpel (Aaron), Tyller Kenke (Padamadan/Nikos), Carly Caviglia (Judge/Store Manager), Meg Frost (Stenographer/Leilani), Brandon Moreno (Carlos/Lowell), John Katz (Pforzheimer), Chanel Black (D.A. Joyce Riley)",
            "notes": "Incomplete 4K capture of the tour's second (and final) performance in Detroit. Most of Act One is blacked out/missing (with a few clips included here and there). The last 20 minutes of Act One and all of Act Two are mildly obstructed and includes some blackouts throughout. There is also wandering and unfocusing throughout. More washout than usual. Includes curtain call, audio fed from external source.",
            "format": "MP4",
            "size": "10.1 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "partial",
            "collected": "2025-04-2"
        },
        {
            "id": "e-1125434",
            "tour": "Second US National Tour",
            "date": "2010",
            "time": "Unknown",
            "master": "FoxyYoutubeLynn",
            "cast": "Nikki Bohne (Elle Woods), Nic Rouleau (Emmett Forrest), Matthew Ragas (Warner Huntington III)",
            "notes": "Highlight approx 18 minutes. Full stage filming, with a bit close up,\nHighlight including ~ Positive, Omigod you guys (Elle scene only/missing the Elle entrance scene), chip on my shoulder and Find my way. \nRipped in highest quality from YouTube.\nNot for trade, Gift on request.",
            "format": "MKV x4",
            "size": "94.1 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-03-3"
        },
        {
            "id": "e-1126303",
            "tour": "West End",
            "date": "2010",
            "time": "Unknown",
            "master": "MattieMcG",
            "cast": "Emma Bateman (u/s Elle Woods), Alex Gaumond (Emmett Forrest), Amy Lennox (Margot), Susan McFadden (Serena), Ibinabo Jack (Pilar)",
            "notes": "Highlights lasting approximately 14 minutes including What You Want, So Much Better, Legally Blonde and Find My Way. Filmed blindly and some heads show up. Gifted upon request.",
            "format": "MP4 x4",
            "size": "42.4 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-04-2"
        },
        {
            "id": "e-1125980",
            "tour": "Regent's Park Open Air Theatre",
            "date": "2022-05",
            "time": "Unknown",
            "master": "sandrabanana",
            "cast": "Courtney Bowman (Elle Woods), Michael Ahomka-Lindsay (Emmett Forrest), Alistair Toovey (Warner Huntington III), Nadine Higgin (Paulette), Vanessa Fisher (Vivienne Kensington), Lauren Drew (Brooke Wyndham/Shandi), Eugene McCoy (Professor Callahan), Iz Hesketh (Margot), Hannah Yun Chamberlain (Serena), Grace Mouat (Pilar), Dominic Lamb (Kyle/Dad), Billy Nevers (Dewey/Grandmaster Chad/Store Manager), Alžbeta Matyšáková (Enid), Jasmin Colangelo (Kate/Chutney), Jo Foster (Winthrop/Aaron/Carlos/Rufus), Shakira Simpson (s/w Reporter/s/w Mom/s/w Whitney/s/w Stenographer/s/w Leilani/s/w Pforzheimer), Allie Daniel (Courtney/D.A. Joyce Riley), Lucca Chadwick-Patel (Padamadan/Nikos/Lowell), Gabriela Benedetti (Judge), Liam McEvoy (Bruiser)",
            "notes": "first recording of this show since their official opening/press night so it includes some line changes and all 3 elle wigs. video has 2 very short blackouts at unimportant moments and otherwise is completely unobstructed. its a matinee performance so the colours show up really nicely - Id give it a 9/10 tbh. includes bows.",
            "format": "MP4 x2",
            "size": "7.75 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        },
        {
            "id": "e-1126301",
            "tour": "West End",
            "date": "2010",
            "time": "Unknown",
            "master": "MultiBlonde333",
            "cast": "Nicola Brazil (u/s Elle Woods), Jill Halfpenny (Paulette), Carley Stenson (Margot), Lucy Miller (u/s Serena)",
            "notes": "Highlights running approximately 24 minutes. Includes Positive, So Much Better, Bend and Snap, There! Right There!, and Legally Blonde. Gift upon request.",
            "format": "MP4 x5",
            "size": "78.1 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-04-2"
        },
        {
            "id": "e-1125933",
            "tour": "Regent's Park Open Air Theatre",
            "date": "2022-05",
            "time": "Unknown",
            "master": "Lasagna",
            "cast": "Courtney Bowman (Elle Woods), Michael Ahomka-Lindsay (Emmett Forrest), Alistair Toovey (Warner Huntington III), Nadine Higgin (Paulette), Vanessa Fisher (Vivienne Kensington), Lauren Drew (Brooke Wyndham/Shandi), Eugene McCoy (Professor Callahan), Iz Hesketh (Margot), Hannah Yun Chamberlain (Serena), Grace Mouat (Pilar), Dominic Lamb (Kyle/Dad), Billy Nevers (Dewey/Grandmaster Chad/Store Manager), Alžbeta Matyšáková (Enid), Jasmin Colangelo (Kate/Chutney), Jo Foster (Winthrop/Aaron/Carlos/Rufus), Esme Laudat (Reporter/Mom/Whitney/Stenographer/Leilani/Pforzheimer), Allie Daniel (Courtney/D.A. Joyce Riley), Lucca Chadwick-Patel (Padamadan/Nikos/Lowell), Gabriela Benedetti (Judge), Liam McEvoy (Bruiser)",
            "notes": "Great capture of the first preview of this unique production! Features early wigs and costumes that were eventually changed before opening night. Act 1 is partially obstructed by an annoying head on the left side but they move for Act 2 which is completely unobstructed. The dogs will haunt your dreams.",
            "format": "MP4",
            "size": "9.67 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-0"
        },
        {
            "id": "e-1138210",
            "tour": "Fourth US National Tour (Non-Equity)",
            "date": "2023-01",
            "time": "Unknown",
            "master": "mynewfavoriteday",
            "cast": "Hannah Bonnett (Elle Woods), Aathaven Tharmarajah (Emmett Forrest), James Oblak (Warner Huntington III), Ashley Morton (Paulette), Lea Sevola (Vivienne Kensington), Kaelee Albritton (Brooke Wyndham/Mom/Courtney/Whitney), Chris Carsten (Professor Callahan/Dad/Winthrop), Jesse Lynn Harte (Margot), Taylor Lloyd (Serena), Rory Furey King (Pilar), Matthew Dean Hollis (Kyle/Dewey/Grandmaster Chad), Harley Barton (Enid/Veronica), Alexis Loiselle (Kate), Emma Wilcox (Chutney), Jack Gimpel (Aaron), Tyller Kenke (Padamadan/Nikos), Carly Caviglia (Judge/Store Manager), Meg Frost (Stenographer/Leilani), Brandon Moreno (Carlos/Lowell), John Katz (Pforzheimer), Chanel Black (D.A. Joyce Riley)",
            "notes": "Beautiful 4K capture of the 2022-2023 National Tour! An especially hilarious performance from all in this updated script with relevant references for today. It's filmed in 16:9 from the front center grand tier with a mix of wides, mediums, and closeups. There are no obstructions or blackouts but there is some occasional washout due to the spotlights used during darker scenes such as the Jailhouse. The sound is excellent. Includes curtain call and playbill scans.",
            "format": "MP4",
            "size": "18.54 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-0"
        }
    ],
    "The Little Mermaid": [
        {
            "id": "e-1110",
            "tour": "Broadway",
            "date": "2008-01-30",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Sierra Boggess (Ariel), Sherie Rene Scott (Ursula), Bret Shuford (u/s Prince Eric), Norm Lewis (King Triton), Tituss Burgess (Sebastian), Trevor Braun (Flounder), Eddie Korbich (Scuttle), Jonathan Freeman (Grimsby), Tyler Maynard (Flotsam), Derrick Baskin (Jetsam), John Treacy Egan (Chef Louis), Heidi Blickenstaff (Carlotta)",
            "notes": "MASTER NOTES: Great capture with great close-ups. The first 11 minutes after the Overture are mostly blackouts due to latecomers, after that no real problems. Bret did a nice job as understudy. Sierra and Sherie still rock with much greatness! Also includes the Part of Your World performance and interview from The View. Sometimes Cody Hanford is listed as Flounder, but the master’s release post lists Trevor Braun and Cody Hanford had apparently left the production before this video was filmed. A-<br><br>GENERAL NOTES: T/W: This video contains a PETA advertisement at the beginning, which contains graphic images and may be distressing.  This was included by the master on release.",
            "format": "VOB (with smalls)",
            "size": "4.39 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-0"
        }
    ],
    "Little Shop of Horrors": [
        {
            "id": "e-1122400",
            "tour": "Off-Broadway Revival",
            "date": "2021-10",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Jeremy Jordan (Seymour), Chelsea Turbin (u/s Audrey), Christian Borle (Orin/Others), Tom Alan Robbins (Mr. Mushnik), Joy Woods (Chiffon), Aveena Sawyer (Crystal), Salome Smith (Ronnette), Aaron Arnell Harrington (Voice of Audrey II), Teddy Yudain (Audrey II Manipulation/Derelict), Eric Wright (Audrey II Manipulation), Evan Alexander Smith (Audrey II Manipulation)",
            "notes": "",
            "format": "MP4",
            "size": "4.8 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-2"
        },
        {
            "id": "e-1129574",
            "tour": "Off-Broadway Revival",
            "date": "January, 2022 (1)",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Jeremy Jordan (Seymour), Tammy Blanchard (Audrey), Christian Borle (Orin/Others), Tom Alan Robbins (Mr. Mushnik), Joy Woods (Chiffon), Aveena Sawyer (Crystal), Salome Smith (Ronnette), Aaron Arnell Harrington (Voice of Audrey II), Weston Chandler Long (u/s Audrey II Manipulation/u/s Derelict), Paul McGinnis (Audrey II Manipulation), Josh Griffin (Audrey II Manipulation)",
            "notes": "Jeremy's last show!",
            "format": "MP4",
            "size": "5.11 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        },
        {
            "id": "e-2003404",
            "tour": "Off-Broadway Revival",
            "date": "2024-08",
            "time": "E",
            "master": "TheatreCouple14",
            "cast": "Andrew Barth Feldman (Seymour), Sarah Hyland (Audrey), James Carpinello (Orin/Others), Kevin Del Aguila (Mr. Mushnik), Khadija Sankoh (Chiffon), Camryn Hampton (u/s Crystal), Tiffany Reneé Thompson (Ronnette), Major Attaway (Voice of Audrey II), Teddy Yudain (Derelict)",
            "notes": "Excellent wide-shot phone boot from the front right orchestra. Mild obstruction on far left stoop, but only covers up lower bodies for a few moments. One slightly dark scene towards the end of Act II, but otherwise, really nicely shot. Sarah brings a new sexiness and humor to Audrey, and of course, Andrew is born for this role. He's delightful. Khadija continues to be my favorite urchin. Her clutching the cash from the audience had me rolling.<br><br>MY NOTES: Also includes audio, tracked and untracked in MP3",
            "format": "MP4",
            "size": "6.5 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-0"
        }
    ],
    "Little Women (Howland/Dickstein/Knee)": [
        {
            "id": "e-480",
            "tour": "Broadway",
            "date": "2004-12-11",
            "time": "E",
            "master": "Unknown",
            "cast": "Sutton Foster (Jo March), Amy McAlexander (Amy March), Jenny Powers (Meg March), Megan McGinnis (Beth March), Maureen McGovern (Marmee March), Danny Gurwin (Laurie Laurence), Janet Carroll (Aunt March), John Hickok (Professor Bhaer), Robert Stattel (Mr. Laurence), Jim Weitzer (John Brooke)",
            "notes": "Excellent video capture of the show! A little spotlight washout in the first 15 mins. Sound is excellent throughout. Also includes short Preview piece from NY1.",
            "format": "VOB (with smalls)",
            "size": "3.96 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-1"
        }
    ],
    "Mame": [
        {
            "id": "e-10531",
            "tour": "First Broadway Revival",
            "date": "1983-07",
            "time": "Unknown",
            "master": "Unknown",
            "cast": "Angela Lansbury (Mame Dennis), Anne Francine (Vera Charles), Jane Connell (Agnes Gooch), Roshi Handwerger (Patrick Dennis age 10), Byron Nease (Patrick Dennis age 19-29), Sab Shimono (Ito), Willard Waterman (Dwight Babcock), Fran Stevens (Mother Burnside), John C Becher (Mr. Upson), Donald Torres (M. Lindsay Woolsey), Michaela Hughes (Gloria Upson), Barbara Lang (Sally Cato), Patrick Sean Murphy (Junior Babcock), Ellyn Arons (Pegeen Ryan)",
            "notes": "Opened July 24, 1983 at the George Gershwin Theatre, where it ran for only 41 performances. Good video fidelity for its age, but video is on the dark side and the audio is heavily muffled, so its hard to make out the lyrics. Some copies may include 1984 Tony appearance.\nThe screenshots are from a copy with the Tony appearance, which originated as a DivX file.",
            "format": "VOB (with smalls)",
            "size": "3.68 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-2"
        }
    ],
    "Man of La Mancha": [
        {
            "id": "e-8822",
            "tour": "Fourth Broadway Revival",
            "date": "2002-11-24",
            "time": "E",
            "master": "Unknown",
            "cast": "Brian Stokes Mitchell (Don Quixote | Miguel de Cervantes), Mary Elizabeth Mastrantonio (Aldonza | Dulcinea), Ernie Sabella (Sancho Panza), Don Mayo (Innkeeper), Mark Jacoby (Padre), Stephen Bogardus (Dr. Carrasco), Natascia Diaz (Antonia), Bradley Dean (Anselmo), Jamie Torcellini (Barber), Olga Merediz (Housekeeper)",
            "notes": "Beautiful vid from second row center mezzanine, so no heads in the way. No obstructions at all. Lots of closeups, very steady. Wonderful production.<br><br>MY NOTES: Missing VIDEO_TS.VOB",
            "format": "VOB (incomplete smalls)",
            "size": "4.1 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-2"
        }
    ],
    "Matilda the Musical": [
        {
            "id": "e-5312",
            "tour": "Broadway",
            "date": "2015-01-01",
            "time": "E",
            "master": "SJ Bernly",
            "cast": "Tori Feinstein (Matilda), Christopher Sieber (Miss Trunchbull), Alison Luff (Miss Honey), Lesli Margherita (Mrs. Wormwood), Matt Harrington (Mr. Wormwood), Alex Brightman (Michael Wormwood), Celia Mei Rubin (Mrs. Phelps), Phillip Spaeth (Rudolpho), Mitchell Sink (Bruce), Grace Capeless (Lavender), Marcus D'Angelo (alt Nigel), Beatrice Tulchin (Amanda), Ted Wilson (alt Eric), Analise Scarpaci (alt Alice), Ava DeMary (Hortensia), Chris Sumpter (Tommy), Jennifer Bowles (Acrobat), Ben Thompson (Escapologist), Matt Meigs (Doctor), Sean Montgomery (Entertainer/Sergei)",
            "notes": "An excellent capture of Tori as Matilda. She's a very impressive young actress and has her own fresh take on the role. The rest of the cast is solid as well; I believe this is the first capture of Alison Luff, and she steps into the show beautifully. This is very nicely captured with no washout, no major blackouts, and very little obstruction. A railing blocks the very front left corner of the stage, but only the actors' legs are unseen. Telly is audio only; the video for Act Two begins when the house lights go down and Lavender takes the stage. It's filmed in 16:9, with a mix of wides, mediums, and close-ups. The sound is excellent. Includes curtain call and playbill scans. 2 discs.",
            "format": "MP4",
            "size": "4.38 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-2"
        }
    ],
    "Maybe Happy Ending": [
        {
            "id": "e-2005652",
            "tour": "Broadway",
            "date": "2024-10-16",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Darren Criss (Oliver), Helen J. Shen (Claire), Dez Duron (Gil Brentley), Marcus Choi (James)",
            "notes": "Great 4K capture of this show’s first preview! There is a tech hold an hour in, it is edited out and the video resumes after the show starts up again. A few brief black outs due to late seating, people leaving etc. Video starts about two minutes into the first song. Some wandering / readjustment and unfocusing throughout. Includes audio of pre-show speech by Michael Arden and curtain call, audio is fed from external source.",
            "format": "MP4",
            "size": "9.63 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-2"
        }
    ],
    "Me and My Girl": [
        {
            "id": "e-6337",
            "tour": "Encores!",
            "date": "2018-05",
            "time": "Unknown",
            "master": "NYCG8R",
            "cast": "Christian Borle (Bill Snibson), Laura Michelle Kelly (Sally Smith), Harriet Harris (Duchess of Dene), Chuck Cooper (Sir John Tremayne), Lisa O'Hare (Lady Jaqueline Carstone), Mark Evans (The Honorable Gerald Bolingbroke)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "4.52 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-2"
        }
    ],
    "Mean Girls": [
        {
            "id": "e-24527",
            "tour": "Broadway",
            "date": "2019-06",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Erika Henningsen (Cady Heron), Reneé Rapp (t/r Regina George), Krystina Alabado (Gretchen Wieners), Kate Rockwell (Karen Smith), Barrett Wilbert Weed (Janis Sarkisian), Grey Henson (Damian Hubbard), Kyle Selig (Aaron Samuels), Cheech Manohar (Kevin Gnapoor), Devon Hadsell (u/s Mrs. Heron/u/s Ms. Norbury/u/s Mrs. George), Rick Younger (Principal Duvall), Iain Young (s/w Ensemble), Myles McHale (Ensemble), Ixchel Cuellar (s/w Ensemble), Collins Conley (Ensemble), Jake Swain (Ensemble), DeMarius R. Copes (Ensemble), Kevin Cosculluela (Ensemble), Riza Takahashi (Ensemble), Maria Briggs (s/w Ensemble), Curtis Holland (Ensemble), Daryl Tofa (Ensemble), Becca Petersen (Ensemble), Christine Shepard (Ensemble), Brittany Nicholas (s/w Ensemble), Gianna Yanelli (Ensemble)",
            "notes": "Excellent HD capture of newcomer Reneé Rapp as Regina, bringing a new and powerful take to the role. Devon is a fantastic Mrs. Heron / Ms. Norbury / Mrs. George! Starts during It Roars. Please do not post screenshots of this video on Twitter ever. Gifs on Tumblr are okay after the NFT date, but dont go linking things to actors and shows.",
            "format": "MP4",
            "size": "6.43 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-0"
        },
        {
            "id": "e-351",
            "tour": "Broadway",
            "date": "2018-04-24",
            "time": "E",
            "master": "NYCG8R",
            "cast": "Erika Henningsen (Cady Heron), Taylor Louderman (Regina George), Ashley Park (Gretchen Wieners), Kate Rockwell (Karen Smith), Barrett Wilbert Weed (Janis Sarkisian), Grey Henson (Damian Hubbard), Kyle Selig (Aaron Samuels), Cheech Manohar (Kevin Gnapoor), Kerry Butler (Mrs. Heron/Ms. Norbury/Mrs. George), Rick Younger (Principal Duvall), Brendon Stimson (Ensemble), Myles McHale (Ensemble), Stephanie Lynn Bissonnette (Ensemble), Collins Conley (Ensemble), Ben Cook (Ensemble), DeMarius R. Copes (Ensemble), Kevin Csolak (Ensemble), Riza Takahashi (Ensemble), Devon Hadsell (Ensemble), Curtis Holland (Ensemble), Nikhil Saboo (Ensemble), Jonalyn Saxer (Ensemble), Kamille Upshaw (Ensemble), Zurin Villanueva (Ensemble), Gianna Yanelli (Ensemble)",
            "notes": "Beautiful quality video! A blackout in the very beginning of Act 1, but other than that amazing quality! The show does the movie justice and is just as dark and funny as the movie.\nReleased in two formats: MOV (10.1 GB) and VOB+smalls (4.22 GB).",
            "format": "VOB (with smalls) + MOV x2",
            "size": "4.53 GB + 10.09 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-2"
        },
        {
            "id": "e-24905",
            "tour": "Broadway",
            "date": "2020-01",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Erika Henningsen (Cady Heron), Reneé Rapp (Regina George), Cailen Fu (s/b Gretchen Wieners), Kate Rockwell (Karen Smith), Barrett Wilbert Weed (Janis Sarkisian), Grey Henson (Damian Hubbard), Cameron Dallas (t/r Aaron Samuels), Cheech Manohar (Kevin Gnapoor), Catherine Brunell (Mrs. Heron/Ms. Norbury/Mrs. George), Rick Younger (Principal Duvall), Drew Redington (Ensemble), Teddy Toye (Ensemble), Stephanie Lynn Bissonnette (Ensemble), Collins Conley (Ensemble), Jake Swain (Ensemble), Darius Barnes (Ensemble), Pascal Pastrana (Ensemble), Riza Takahashi (Ensemble), Devon Hadsell (Ensemble), Curtis Holland (Ensemble), Daryl Tofa (Ensemble), Susie Carroll (s/w Ensemble), Sasha Hollinger (Ensemble), Maria Briggs (s/w Ensemble), Gianna Yanelli (Ensemble)",
            "notes": "Stunning HD capture of Cailen as Gretchen and newcomers Catherine Brunell and social media entrepreneur Cameron Dallas. Filmed in 16:9 from the left orchestra with a mix of wides, mediums, and closeups. Missing the first few seconds of each act but the action is followed perfectly and there are almost no instances of washout or major dropouts.",
            "format": "MP4",
            "size": "6.47 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-1"
        }
    ],
    "Merrily We Roll Along": [
        {
            "id": "e-13797",
            "tour": "Arena Stage",
            "date": "1990",
            "time": "Unknown",
            "master": "Unknown",
            "cast": "Victor Garber (Franklin Shepard), David Garrison (Charley Kringas), Becky Ann Baker (Mary Flynn), Mary Gordon Murray (Gussie Carnegie), Marin Mazzie (Beth Spencer), Richard Bauer (Joe Josephson), Deanna Wells (Meg Kincaid), Melodee Savage (K.T.), Rufus Bonds Jr. (Jerome), Erick Devine (Tyler), Ruth Williamson (Mrs. Spencer/Terry), Tom Hewitt (Scotty), John Deyle (Mr. Spencer), Thom Sesma (Ru)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "2.59 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-1"
        },
        {
            "id": "e-23636",
            "tour": "The Wallis",
            "date": "2016-11-23",
            "time": "E",
            "master": "SJ Bernly",
            "cast": "Aaron Lazar (Franklin Shepard), Wayne Brady (Charley Kringas), Donna Vivino (Mary Flynn), Saycon Sengbloh (Gussie Carnegie), Whitney Bashor (Beth Spencer), Amir Talai (Joe Josephson), Maximus Brandon Verso (Frank Jr.)",
            "notes": "First preview. A fantastic new production of this rarely performed Sondheim classic. Updated staging and direction, phenomenal performances all around, and a great energy from both the actors and the audience. Perfectly captured with no washout, no obstruction, and no blackouts. It’s filmed in 16:9, with a mix of wides, mediums, and close-ups. The sound is excellent. Includes curtain call and playbill scans. Two discs.",
            "format": "VOB (with smalls)",
            "size": "9.64 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-0"
        },
        {
            "id": "e-9020",
            "tour": "Kennedy Center",
            "date": "2002-08-18",
            "time": "E",
            "master": "Unknown",
            "cast": "Michael Hayden (Franklin Shepard), Raúl Esparza (Charley Kringas), Miriam Shor (Mary Flynn), Emily Skinner (Gussie Carnegie), Anastasia Barzee (Beth Spencer), Adam Heller (Joe Josephson)",
            "notes": "A great capture of this production, video is a little dark, but unobstructed and well filmed. The sound is excellent.",
            "format": "VOB (with smalls)",
            "size": "2.75 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-0"
        },
        {
            "id": "e-2003216",
            "tour": "New York Theatre Workshop",
            "date": "2023-01",
            "time": "E",
            "master": "The Musical Speakeasy",
            "cast": "Jonathan Groff (Franklin Shepard), Daniel Radcliffe (Charley Kringas), Lindsay Mendez (Mary Flynn), Krystal Joy Brown (Gussie Carnegie), Katie Rose Clarke (Beth Spencer), Reg Rogers (Joe Josephson), Colin Keane (Frank Jr.), Talia Simone Robinson (Meg Kincaid), Natalie Wachen (K.T.), Vishal Vaidya (Jerome), Corey Mach (Tyler/Make-Up Artist), Sherz Aletaha (Mrs. Spencer/Scotty/Auditionee), Jacob Keith Watson (Terry/Mr. Spencer), Brian Sears (Bunker/Photographer/Newscaster), Jamila Sabares-Klemm (Evelyn/Dory), Christian Strange (Ru/Reverend), Leana Rae Concepcion (Newscaster/Waitress/Auditionee)",
            "notes": "MASTER NOTES: Stageshot. No obstructions. Some heavy washout in the first act, but almost none in the second act. Audio only for the last nine minutes missing from the first act (from Beth's entrance on), and the first five minutes of the second act (just before It's A Hit). Excellent audio. Shot from second row centre. [B-]<br><br>GENERAL NOTES: This is the best Merrily We Roll Along will ever be. Lindsay Mendez, Jonathan Groff, and Katie Rose Clarke are all cementing their performances as the defining interpretations of their characters. Jaw-droppingly directed, astoundingly well crafted, fantastic chemistry – only real disappointment is the orchestra. Please forgive any choking sobs that may have leaked into this recording. One of the most excellent nights of theatre I've ever experienced.",
            "format": "M4V",
            "size": "10.72 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-0"
        },
        {
            "id": "e-2001888",
            "tour": "First Broadway Revival",
            "date": "2024-05-31",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Jonathan Groff (Franklin Shepard), Koray Tarhan (u/s Charley Kringas), Lindsay Mendez (Mary Flynn), Krystal Joy Brown (Gussie Carnegie), Katie Rose Clarke (Beth Spencer), Reg Rogers (Joe Josephson), Max Rackenberg (Frank Jr.), Talia Simone Robinson (Meg Kincaid), Natalie Wachen (K.T.), Vishal Vaidya (Jerome), Corey Mach (Tyler), Sherz Aletaha (Mrs. Spencer/Scotty/Auditionee), Jacob Keith Watson (Terry/Mr. Spencer), Leana Rae Concepcion (Claudia/Newscaster/Auditionee), Coby Getzug (Bunker/Photographer/Newscaster), Jamila Sabares-Klemm (Evelyn/Dory/Pianist), Evan Alexander Smith (u/s Ru/u/s Reverend), Brianna Stoute (Mimi from Paramount/Make-Up Artist), David Scott Purdy (s/w Greg from Paramount)",
            "notes": "Excellent 4K capture of Koray as Charley! Increased moments of wandering and unfocusing, especially during transitions. Some washout on the wider shots. A head is visible on the bottom right, more so in Act Two, but doesn’t block off anything. Some action is cut off on the far right due to the angle. Overture and entr’acte are audio only. Includes curtain call, audio fed from external source.",
            "format": "MP4",
            "size": "12.1 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-2"
        },
        {
            "id": "e-2000899",
            "tour": "First Broadway Revival",
            "date": "2024-03-31",
            "time": "E",
            "master": "shesmydoctor",
            "cast": "Jonathan Groff (Franklin Shepard), Daniel Radcliffe (Charley Kringas), Lindsay Mendez (Mary Flynn), Krystal Joy Brown (Gussie Carnegie), Katie Rose Clarke (Beth Spencer), Reg Rogers (Joe Josephson), Max Rackenberg (Frank Jr.), Talia Simone Robinson (Meg Kincaid), Natalie Wachen (K.T.), Vishal Vaidya (Jerome), Corey Mach (Tyler), Sherz Aletaha (Mrs. Spencer/Scotty/Auditionee), Jacob Keith Watson (Terry/Mr. Spencer), Leana Rae Concepcion (Claudia/Newscaster), Brian Sears (Bunker/Newscaster), Jamila Sabares-Klemm (Evelyn/Dory/Pianist), Christian Strange (Ru/Reverend), Brianna Stoute (Mimi from Paramount/Make-Up Artist), Ken Krugman (s/w Greg from Paramount)",
            "notes": "<p>Excellent capture of Merrily’s 200th performance on Broadway, nice mix of wide shots and close-ups.</p>",
            "format": "MP4 x2",
            "size": "9.63 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        },
        {
            "id": "e-2004075",
            "tour": "First Broadway Revival",
            "date": "2024-04",
            "time": "Unknown",
            "master": "Jagweed",
            "cast": "Jonathan Groff (Franklin Shepard), Daniel Radcliffe (Charley Kringas), Lindsay Mendez (Mary Flynn), Krystal Joy Brown (Gussie Carnegie), Katie Rose Clarke (Beth Spencer), Reg Rogers (Joe Josephson), Rocco van Auken (Frank Jr.), Brianna Stoute (Meg Kincaid), Natalie Wachen (K.T.), Vishal Vaidya (Jerome), Corey Mach (Tyler), Sherz Aletaha (Mrs. Spencer/Scotty/Auditionee), Jacob Keith Watson (Terry/Mr. Spencer), Leana Rae Concepcion (Claudia/Newscaster/Auditionee), Coby Getzug (Bunker/Photographer/Newscaster), Jamila Sabares-Klemm (Evelyn/Dory/Pianist), Christian Strange (Ru/Reverend), Morgan Kirner (s/w Mimi from Paramount/s/w Make-Up Artist), Evan Alexander Smith (Greg from Paramount)",
            "notes": "A near perfect capture. No obstruction. Just the occasional focus issue that lasts a few seconds. Very proud of this capture. A great mix of wides, mediums and close ups. Recording includes the curtain call and marquee.",
            "format": "MP4",
            "size": "11.45 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-3"
        },
        {
            "id": "e-2000894",
            "tour": "First Broadway Revival",
            "date": "2024-01-20",
            "time": "M",
            "master": "shesmydoctor",
            "cast": "Jonathan Groff (Franklin Shepard), Daniel Radcliffe (Charley Kringas), Jamila Sabares-Klemm (u/s Mary Flynn), Krystal Joy Brown (Gussie Carnegie), Katie Rose Clarke (Beth Spencer), Reg Rogers (Joe Josephson), Max Rackenberg (Frank Jr.), Talia Simone Robinson (Meg Kincaid), Natalie Wachen (K.T.), Vishal Vaidya (Jerome), Corey Mach (Tyler), Sherz Aletaha (Mrs. Spencer/Scotty), Jacob Keith Watson (Terry/Mr. Spencer), Leana Rae Concepcion (Claudia/Newscaster), Brian Sears (Bunker/Newscaster), Amanda Rose (s/w Evelyn/s/w Dory/s/w Pianist), Christian Strange (Ru/Reverend), Maya Boyd (Mimi from Paramount/Make-Up Artist), Evan Alexander Smith (Greg from Paramount)",
            "notes": "<p>Great capture with minor obstructions that mostly do not disrupt the action</p>",
            "format": "MP4 x2",
            "size": "9.62 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-0"
        },
        {
            "id": "e-1156453",
            "tour": "First Broadway Revival",
            "date": "2024-02-28",
            "time": "M",
            "master": "bikinibottomday",
            "cast": "Jonathan Groff (Franklin Shepard), Daniel Radcliffe (Charley Kringas), Lindsay Mendez (Mary Flynn), Krystal Joy Brown (Gussie Carnegie), Katie Rose Clarke (Beth Spencer), Reg Rogers (Joe Josephson), Rocco van Auken (Frank Jr.), Talia Simone Robinson (Meg Kincaid), Natalie Wachen (K.T.), Vishal Vaidya (Jerome), Corey Mach (Tyler), Sherz Aletaha (Mrs. Spencer/Scotty/Auditionee), Jacob Keith Watson (Terry/Mr. Spencer), Leana Rae Concepcion (Claudia/Newscaster/Auditionee), Brian Sears (Bunker/Photographer/Newscaster), Amanda Rose (s/w Evelyn/s/w Dory/s/w Pianist), Christian Strange (Ru/Reverend), Maya Boyd (Mimi from Paramount/Make-Up Artist), Evan Alexander Smith (Greg from Paramount)",
            "notes": "Excellent 4K capture of this stunning revival! Minor head obstruction throughout, which leads to a little bit of missed action. Increased wandering and unfocusing throughout. Act Two starts a bit into “Gussie’s Opening Number.” Some washout on the wider shots. Includes part of the overture and curtain call, audio is fed from external source.",
            "format": "MP4",
            "size": "12.21 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-2"
        },
        {
            "id": "e-2000007",
            "tour": "First Broadway Revival",
            "date": "2024-01",
            "time": "Unknown",
            "master": "catherinewasamassivec",
            "cast": "Jonathan Groff (Franklin Shepard), Daniel Radcliffe (Charley Kringas), Lindsay Mendez (Mary Flynn), Krystal Joy Brown (Gussie Carnegie), Katie Rose Clarke (Beth Spencer), Reg Rogers (Joe Josephson), Max Rackenberg (Frank Jr.), Talia Simone Robinson (Meg Kincaid), Amanda Rose (s/w K.T.), Vishal Vaidya (Jerome), Corey Mach (Tyler), Sherz Aletaha (Scotty), Jacob Keith Watson (Terry), Leana Rae Concepcion (Claudia), Brian Sears (Bunker), Jamila Sabares-Klemm (Dory), Christian Strange (Ru), Maya Boyd (Mimi from Paramount), Evan Alexander Smith (Greg from Paramount)",
            "notes": "",
            "format": "MP4",
            "size": "7.75 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-0"
        },
        {
            "id": "e-1151338",
            "tour": "First Broadway Revival",
            "date": "2023-11-22",
            "time": "M",
            "master": "bikinibottomday",
            "cast": "Jonathan Groff (Franklin Shepard), Daniel Radcliffe (Charley Kringas), Sherz Aletaha (u/s Mary Flynn), Krystal Joy Brown (Gussie Carnegie), Katie Rose Clarke (Beth Spencer), Reg Rogers (Joe Josephson), Max Rackenberg (Frank Jr.), Talia Simone Robinson (Meg Kincaid), Natalie Wachen (K.T.), Vishal Vaidya (Jerome), Corey Mach (Tyler), Amanda Rose (s/w Mrs. Spencer/s/w Scotty/s/w Auditionee), Jacob Keith Watson (Terry/Mr. Spencer), Leana Rae Concepcion (Claudia/Newscaster/Auditionee), Brian Sears (Bunker/Photographer/Newscaster), Jamila Sabares-Klemm (Evelyn/Dory/Pianist), Christian Strange (Ru/Reverend), Maya Boyd (Mimi from Paramount/Make-Up Artist), Evan Alexander Smith (Greg from Paramount)",
            "notes": "Excellent 4K capture of Sherz’s debut as Mary! Some wandering and unfocusing throughout. Some washout on the wider shots. Includes overture, curtain call, and the post-show BC/EFA speech, audio is fed from external source.",
            "format": "MP4",
            "size": "11.81 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        },
        {
            "id": "e-1136238",
            "tour": "New York Theatre Workshop",
            "date": "2022-12-15",
            "time": "E",
            "master": "Medium Observation",
            "cast": "Jonathan Groff (Franklin Shepard), Daniel Radcliffe (Charley Kringas), Lindsay Mendez (Mary Flynn), Krystal Joy Brown (Gussie Carnegie), Katie Rose Clarke (Beth Spencer), Reg Rogers (Joe Josephson)",
            "notes": "Decent video of this production.The video is completely blind shot and wide shot. Included is an edit with added zooms in post. The first 30 or so minutes in Act 2 are missing due to camera issues so it's just audio unfortunately. The video starts again at Good Thing Going. There is a lady in front of me with a really large ugly hat in Act 1. This blocks most action dead center stage but is worked around as well as possible. Act 2 is a little better because the hat is not on her head. Overall not the best video but it's watchable, especially if you watch the edited version. This cast was fantastic.",
            "format": "MP4",
            "size": "8.31 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-0"
        },
        {
            "id": "e-1136501",
            "tour": "New York Theatre Workshop",
            "date": "2022-11",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Jonathan Groff (Franklin Shepard), Daniel Radcliffe (Charley Kringas), Lindsay Mendez (Mary Flynn), Krystal Joy Brown (Gussie Carnegie), Katie Rose Clarke (Beth Spencer), Reg Rogers (Joe Josephson), Colin Keane (Frank Jr.), Talia Simone Robinson (Meg Kincaid), Natalie Wachen (K.T.), Vishal Vaidya (Jerome), Corey Mach (Tyler/Make-Up Artist), Sherz Aletaha (Mrs. Spencer/Scotty/Auditionee), Jacob Keith Watson (Terry/Mr. Spencer), Leana Rae Concepcion (Claudia/Newscaster/Waitress/Auditionee), Brian Sears (Bunker/Photographer/Newscaster), Jamila Sabares-Klemm (Evelyn/Dory/Pianist), Christian Strange (Ru/Reverend), Maya Boyd (Mimi from Paramount/Make-Up Artist)",
            "notes": "",
            "format": "MP4",
            "size": "7.07 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        }
    ],
    "Les Misérables": [
        {
            "id": "e-1157600",
            "tour": "Sixth US National Tour",
            "date": "2024-02-06",
            "time": "E",
            "master": "Medium Observation",
            "cast": "Nick Cartell (Jean Valjean), Steve Czarnecki (u/s Javert), Haley Dortch (Fantine), Delaney Guyer (Cosette), Jake David Smith (Marius), Mya Rena Hunter (Éponine), Matt Crowle (Thénardier), Devin Archer (Enjolras), Victoria Huston-Elem (Madame Thénardier), Henry Kirk (Gavroche), Olivia Grace O'Sullivan (Little Cosette), Kyle Adams (Grantaire), Matt Rosell (u/s Feuilly), Ethan Rogers (Courfeyrac), Andrew Marks Maughan (Combeferre), J.T. Wood (Joly), Kyle Timson (u/s Factory Foreman/u/s Brujon), David Andino (s/b Bamatabois/s/b Babet), Christopher James Tamayo (Montparnasse), Cameron Loyal (Claquesous), Randy Jeter (Lesgles/The Bishop of Digne), Sky Vaux Fuller (Young Éponine), Julia Ellen Richardson (Factory Girl), Juliette Redden (u/s Old Woman), Kelsey Denae (Wigmaker), Mikako Martin (u/s Ensemble), Arianne DiCerbo (Ensemble), Genevieve Ellis (Ensemble), Greta Schaefer (Ensemble), Veronica Stern (Ensemble)",
            "notes": "Perfect video of this incredible cast. Steve tears the house down as Javert and is near perfect in the role. The video has very little washout and the colors are very pretty. There is some grain when it's very dark but it's not distracting. Some shakiness throughout.",
            "format": "MP4",
            "size": "13.45 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        },
        {
            "id": "e-8408",
            "tour": "West End",
            "date": "2018-11",
            "time": "E",
            "master": "NYCG8R",
            "cast": "Dean Chisnall (Jean Valjean), Bradley Jaden (Javert), Carley Stenson (Fantine), Amara Okereke (Cosette), Toby Miles (Marius), Elena Skye (Éponine), James Hume (u/s Thénardier), Samuel Edwards (Enjolras), Vivien Parry (Madame Thénardier), Logan Clark (Gavroche), Adam Filipe (u/s Grantaire), Joe Vetch (Feuilly), Oliver Brenin (s/w Courfeyrac), Barnaby Hughes (Combeferre/Fauchelevent), James Nicholson (Joly), Adam Bayjou (Factory Foreman/Brujon/Champmathieu), Sam Harrison (Bamatabois/Claquesous), Ben Tyler (Jean Prouvaire/Pimp), Ciaran Joyce (Montparnasse), Andrew York (Lesgles/u/s The Bishop of Digne), Ciaran Bowling (s/w Babet/s/w Major Domo), Anna McGarahan (Factory Girl/Crone)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "4.53 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-2"
        }
    ],
    "Monty Python's Spamalot": [
        {
            "id": "e-6166",
            "tour": "Broadway",
            "date": "2005-03-12",
            "time": "E",
            "master": "Unknown",
            "cast": "Tim Curry (King Arthur), Sara Ramirez (Lady of The Lake), David Hyde Pierce (Sir Robin), Hank Azaria (Sir Lancelot), Steve Rosen (Sir Bedevere), Christian Borle (Historian/Prince Herbert), Michael McGrath (Patsy), Christopher Sieber (Sir Galahad)",
            "notes": "Broadway Previews. Playbill scans.",
            "format": "VOB (with smalls)",
            "size": "3.79 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        },
        {
            "id": "e-6167",
            "tour": "Broadway",
            "date": "2005-06-08",
            "time": "E",
            "master": "Unknown",
            "cast": "Tim Curry (King Arthur), Darlene Wilson (u/s Lady of The Lake), David Hyde Pierce (Sir Robin), John Bolton (u/s Sir Lancelot), Steve Rosen (Sir Bedevere), Christian Borle (Historian/Prince Herbert), Michael McGrath (Patsy), Christopher Sieber (Sir Galahad)",
            "notes": "Filmed from far left mezz and cuts off after the knights find the grail. Filmed two days after Hank Azaria left.",
            "format": "VOB (with smalls)",
            "size": "3.71 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        },
        {
            "id": "e-2004743",
            "tour": "First Broadway Revival",
            "date": "2024-03",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "James Monroe Iglehart (King Arthur), Leslie Rodriguez Kritzer (Lady of The Lake), Jonathan Bennett (Sir Robin/Brother Maynard/Guard 1), Alex Brightman (Sir Lancelot/The French Taunter/Knight of Ni/Tim the Enchanter), Jimmy Smagula (Sir Bedevere/Dennis' Mother/Concorde), Ethan Slater (Historian/Not Dead Fred/Prince Herbert/Bunny), Christopher Fitzgerald (Mayor/Patsy/Guard 2), Nik Walker (Sir Galahad/Black Knight/Prince Herbert's Father), Maria Briggs (Ensemble), Gabriella Enriquez (Ensemble), Michael Fatica (Ensemble), Denis Lambert (Ensemble), Shina Ann Morris (Ensemble), Kaylee Olson (Ensemble), Kristin Piro (Ensemble), Drew Redington (Ensemble), Tyler Roberts (Ensemble), Daniel Beeman (Ensemble)",
            "notes": "cows",
            "format": "MP4",
            "size": "5.7 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        },
        {
            "id": "e-1152920",
            "tour": "First Broadway Revival",
            "date": "2023-12-20",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "James Monroe Iglehart (King Arthur), Leslie Rodriguez Kritzer (Lady of The Lake), Michael Urie (Sir Robin/Brother Maynard/Guard 1), Taran Killam (Sir Lancelot/The French Taunter/Knight of Ni/Tim the Enchanter), Jimmy Smagula (Sir Bedevere/Dennis' Mother/Concorde), Ethan Slater (Historian/Not Dead Fred/Prince Herbert/Bunny/Nun), Christopher Fitzgerald (Mayor/Patsy/Guard 2), Nik Walker (Sir Galahad/Black Knight/Prince Herbert's Father), Michael Fatica (Guard/Minstrel), Drew Redington (Guard), Kaylee Olson (Minstrel), Denis Lambert (Bors), Daniel Beeman (Sir Not Appearing), Maria Briggs (Ensemble), Gabriella Enriquez (Ensemble), Anju Cloud (s/w Ensemble), Kristin Piro (Ensemble), Tyler Roberts (Ensemble)",
            "notes": "Excellent 4K capture of this new revival! The scene explaining Excalibur has a 30 second blackout. There is minor head / railing obstruction on the bottom that doesn't block much action. Wandering/readjustment and unfocusing throughout. For privacy reasons, the audio containing an audience member's full name is cut. Washout on the wider shots. Includes curtain call, audio is fed from external source.",
            "format": "MP4",
            "size": "9.78 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        },
        {
            "id": "e-1143342",
            "tour": "Broadway Center Stage",
            "date": "2023-05-18",
            "time": "M",
            "master": "Medium Observation",
            "cast": "James Monroe Iglehart (King Arthur), Leslie Rodriguez Kritzer (Lady of The Lake), Michael Urie (Sir Robin/Brother Maynard/Guard 1), Alex Brightman (Sir Lancelot/The French Taunter/Knight of Ni/Tim the Enchanter), Jimmy Smagula (Sir Bedevere/Dennis' Mother/Concorde), Rob McClure (Historian/Prince Herbert), Matthew Saldivar (Patsy/Guard 2), Nik Walker (Sir Galahad/Black Knight/Prince Herbert's Father), Michael Fatica (Ensemble), Kaylee Olson (Ensemble), Ryan Kasprzak (Ensemble), Phillip Attmore (Ensemble), Daniel Beeman (Ensemble), Maria Briggs (Ensemble), Eloise Kropp (Ensemble), Daniel May (Ensemble), Shina Ann Morris (Ensemble), Kristin Piro (Ensemble)",
            "notes": "Nice video of this hilarious show. Filmed from the orchestra. Lots of wideshots, which can lead to some washout at times. Beautiful zooms however on the cast (Alex Brightman fancam at times but it never takes away from the video!). Overall a great video of this hilarious and perfect production.",
            "format": "MP4",
            "size": "9.85 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-3"
        }
    ],
    "Moulin Rouge! The Musical": [
        {
            "id": "e-1150152",
            "tour": "First US National Tour",
            "date": "2023-09",
            "time": "Unknown",
            "master": "catherinewasamassivec",
            "cast": "Gabrielle McClinton (alt Satine), John Cardoza (Christian), Austin Durant (Harold Zidler), Andrew Brewer (The Duke of Monroth), Nick Rashad Burroughs (Toulouse-Lautrec), Gabe Martinez (Santiago), Libby Lloyd (Nini), Harper Miles (La Chocolat), Nicci Claspell (Arabia), Max Heitmann (Baby Doll)",
            "notes": "Professional Moulin Rouge filmer StarCuffedJeans yelled at me cause my footage was too good.",
            "format": "MP4",
            "size": "8.86 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-0"
        },
        {
            "id": "e-1117710",
            "tour": "Broadway",
            "date": "2021-11",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Ashley Loren (alt Satine), Aaron Tveit (Christian), Danny Burstein (Harold Zidler), Tam Mutu (The Duke of Monroth), Sahr Ngaujah (Toulouse-Lautrec), Ricky Rojas (Santiago), Robyn Hurder (Nini), Jacqueline B. Arnold (La Chocolat), Holly James (Arabia), Jeigh Madjus (Baby Doll), Reed Luplau (Pierre), Keely Beirne (Ensemble), Giovanni Bonaventura (Ensemble), Olutayo Bosede (Ensemble), Kyle Brown (Ensemble), Sam J. Cahn (Ensemble), Bobby Daye (Ensemble), Karli Dinardo (Ensemble), Aaron C. Finley (Ensemble), Bahiyah Hibah (Ensemble), Kaitlin Mesh (Ensemble), Fredric Odgaard (Ensemble), Khori Michelle Petinaud (Ensemble), Benjamin Rivera (Ensemble), Julius Anthony Rubio (Ensemble), Ericka Hunter Yang (Ensemble)",
            "notes": "",
            "format": "MP4",
            "size": "6.43 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        }
    ],
    "Mrs. Doubtfire": [
        {
            "id": "e-2002783",
            "tour": "First US National Tour",
            "date": "June, 2024 (2)",
            "time": "E",
            "master": "MTTZ",
            "cast": "Rob McClure (Daniel Hillard), Maggie Lakis (Miranda Hillard), Giselle Gutierrez (Lydia Hillard), Charlotte Sydney Harrington (Natalie Hillard), Axel Bernard Rimmele (Christopher Hillard), Aaron Kaburick (Frank Hillard), Romelda Benjamin (Wanda Sellner), Leo Roberts (Stuart Dunmire), Nik Alexander (Andre Mayem), David Hibbard (Mr. Jolly), Jodi Kimura (Janet Lundy), Alex Branton (Ensemble), Jonathan Hoover (Ensemble), Julie Kavanagh (Ensemble), Marquez Linder (Ensemble), Alex Ringler (Ensemble), Lannie Rubio (Ensemble), Neil Starkenberg (Ensemble), Julia Yameen (Ensemble)",
            "notes": "Incredible capture of this fantastic tour. A decent amount of very brief dropouts due to audience members walking around the aisle, but they don't lose much video at all. Shot in a wonderful mix of wides, mediums, and close-ups. Some washout can be seen on wider shots. Some wandering, shaking, and re-adjusting throughout. Extremely enthusiastic audience that was giving a bunch of applause to the actors throughout the show.",
            "format": "MP4",
            "size": "10.1 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        }
    ],
    "The Muppets Take The Bowl": [
        {
            "id": "e-113",
            "tour": "Hollywood Bowl",
            "date": "2017-09-10",
            "time": "E",
            "master": "SJ Bernly",
            "cast": "Matt Vogel (Kermit/Uncle Deadly/Sweetums/Strangepork/Sgt. Floyd Pepper/Camilla), Eric Jacobson (Miss Piggy/Fozzie/Animal/Snowth/Sam/Newsman), Dave Goelz (Gonzo/Waldorf/Dr. Honeydew/Beauregard), David Rudman (Scooter/Beaker/Janice), Bill Barretta (Chef/Rowlf/Pepe/Mahna Mahna/Dr. Teeth/Bobo), Peter Linz (Statler/Robin/Lips/Link Hogthrob), Bobby Moynihan (Host)",
            "notes": "Conducted by Thomas Wilkins. Just what you'd expect from The Muppets—a hilarious and fun production full of antics and great music. There are tons of great SoCal and Hollywood Bowl jokes and references. The stage is filmed directly except when the action can only be seen on screen. This is perfectly captured with no dropouts, no obstruction, and only some slight washout. It's filmed in 16:9, with a mix of wides, mediums, and close-ups. The sound is excellent. Includes fireworks display, curtain call, encore, and playbill scans.",
            "format": "VOB (with smalls)",
            "size": "7.63 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-0"
        }
    ],
    "Murder Ballad": [
        {
            "id": "e-521",
            "tour": "Off-Broadway Remount",
            "date": "2013-07-13",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Caissie Levy (Sara), John Ellison Conlee (Michael), Jim Newman (u/s Tom), Rebecca Naomi Jones (Narrator)",
            "notes": "Excellent HD capture. Performed in the round in a bar setting, so the action takes place all over the theater.",
            "format": "VOB (no smalls)",
            "size": "4.39 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-3"
        }
    ],
    "The Music Man": [
        {
            "id": "e-1154097",
            "tour": "Third Broadway Revival",
            "date": "2023-01",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Hugh Jackman (Harold Hill), Sutton Foster (Marian Paroo), Marie Mullen (Mrs. Paroo), Benjamin Pajak (Winthrop), Shuler Hensley (Marcellus Washburn), Mark Linn-Baker (Mayor Shinn), Gino Cosculluela (Tommy Djilas), Emma Crow (Zaneeta Shinn), Remy Auberjonois (Charlie Cowell), Emily Jewel Hoder (Amaryllis), Phillip Boykin (Olin Britt/Barbershop Quartet), Jayne Houdyshell (Eulalie MacKecknie Shinn), Eddie Korbich (s/b Jacey Squires), Daniel Torres (Ewart Dunlop/Barbershop Quartet), Jessica Sheridan (Maud Dunlop), Rema Webb (Mrs. Squires), Garrett Long (Ethel Toffelmier), Nicholas Ward (Barbershop Quartet/Oliver Hix), Lance Roberts (Constable Locke), Linda Mugleston (Alma Hix), Kennedy Pitney (Gracie Shinn), Nick Alvino (Ensemble), Jordan Beall (Ensemble), Lauren Blackman (Ensemble), Ronnie S Bowman Jr. (Ensemble), Audrina Brudner (Ensemble), Michael Cash (Ensemble), William Thomas Colin (Ensemble), Kammie Crum (Ensemble), Aydin Eyikan (Ensemble), Ethen Green-Younger (Ensemble), Andrea Jones-Sojola (Ensemble), Amanda LaMotte (Ensemble), Kayla LaVine (Ensemble), Ross Lekites (Ensemble), Devin Miles Lugo (Ensemble), Drew Minard (Ensemble), Sean Montgomery (Ensemble), Tanner Quirk (Ensemble), Ann Sanders (Ensemble), Sherisse Springer (Ensemble), Mitchell Tobin (Ensemble), Branch Woodman (Ensemble)",
            "notes": "",
            "format": "MP4",
            "size": "6.4 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-2"
        },
        {
            "id": "e-1118925",
            "tour": "Third Broadway Revival",
            "date": "2021-12",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Hugh Jackman (Harold Hill), Sutton Foster (Marian Paroo), Marie Mullen (Mrs. Paroo), Benjamin Pajak (Winthrop), Shuler Hensley (Marcellus Washburn), Branch Woodman (u/s Mayor Shinn), Gino Cosculluela (Tommy Djilas), Emma Crow (Zaneeta Shinn), Remy Auberjonois (Charlie Cowell), Kayla Teruel (Amaryllis), Phillip Boykin (Olin Britt/Barbershop Quartet), Jayne Houdyshell (Eulalie MacKecknie Shinn), Eddie Korbich (Jacey Squires/Barbershop Quartet), Daniel Torres (Ewart Dunlop/Barbershop Quartet), Jessica Sheridan (Maud Dunlop), Rema Webb (Mrs. Squires), Garrett Long (Ethel Toffelmier), Nicholas Ward (Barbershop Quartet/Oliver Hix), Lance Roberts (Constable Locke), Linda Mugleston (Alma Hix), Emily Jewel Hoder (Ensemble)",
            "notes": "Master wrote down that Jefferson Mays was on as the mayor in this performance, but it's not him judging by the video. Given the actor playing the mayor is white and Branch was the only white u/s for the mayor, it's probably him.",
            "format": "MP4",
            "size": "6.56 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-2"
        }
    ],
    "Natasha, Pierre & The Great Comet of 1812": [
        {
            "id": "e-482",
            "tour": "Broadway",
            "date": "2016-10-29",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Denée Benton (Natasha), Josh Groban (Pierre), Brittain Ashford (Sonya), Lucas Steele (Anatole), Amber Gray (Hélène), Manik Choksi (Dolokhov), Nicholas Belton (Bolkonsky/Andrey), Gelsey Bell (Mary/Opera Singer/Maidservant)",
            "notes": "Nice HD capture of this immersive production that takes place all over the theater. Everything is captured as well as can be done in this setting. A beautiful production with so many layers and phenomenal performances. A-",
            "format": "VOB (with smalls)",
            "size": "8.4 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-0"
        }
    ],
    "Newsies": [
        {
            "id": "e-445",
            "tour": "First US National Tour",
            "date": "2016-01-08",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Joey Barreiro (Jack Kelly), Stephen Michael Langton (Davey Jacobs), Morgan Keene (Katherine Plumber), Zachary Sayle (Crutchie), Steve Blanchard (Joseph Pulitzer), Aisha de Haas (Medda Larkin), Ethan Steiner (Les Jacobs)",
            "notes": "Beautiful HD capture with no obstructions. This features the new cast that just took over the roles. Still a top notch tour and Joey has such a big beautiful voice! A+",
            "format": "VOB (with smalls)",
            "size": "8.36 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-1"
        }
    ],
    "Next to Normal": [
        {
            "id": "e-362",
            "tour": "Broadway",
            "date": "2009-04-04",
            "time": "M",
            "master": "itsux2bme2005",
            "cast": "Alice Ripley (Diana), J. Robert Spencer (Dan), Aaron Tveit (Gabe), Jennifer Damiano (Natalie), Adam Chanler-Berat (Henry), Louis Hobson (Dr. Fine/Dr. Madden)",
            "notes": "Filmed this with the camera resting on my knee (understudies were sitting in the aisles near me, ushers walking around, friends of cast to my left). Inevitable wandering, and sometimes more zoomed out than it should be. Theres more spotlight washout than normal.",
            "format": "VOB (with smalls)",
            "size": "4.44 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-2"
        },
        {
            "id": "e-192",
            "tour": "Broadway",
            "date": "2009-04-10",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Alice Ripley (Diana), J. Robert Spencer (Dan), Aaron Tveit (Gabe), Jennifer Damiano (Natalie), Adam Chanler-Berat (Henry), Louis Hobson (Dr. Fine/Dr. Madden)",
            "notes": "MASTER NOTES: Beautiful capture of the full original cast, from the orchestra. This hands down is the best capture of the original cast. This was done early in Alice's run, before she had strained her voice. Wonderful to revisit this show in all its glory! A+<br><br>GENERAL NOTES: T/W: This video contains a PETA advertisement at the beginning, which contains graphic images and may be distressing.  This was included by the master on release.",
            "format": "VOB (with smalls)",
            "size": "4.19 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        },
        {
            "id": "e-360",
            "tour": "Broadway",
            "date": "2010-07-18",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Alice Ripley (Diana), Brian d'Arcy James (Dan), Kyle Dean Massey (Gabe), Jennifer Damiano (Natalie), Adam Chanler-Berat (Henry), Louis Hobson (Dr. Fine/Dr. Madden)",
            "notes": "MASTER NOTES: Alice Ripley, Brian d'Arcy James, and Jennifer Damiano's last performance! An electric and heartfelt night of theater, pretty much sums it all up. Beautiful capture that includes curtain call speeches from Tom Kitt and Brian Yorkey.<br><br>GENERAL NOTES: T/W: This video contains a PETA advertisement at the beginning, which contains graphic images and may be distressing.  This was included by the master on release.",
            "format": "VOB (with smalls)",
            "size": "4.63 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-2"
        }
    ],
    "The Notebook": [
        {
            "id": "e-1155335",
            "tour": "Broadway",
            "date": "2024-02-10",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Maryann Plunkett (Older Allie), Dorian Harewood (Older Noah), Joy Woods (Middle Allie), Ryan Vasquez (Middle Noah), Jordan Tyson (Younger Allie), John Cardoza (Younger Noah), Andréa Burns (Mother/Nurse Lori), Charles E. Wallace (Father/Son/Others), Hillary Fisher (Sarah/Granddaughter/Others), Dorcas Leung (Georgie/Concierge/Others), Carson Stewart (Fin/Johnny/Others), Chase Del Rey (Lon/Others), Yassmin Alers (Nurse Joanna/Others)",
            "notes": "Great 4K capture of this show's first preview! There is minor obstruction along the bottom, center, and far left. Washout on the wider shots. Some wandering/readjustment and unfocusing throughout. 20 second blackout at the end of the opening number due to ushers. There's a tech hold about 20 minutes into Act Two which is included. Includes curtain call, audio is fed from external source.",
            "format": "MP4",
            "size": "9.98 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        }
    ],
    "Oh, Mary!": [
        {
            "id": "e-1155976",
            "tour": "Off-Broadway",
            "date": "2024-02-24",
            "time": "M",
            "master": "bikinibottomday",
            "cast": "Cole Escola (Mary Todd Lincoln), Conrad Ricamora (Mary's Husband), James Scully (Mary's Teacher), Bianca Leigh (Mary's Chaperone), Tony Macht (Mary's Husband's Assistant)",
            "notes": "Great 4K capture of this hilarious play! Action is obstructed when characters are sitting/laying down, particularly on the left with the couch. One brief blackout near the end. Some wandering and unfocusing throughout. Includes curtain call, audio is fed from external source.",
            "format": "MP4",
            "size": "6.49 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-1"
        }
    ],
    "Oliver!": [
        {
            "id": "e-1142533",
            "tour": "Encores!",
            "date": "2023-05-07",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Gavin Lee (s/b Fagin), Benjamin Pajak (Oliver Twist), Tam Mutu (Bill Sikes), Lilli Cooper (Nancy), Julian Lerner (The Artful Dodger), Brad Oscar (Mr. Bumble), Michael Siberry (Mr. Brownlow), Thom Sesma (Mr. Sowerberry), Mary Testa (Widow Corney), Rashidra Scott (Mrs. Sowerberry), Ryan Worsing (s/w Ensemble)",
            "notes": "Excellent 4K capture of Gavin Lee's surprise debut as Fagin! Audio of the pre-show speech and announcement include the fact that Gavin is the first understudy to ever play a lead role in an Encores production! There is occasional head obstruction that is worked around very well. Some wandering and unfocusing throughout. Includes curtain call, audio is fed from external source.",
            "format": "MP4",
            "size": "9.41 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-1"
        }
    ],
    "Operation Mincemeat": [
        {
            "id": "e-1151480",
            "tour": "West End",
            "date": "October, 2023 (1)",
            "time": "Unknown",
            "master": "Lasagna",
            "cast": "Natasha Hodgson (Ewen Montagu & Others), Christian Andrews (s/b Charles Cholmondeley & Others), Zoe Roberts (Johnny Bevan & Others), Jak Malone (Hester Leggatt & Others), Holly Sumpton (s/b Jean Leslie & Others)",
            "notes": "Incredible capture of Christian’s debut as Charles! Shot around heads, misses the end of JFT.",
            "format": "MP4",
            "size": "10.26 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-2"
        },
        {
            "id": "e-1147283",
            "tour": "West End",
            "date": "August, 2023 (1)",
            "time": "Unknown",
            "master": "Lasagna",
            "cast": "Natasha Hodgson (Ewen Montagu & Others), David Cumming (Charles Cholmondeley & Others), Zoe Roberts (Johnny Bevan & Others), Christian Andrews (s/b Hester Leggatt & Others), Claire-Marie Hall (Jean Leslie & Others)",
            "notes": "Great capture of Christian as Hester! Shot over a railing, fairly successfully.",
            "format": "MP4",
            "size": "10.31 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-0"
        }
    ],
    "The Outsiders": [
        {
            "id": "e-1157313",
            "tour": "Broadway",
            "date": "2024-03",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Brody Grant (Ponyboy Curtis), Sky Lakota-Lynch (Johnny Cade), Joshua Boone (Dallas Winston), Brent Comer (Darrel Curtis), Jason Schmidt (Sodapop Curtis), Emma Pittman (Cherry Valance), Daryl Tofa (Two-Bit Mathews), Kevin William Paul (Bob Sheldon/Cop), Dan Berry (Paul Holden), SarahGrace Mariani (Marcia), Tilly Evans-Krueger (Ace), Renni Anthony Magee (Steve), RJ Higton (Chet), Sean Harrison Jones (Trip), Barton Cowperthwaite (Brill), Melody Rose (Beverly)",
            "notes": "justice for tulsa\n\nObstructed on both sides of stage",
            "format": "MP4",
            "size": "6.19 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-2"
        }
    ],
    "Parade": [
        {
            "id": "e-1144487",
            "tour": "First Broadway Revival",
            "date": "2023-06-13",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Ben Platt (Leo Frank), Micaela Diamond (Lucille Frank), Alex Joseph Grayson (Jim Conley), Erin Rose Doyle (Mary Phagan), Manoel Felciano (Tom Watson), Paul Alexander Nolan (Hugh Dorsey), Eddie Cooper (Newt Lee), Howard McGillin (Judge Roan/Old Soldier), Kelli Barrett (Mrs. Phagan), Jay Armstrong Johnson (Britt Craig), Jake Pedersen (Frankie Epps), Emily Rose DeMartino (Essie), Danielle Lee Greaves (Minnie McKnight), Stacie Bono (Sally Slaton), Sophia Manicone (Iola Stover), Christopher Gurr (Luther Rosser/Mr. Peavy), Douglas Lyons (Riley), Ashlyn Maddox (Monteen/Lila), Courtnee Carter (Angela), Sean Allan Krill (Governor Slaton), Florrie Bagel (Nurse/Others), Max Chernin (Mr. Turner/Others), Charlie Webb (Young Soldier/Others), Jackson Teeley (Officer Ivey/Others), William Michals (Lt. J.N. Starnes/Others), Beth Kirkpatrick (Nina Fomby/Others)",
            "notes": "Excellent 4K capture of the show’s first performance after the Tony Awards! Some wandering throughout. Some heads visible on the bottom but never any obstruction. Includes curtain call and a short clip of intermission, audio fed from external source.",
            "format": "MP4",
            "size": "10.82 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-1"
        }
    ],
    "Peter and the Starcatcher": [
        {
            "id": "e-6119",
            "tour": "Broadway",
            "date": "2012-03-31",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Adam Chanler-Berat (Boy), Celia Keenan-Bolger (Molly Aster), Christian Borle (Black Stache), Kevin Del Aguila (Smee), Rick Holmes (Lord Aster), Arnie Burton (Mrs. Bumbrake/Teacher)",
            "notes": "Great capture of the new Broadway transfer, which tells how Peter Pan came about. Great performances from Christian and the entire cast. A",
            "format": "VOB (with smalls)",
            "size": "4.33 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        }
    ],
    "The Phantom of the Opera (Andrew Lloyd Webber)": [
        {
            "id": "e-6933",
            "tour": "West End",
            "date": "2006-01",
            "time": "E",
            "master": "Unknown",
            "cast": "Earl Carpenter (The Phantom of the Opera), Rachel Barrell (Christine Daaé), David Shannon (Raoul de Chagny), Wendy Ferguson (Carlotta Giudicelli), David Lawrence (u/s Monsieur Firmin), Sam Hiller (Monsieur André), Emily Harvey (u/s Madame Giry), Rohan Tickell (Ubaldo Piangi), Heidi Ann O'Brien (Meg Giry)",
            "notes": "Circulates as 2 versions (both VOB + smalls) — a 7.71 GB version with 16:9 aspect ratio, and a 5.95 GB version in letterboxed 4:3 with slightly inferior image quality.",
            "format": "VOB (with smalls)",
            "size": "6.39 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-3"
        },
        {
            "id": "e-126",
            "tour": "25th Anniversary - Live At The Royal Albert Hall",
            "date": "2011-10",
            "time": "E",
            "master": "Proshot",
            "cast": "Ramin Karimloo (The Phantom of the Opera), Sierra Boggess (Christine Daaé), Hadley Fraser (Raoul de Chagny), Wendy Ferguson (Carlotta Giudicelli), Barry James (Monsieur Firmin), Gareth Snook (Monsieur André), Liz Robertson (Madame Giry), Wynne Evans (Ubaldo Piangi), Daisy Maywood (Meg Giry), Nick Holder (Joseph Buquet), Earl Carpenter (Auctioneer), Sergei Polunin (Slave Master)",
            "notes": "DVD and BluRay release.  \nIts actually a mixture of performances from 3 different days that ran from September 30th to October 2nd. I set the date as the digital release. \nThis version was also streamed on YouTube during the Covid-19 Pandemic",
            "format": "MP4",
            "size": "7.31 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-2"
        },
        {
            "id": "e-1135174",
            "tour": "West End",
            "date": "2006",
            "time": "Unknown",
            "master": "strangeangel78",
            "cast": "Earl Carpenter (The Phantom of the Opera), Katie Knight-Adams (alt Christine Daaé), David Shannon (Raoul de Chagny), Wendy Ferguson (Carlotta Giudicelli), James Barron (Monsieur Firmin), Richard Sidaway (u/s Monsieur André), Annette Yeo (Madame Giry), Rohan Tickell (Ubaldo Piangi), Heidi Ann O'Brien (Meg Giry)",
            "notes": "Really good video with excellent audio quality. Some small obstructions, but the clear zooms make up for it. Upgraded to MP4 by the master.",
            "format": "MP4 x2",
            "size": "12.81 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-2"
        }
    ],
    "The Pirates of Penzance": [
        {
            "id": "e-1006494",
            "tour": "West End Revival (2020)",
            "date": "2020-12-12",
            "time": "E",
            "master": "Proshot",
            "cast": "David McKechnie (Major-General Stanley), Oliver Savile (The Pirate King), Michael Burgen (Samuel), Leon Craig (Ruth), Alan Richardson (Mabel), Tom Senior (Frederic), Marc Akinfolarin (Sergeant of Police), Sam Kipling (Edith), Richard Russell Edwards (Isabel), Dominic Harbison (Kate), Lee Greenaway (Connie)",
            "notes": "Sasha Regan's award-winning all-male company are set to lift everyone's spirits with a pre-Christmas treat in their new West End pirates' cove.",
            "format": "MP4",
            "size": "3.63 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-1"
        }
    ],
    "RENT": [
        {
            "id": "e-19592",
            "tour": "Broadway",
            "date": "2008-09-07",
            "time": "E",
            "master": "Proshot",
            "cast": "Adam Kantor (Mark Cohen), Will Chase (Roger Davis), Renée Elise Goldsberry (Mimi Márquez), Eden Espinosa (Maureen Johnson), Michael McElroy (Tom Collins), Justin Johnston (Angel Dumott Schunard), Rodney Hicks (Benjamin Coffin III), Tracie Thoms (Joanne Jefferson), Andrea Goss (Alexi Darling/Others), Marcus Paul James (Mr. Jefferson/Seasons of Love Soloist #2), Gwen Stewart (Mrs. Jefferson/Seasons of Love Soloist #1), Jay Wilkinson (Mr. Grey/Gordon), Tracy McDowell (Mrs. Cohen/Others), Shaun Earl (Paul/Others), Telly Leung (Steve/Others)",
            "notes": "Filmed on August 20, 2008 and September 7, 2008. Released on DVD as RENT: Filmed Live On Broadway on February 3, 2009.\nhttps://www.imdb.com/title/tt1273675/",
            "format": "MKV",
            "size": "11.74 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-0"
        },
        {
            "id": "e-6137",
            "tour": "Broadway",
            "date": "2008-02-21",
            "time": "E",
            "master": "Unknown",
            "cast": "Harley Jay (Mark Cohen), Jay Wilkinson (u/s Roger Davis), Tamyra Gray (Mimi Márquez), Nicolette Hart (Maureen Johnson), Michael McElroy (Tom Collins), Justin Johnston (Angel Dumott Schunard), Rodney Hicks (Benjamin Coffin III), Kenna J. Ramsey (Joanne Jefferson), Andrea Goss (Alexi Darling/Others), Marcus Paul James (Mr. Jefferson/Seasons of Love Soloist #2), Maia Nkenge Wilson (Mrs. Jefferson/Seasons of Love Soloist #1), Peter Matthew Smith (u/s Mr. Grey/u/s Gordon), Caren Lyn Tackett (Mrs. Cohen/Others), Shaun Earl (Paul/Others), Andy Señor Jr. (Steve/Others)",
            "notes": "Little obstruction on the left but not that bad, filmed in 16:9 with black bars to fit the 4:3 menu",
            "format": "VOB (with smalls)",
            "size": "4.46 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-1"
        }
    ],
    "Ride": [
        {
            "id": "e-1157333",
            "tour": "The Old Globe",
            "date": "2024-04",
            "time": "E",
            "master": "MTTZ",
            "cast": "Alex Finke (Annie Londonderry), Livvy Marcus (Martha Smith)",
            "notes": "Stunning capture of this amazing musicals USA premiere featuring some reworked and added scenes! Shot in a great mix of wides, mediums, and close-ups from the balcony so absolutely everything is captured. Some wandering, shaking, and re-adjusting throughout, and about a minute missing from one of the songs, but complete otherwise. Occasional light obstruction from my backpack that doesnt block anything.",
            "format": "MP4",
            "size": "7 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-0"
        }
    ],
    "Ride The Cyclone": [
        {
            "id": "e-1119678",
            "tour": "Off-Broadway",
            "date": "2016",
            "time": "Unknown",
            "master": "House Cam",
            "cast": "Karl Hamilton (The Amazing Karnak), Tiffany Tatreau (Ocean O'Connell Rosenberg), Kholby Wardell (Noel Gruber), Gus Halper (Mischa Bachinski), Alex Wyse (Ricky Potts), Emily Rohm (Jane Doe), Lillian Castillo (Constance Blackwood)",
            "notes": "Archival from the MCC production circa 2016. This was filmed after Taylor Louderman was fired from the show.",
            "format": "MP4",
            "size": "1.39 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-2"
        }
    ],
    "School of Rock": [
        {
            "id": "e-5085",
            "tour": "First US National Tour",
            "date": "2017-11-24",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Merritt David Janes (alt Dewey Finn), Lexie Dorsett Sharp (Rosalie Mullins), Matt Bittner (Ned Schneebly), Emily Borromeo (Patty), Ava Briglia (Summer), Gianna Harris (Tomika), Phoenix Schuman (Zack), Theo Mitchell-Penner (Lawrence), Gilberto Moretti-Hamilton (Freddy), Theodora Silverman (Katie), John Michael Pitera (Billy), Olivia Bucknor (Shonelle), Chloe Anne Garcia (Marcy), Carson Hodges (Mason), Gabriella Uhl (Sophie)",
            "notes": "Wonderful HD capture of the tour cast. Everything is nicely captured and the cast is terrific! A+",
            "format": "VOB (with smalls)",
            "size": "8.53 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        }
    ],
    "She Loves Me": [
        {
            "id": "e-1120",
            "tour": "Second Broadway Revival",
            "date": "2016-06-30",
            "time": "E",
            "master": "Proshot",
            "cast": "Laura Benanti (Amalia Balash), Zachary Levi (Georg Nowack), Jane Krakowski (Ilona Ritter), Gavin Creel (Steven Kodaly), Byron Jennings (Mr. Maraczek), Tom McGowan (Ladislav Sipos), Nicholas Barasch (Arpad Laszlo), Peter Bartlett (Headwaiter), Jim Walton (Keller), Michael Fatica (Busboy), Alison Cimmet (Ensemble), Cameron Adams (Ensemble), Laura Shoop (Ensemble), Jenifer Foote (Ensemble), Gina Ferrall (Ensemble), Justin Bowen (Ensemble), Benjamin Eakeley (Ensemble), Andrew Kober (Ensemble), Preston Truman Boyd (Ensemble), Sara Edwards (Ensemble)",
            "notes": "Edited version of the Broadway HD Livestream that was aired on PBS.",
            "format": "MP4",
            "size": "6.85 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-0"
        }
    ],
    "Shrek: The Musical": [
        {
            "id": "e-8222",
            "tour": "Broadway",
            "date": "2009-12",
            "time": "Unknown",
            "master": "Proshot",
            "cast": "Brian d'Arcy James (Shrek), Sutton Foster (Princess Fiona), Christopher Sieber (Lord Farquaad), Daniel Breaker (Donkey), John Tartaglia (Pinocchio/Magic Mirror/Dragon Puppeteer), Aymee Garcia (Dragonette/Mama Bear), Rachel Stern (Dragonette/Humpty Dumpty/Mama Ogre), Haven Burton (Dragonette/Gingy/Sugar Plum Fairy), Jennifer Simard (Wicked Witch/Queen Lillian/Magic Mirror Assistant), Chris Hoch (Big Bad Wolf/King Harold/Captain Guard), Colleen Hawks (Fairy Godmother/Bluebird), Denny Paschall (Peter Pan), Sarah Jane Shanks (Ugly Duckling/Blind Mouse), Dennis Stowe (Papa Bear/Thelonius), Lisa Ho (Baby Bear/Blind Mouse), Jacob Ming-Trent (Straw the Pig/Papa Ogre), Bobby Daye (Sticks the Pig/Bishop), Ryan Duncan (Bricks the Pig), Noah Rivera (White Rabbit), David F.M. Vaughn (Mad Hatter/Pied Piper), Kirsten Wyatt (Elf/Duloc Performer/Blind Mouse), Maya Goldman (Young Shrek/Dwarf), Rozi Baker (Young Fiona), Leah Greenhaus (Young Fiona), Tessa Albertson (Teen Fiona), Marissa O'Donnell (Teen Fiona), Marty Lawson (Guard), Cameron Adams (Ensemble), Jennifer Cody (Ensemble), Justin Greer (Ensemble), Danette Holden (Ensemble), Carolyn Ockert-Haythe (Ensemble), Greg Reuter (Ensemble), Heather Jane Rolff (Ensemble)",
            "notes": "This 1080p HD proshot with soundboard audio was released to Netflix in 2013, but was filmed in mid-December of 2009, a few months before the production closed. File information varies across traders.\nLeah Greenhaus and Marissa O'Donnell performed as Young Fiona and Teen Fiona, respectively, in I Know It's Today. Rozi Baker performed as Young Fiona in Big Bright Beautiful World and I'm a Believer, while Tessa Albertson performed as Teen Fiona in I'm a Believer. Swings and previous cast members were included as Duloc Dolls in the ensemble for What's Up, Duloc.",
            "format": "MP4",
            "size": "2.09 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-2"
        }
    ],
    "Six": [
        {
            "id": "e-15718",
            "tour": "West End",
            "date": "2019-01",
            "time": "Unknown",
            "master": "ghostlighttrading",
            "cast": "Jarnéia Richard-Noel (Catherine of Aragon), Millie O'Connell (Anne Boleyn), Natalie Paris (Jane Seymour), Alexia McIntosh (Anna of Cleves), Aimie Atkinson (Katherine Howard), Maiya Quansah-Breed (Catherine Parr)",
            "notes": "Used to be NFT, but no longer. Clear video, catches all the action with no obstructions. Some spotlight washout but not much, and definitely watchable. A gorgeous and fun production, featuring new lines and choreography not from the original run on tour. This is not actually recorded by me, but by a friend who doesnt trade.\nOriginal Format: 22.7GB MOV (4K 3840 × 2160p)\nOr 5.33GB MP4 (HD 1920 × 1080p) (almost lossless compression from original)",
            "format": "MP4",
            "size": "5.72 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-2"
        },
        {
            "id": "e-1157071",
            "tour": "Second US National Tour (Boleyn)",
            "date": "March, 2024 (1)",
            "time": "E",
            "master": "yourlocaltrader",
            "cast": "Gerianne Pérez (Catherine of Aragon), Zan Berube (Anne Boleyn), Amina Faye (Jane Seymour), Terica Marie (Anna of Cleves), Aline Mayagoitia (Katherine Howard), Adriana Scalice (Catherine Parr)",
            "notes": "Video Ends after the tinder scene. There is a head blocking the left of the stage. I tried to work around it the best I could. 600th performance of the Boleyn tour. Includes audio of the rest of the show.<br><br>MY NOTES: Audio is M4A - 18.4 MB",
            "format": "MOV",
            "size": "966.1 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "partial",
            "collected": "2024-09-0"
        },
        {
            "id": "e-1157072",
            "tour": "Second US National Tour (Boleyn)",
            "date": "March, 2024 (2)",
            "time": "E",
            "master": "yourlocaltrader",
            "cast": "Gerianne Pérez (Catherine of Aragon), Zan Berube (Anne Boleyn), Amina Faye (Jane Seymour), Terica Marie (Anna of Cleves), Aline Mayagoitia (Katherine Howard), Adriana Scalice (Catherine Parr)",
            "notes": "Head blocking far left of stage but i worked about it so nothing is missed.",
            "format": "MP4",
            "size": "6 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-0"
        },
        {
            "id": "e-26186",
            "tour": "Broadway",
            "date": "February, 2020 (1)",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "Adrianna Hicks (Catherine of Aragon), Andrea Macasaet (Anne Boleyn), Abby Mueller (Jane Seymour), Brittney Mack (Anna of Cleves), Samantha Pauly (Katherine Howard), Anna Uzele (Catherine Parr)",
            "notes": "First Preview! Recorded from orchestra.",
            "format": "MP4",
            "size": "3.85 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        }
    ],
    "Smash": [
        {
            "id": "e-2012094",
            "tour": "Broadway",
            "date": "2025-04-02",
            "time": "E",
            "master": "Blockhead94",
            "cast": "Robyn Hurder (Ivy), Brooks Ashmanskas (Nigel), Krysta Rodriguez (Tracy), John Behlmann (Jerry), Kristine Nielsen (Susan), Caroline Bowman (Karen), Bella Coppola (Chloe), Jacqueline B. Arnold (Anita), Nicholas Matos (Scott), Casey Garvin (Charlie), Megan Kane (Holly), Wendi Bergamini (Ensemble), Sarah Bowden (Ensemble), Deanna Cudjoe (Ensemble), Daniel Gaymon (Ensemble), Merritt David Janes (Ensemble), David Paul Kidder (Ensemble), McGee Maddox (Ensemble), J Savage (Ensemble), Jake Trammel (Ensemble), Katie Webber (Ensemble)",
            "notes": "Filmed from the front row of the orchestra. Act 1 is mostly obstructed due to the stage, capturing only the downstage action in parts. However, Act 2 provides much clearer, more comprehensive stage views. The audio remains excellent throughout.",
            "format": "MOV x3",
            "size": "16.57 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        }
    ],
    "Some Like it Hot": [
        {
            "id": "e-1143622",
            "tour": "Broadway",
            "date": "2022-11",
            "time": "Unknown",
            "master": "StarCuffedJeans",
            "cast": "J Harrison Ghee (Jerry | Daphne), Christian Borle (Joe | Josephine), Adrianna Hicks (Sugar Kane), NaTasha Yvette Williams (Sweet Sue), Kevin Del Aguila (Osgood Fielding III), Adam Heller (Agent Mulligan), Mark Lotito (Spats Colombo), Angie Schworer (Minnie), Devon Hadsell (Nellie), Jenny Hill (Vivian), TyNia René Brandon (Dolores), Raena White (Ginger), Casey Garvin (Mack), KJ Hippensteel (Man with Suitcase/Bar Manager), Jarvis B. Manning Jr. (Sonny), Charles South (Toothpick Charlie), DeMarius R. Copes (Ensemble), Abby Matsusaka (Ensemble), Brian Martin (Ensemble), Amber Owens (Ensemble), Richard Riaz Yoder (Ensemble), Brendon Stimson (Ensemble)",
            "notes": "starcuffedaward for tap dancing doors",
            "format": "MP4",
            "size": "7.13 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-1"
        },
        {
            "id": "e-1139457",
            "tour": "Broadway",
            "date": "2023-02-26",
            "time": "M",
            "master": "bikinibottomday",
            "cast": "Jarvis B. Manning Jr. (u/s Jerry | Daphne), Christian Borle (Joe | Josephine), Adrianna Hicks (Sugar Kane), NaTasha Yvette Williams (Sweet Sue), Kevin Del Aguila (Osgood Fielding III), Adam Heller (Agent Mulligan), Mark Lotito (Spats Colombo), Ian Campayno (s/w Ensemble), Julius Williams (s/w Ensemble), Kayla Pecchioni (s/w Ensemble)",
            "notes": "Great 4K capture of this hilarious musical! More spotlight washout than usual on the wideshots, and some light obstruction on the bottom that doesn’t really block anything. Some wandering throughout. Includes curtain call, audio fed from external source. Folder includes subtitle files made by Buffooligan.",
            "format": "MP4",
            "size": "10.69 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-1"
        },
        {
            "id": "e-1153551",
            "tour": "Broadway",
            "date": "2023-12-30",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "J Harrison Ghee (Jerry | Daphne), Christian Borle (Joe | Josephine), Adrianna Hicks (Sugar Kane), NaTasha Yvette Williams (Sweet Sue), Kevin Del Aguila (Osgood Fielding III), Adam Heller (Agent Mulligan), Mark Lotito (Spats Colombo), Angie Schworer (Minnie), Devon Hadsell (Nellie), Jenny Hill (Vivian), TyNia René Brandon (Dolores), Casey Garvin (Mack), KJ Hippensteel (Man with Suitcase/Bar Manager), Dan Horn (s/w Sonny), Charles South (Toothpick Charlie), DeMarius R. Copes (Ensemble), Jonathan Duvelson (Ensemble), Brian Martin (Ensemble), Abby Matsusaka (Ensemble), Amber Owens (Ensemble), Kayla Pecchioni (s/w Ensemble), Ericka Hunter Yang (Ensemble), Richard Riaz Yoder (Ensemble)",
            "notes": "Great 4K capture of this show’s final performance! There is obstruction blocking off the right side of the stage, which is worst in the first 3 minutes of the show. Some action on the far right is blocked off as a result. Increased wandering / readjustment and unfocusing throughout. Audio is a bit muffled, especially from the end of the first song to the first scene in Spats’ office. Includes curtain call and the closing speech, audio is fed from external source.",
            "format": "MP4",
            "size": "11.95 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        },
        {
            "id": "e-1146070",
            "tour": "Broadway",
            "date": "2023-04-26",
            "time": "M",
            "master": "Medium Observation",
            "cast": "J Harrison Ghee (Jerry | Daphne), Christian Borle (Joe | Josephine), Adrianna Hicks (Sugar Kane), NaTasha Yvette Williams (Sweet Sue), Kevin Del Aguila (Osgood Fielding III), Adam Heller (Agent Mulligan), Mark Lotito (Spats Colombo), Angie Schworer (Minnie), Devon Hadsell (Nellie), Jenny Hill (Vivian), TyNia René Brandon (Dolores), Raena White (Ginger), Casey Garvin (Mack), KJ Hippensteel (Man with Suitcase/Bar Manager), Jarvis B. Manning Jr. (Sonny), Charles South (Toothpick Charlie), DeMarius R. Copes (Ensemble), Brian Martin (Ensemble), Abby Matsusaka (Ensemble), Amber Owens (Ensemble), Brendon Stimson (Ensemble), Richard Riaz Yoder (Ensemble)",
            "notes": "Absolutely flawless video. There is a small head on the bottom left but it only obstructs the very front of the stage. The whole cast was really fantastic.<br><br>MY NOTES: Also includes the untracked audio in M4A (269.8 MB)",
            "format": "MP4",
            "size": "11.67 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-1"
        }
    ],
    "Something Rotten!": [
        {
            "id": "e-1112371",
            "tour": "Curtain Call Theater",
            "date": "2020-02",
            "time": "Unknown",
            "master": "Proshot",
            "cast": "Michael Valinoti (Nick Bottom), Stephen Emerick (Nigel Bottom), Chris Balestriere (Shakespeare), Kari Sweeney Efferen (Bea), Rebecca Borowik (Portia), Bruce Crilly (Brother Jeremiah), Rob Nichols (Shylock), Kevin Thomson (Minstrel), Thomas Krame (Lord Clapham), Shawn Tyler Allen (Robin)",
            "notes": "",
            "format": "MP4",
            "size": "5.37 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-2"
        },
        {
            "id": "e-2003716",
            "tour": "London Concert",
            "date": "2024-08",
            "time": "Unknown",
            "master": "hitmewithyourbethshot",
            "cast": "Jason Manford (Nick Bottom), Cassius Hackforth (Nigel Bottom), Richard Fleeshman (Shakespeare), Marisha Wallace (Bea), Evelyn Hoskins (Portia), Gary Wilmot (Nostradamus), Cameron Blakely (Brother Jeremiah), Steve Furst (Shylock), Jenna Boyd (Lady Croydon), Ashley Samuels (Troubadour)",
            "notes": "",
            "format": "MTS x4",
            "size": "12.75 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-3"
        },
        {
            "id": "e-2006498",
            "tour": "Cincinnati Landmark Productions",
            "date": "2024-11",
            "time": "Unknown",
            "master": "6Exclmtn",
            "cast": "Aaron Marshall (Nick Bottom), Anthony J. Contreras (Nigel Bottom), Christopher Wells (Shakespeare), Cammi Caldwell (Bea), Elena Boyd (Portia), Jazz McMullen (Nostradamus), Jerrod Gruber (Brother Jeremiah), Trey Finkenstead (Shylock), Austin Hoard (Minstrel), Joshua Van Nort (Lord Clapham), Nicholas Lyons Rohr (Peter Quince), Issiah Current (Tom Snout), Caleb Freed (Robin), Jordan Ward (Ensemble), Sarah Condon (Ensemble), Emma Hackworth (Ensemble), Cassidy Steele (Ensemble), Delaney O'Toole (Ensemble), Nick Godfrey (Ensemble), Katie McCarthy (Ensemble)",
            "notes": "Highlights of Act 2 recorded from a phone, totaling up to about 23 minutes of footage. The quality isn't the best, as the video suffers from HEAVY spotlight washout, and it was a blindshot, but you're more or less able to make out what happens on stage. Definitely not for a first-time watcher of the show, but if you're a Something Rotten completionist or happened to see this production live, I'd say it's worth getting your hands on.\n\nContains clips of Welcome to the Renaissance (Reprise), Hard to Be the Bard, We See the Light, Nigel's Theme, Something Rotten, Make An Omelette, and Welcome to America. The curtain call is also included.",
            "format": "MP4",
            "size": "1.99 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-05-0"
        },
        {
            "id": "e-503",
            "tour": "Broadway",
            "date": "2015-03-23",
            "time": "E",
            "master": "NYCG8R",
            "cast": "Brian d'Arcy James (Nick Bottom), John Cariani (Nigel Bottom), Christian Borle (Shakespeare), Heidi Blickenstaff (Bea), Kate Reinders (Portia), Brad Oscar (Nostradamus), Brooks Ashmanskas (Brother Jeremiah), Gerry Vichi (Shylock), Michael James Scott (Minstrel/Snug), Peter Bartlett (Lord Clapham/Eyepatch Man)",
            "notes": "First preview",
            "format": "VOB (with smalls)",
            "size": "4.53 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-2"
        },
        {
            "id": "e-1218",
            "tour": "Broadway",
            "date": "2015-03-28",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Brian d'Arcy James (Nick Bottom), John Cariani (Nigel Bottom), Christian Borle (Shakespeare), Heidi Blickenstaff (Bea), Kate Reinders (Portia), Brad Oscar (Nostradamus), Brooks Ashmanskas (Brother Jeremiah), Gerry Vichi (Shylock), Michael James Scott (Minstrel/Snug), Peter Bartlett (Lord Clapham/Eyepatch Man)",
            "notes": "Excellent HD capture of this hilarious new musical. The cast is just too perfect in every way. Superb performances, music, and story, and a great homage to theatre and musicals. Not to be missed! A",
            "format": "VOB (with smalls)",
            "size": "8.33 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-1"
        },
        {
            "id": "e-1219",
            "tour": "Broadway",
            "date": "2016-07-23",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Rob McClure (Nick Bottom), Josh Grisetti (Nigel Bottom), Will Chase (Shakespeare), Jenny Hill (u/s Bea), Catherine Brunell (Portia), Brad Oscar (Nostradamus), David Beach (Brother Jeremiah), Gerry Vichi (Shylock), Andre Ward (Minstrel/Snug), Edward Hibbert (Lord Clapham/Eyepatch Man)",
            "notes": "Wonderful HD capture of the new replacement cast. Great to see Will in the role since he played the character in the prior workshops, before being cast in the Nashville television series!",
            "format": "VOB (with smalls)",
            "size": "8.05 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-0"
        },
        {
            "id": "e-68",
            "tour": "Broadway",
            "date": "2016-06-20",
            "time": "E",
            "master": "SJ Bernly",
            "cast": "Rob McClure (Nick Bottom), John Cariani (Nigel Bottom), Christian Borle (Shakespeare), Heidi Blickenstaff (Bea), Catherine Brunell (u/s Portia), Brad Oscar (Nostradamus), David Beach (Brother Jeremiah), Andre Ward (Minstrel/Snug)",
            "notes": "With a mix of original cast and new faces, there are great performances all around. Nicely captured with just a couple quick dropouts. There are some heads at the bottom of the screen that regularly block the actors' feet, but they are worked around as much as possible, and generally don't affect the main action. There is also some occasional washout, especially in wider shots. It's filmed in 16:9, with a mix of wides, mediums, and close-ups. The sound is excellent. Includes curtain call and playbill scans.<br><br>MY NOTES: I have this in both the original VOB format and a merged MKV file. Both are the full show. The VOB version is missing VIDEO_TS.VOB",
            "format": "VOB (incomplete smalls) + MKV",
            "size": "4.29 GB + 4.19 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        },
        {
            "id": "e-1220",
            "tour": "Broadway",
            "date": "2016-11-12",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Rob McClure (Nick Bottom), Josh Grisetti (Nigel Bottom), Adam Pascal (Shakespeare), Leslie Rodriguez Kritzer (Bea), Catherine Brunell (Portia), Brad Oscar (Nostradamus), David Beach (Brother Jeremiah), David Hibbard (u/s Shylock)",
            "notes": "MASTER NOTES: Excellent HD capture of the final Broadway cast. Adam Pascal joined the cast as Shakespeare for the final 7 weeks on Broadway. Everything is captured nicely and the cast was still giving their all!  Some minor washouts and the audio sounds like it is from the big theatre it was performed in.<br><br>GENERAL NOTES: Many copies circulate without the Act 1  VIDEO_TS.VOB file. Check with traders.<br><br>MY NOTES: Missing VIDEO_TS.VOB for act 1 only",
            "format": "VOB (incomplete smalls)",
            "size": "9.28 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        }
    ],
    "The Sound of Music": [
        {
            "id": "e-20019",
            "tour": "Live!",
            "date": "2013-12-05",
            "time": "E",
            "master": "Proshot",
            "cast": "Carrie Underwood (Maria Rainer), Stephen Moyer (Captain Georg von Trapp), Audra McDonald (Mother Abbess), Laura Benanti (Elsa Schraeder), Christian Borle (Max Detweiler), Ariane Rinehart (Liesl), Joe West (Kurt), Grace Rundhaug (Marta), Ella Watts-Gorman (Louisa), Michael Nigro (Friedrich), Sophia Anne Caruso (Brigitta), Peyton Ella (Gretl), Michael Campayno (Rolf), Kristine Nielsen (Frau Schmidt), Christiane Noll (Sister Margaretta), Jessica Molaskey (Sister Berthe), Sean Cullen (Franz), Elena Shaddow (Sister Sophia), C.J. Wilson (Herr Zeller), John Bolger (Admiral von Schreiber)",
            "notes": "<br><br>MY NOTES: Also includes The Making of The Sound of Music Live, and an audio file of the performance in M4A",
            "format": "MKV",
            "size": "3.56 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-3"
        }
    ],
    "The SpongeBob Musical": [
        {
            "id": "e-6540",
            "tour": "Broadway",
            "date": "2018-08-29",
            "time": "E",
            "master": "NYCG8R",
            "cast": "Ethan Slater (SpongeBob SquarePants), Danny Skinner (Patrick Star), Christina Sajous (Sandy Cheeks), Gavin Lee (Squidward Q. Tentacles), Juliane Godfrey (u/s The Mayor), Brian Ray Norris (Eugene Krabs), Wesley Taylor (Sheldon Plankton), Catherine Ricafort (Karen the Computer), Jai'len Christine Li Josey (Pearl Krabs), Kelvin Moon Loh (Perch Perkins), Brandon Espinoza (Patchy the Pirate), Allan K Washington (Gary/Larry the Lobster), Abby C. Smith (Mrs. Puff), JC Schuster (Old Man Jenkins), Tom Kenny (French Narrator), Curtis Holbrook (Electric Skate), L'ogan J'ones (Electric Skate), Kyle Matthew Hamilton (Electric Skate), Lauralyn McClelland (Sardine Corps), Vasthy Mompoint (Sardine Corps), Oneika Phillips (Sardine Corps), Robert Taylor Jr. (Sardine Corps)",
            "notes": "Great capture of the Broadway show just before closing.",
            "format": "VOB (with smalls)",
            "size": "5.95 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-0"
        }
    ],
    "Spring Awakening": [
        {
            "id": "e-3287",
            "tour": "Broadway",
            "date": "2008-05-18",
            "time": "E",
            "master": "Unknown",
            "cast": "Jonathan Groff (Melchior Gabor), Lea Michele (Wendla Bergmann), Blake Bashoff (Moritz Stiefel), Emma Hunton (Ilse Neumann), Lilli Cooper (Martha Bessell), Matt Doyle (Hanschen Rilow), Brian Charles Johnson (Otto Lämmermeier), Skylar Astin (Georg Zirschnitz), Remy Zaken (Thea), Phoebe Strole (Anna Wheelan), Blake Daniel (Ernst Robel), Christine Estabrook (The Adult Women), Glenn Fleshler (The Adult Men), Gerard Canonico (Ensemble), Matt Shingledecker (Ensemble), Jenna Ushkowitz (Ensemble), Eryn Murman (Ensemble), Jesse Swenson (Ensemble), Alexandra Socha (Ensemble)",
            "notes": "Jonathan Groff and Lea Michele's final performance.",
            "format": "VOB (with smalls)",
            "size": "4.47 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-0"
        },
        {
            "id": "e-316",
            "tour": "Broadway",
            "date": "2007-02-10",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Jonathan Groff (Melchior Gabor), Lea Michele (Wendla Bergmann), John Gallagher Jr. (Moritz Stiefel), Phoebe Strole (u/s Ilse Neumann), Lilli Cooper (Martha Bessell), Jonathan B. Wright (Hanschen Rilow), Brian Charles Johnson (Otto Lämmermeier), Skylar Astin (Georg Zirschnitz), Remy Zaken (Thea), Krysta Rodriguez (u/s Anna Wheelan), Gideon Glick (Ernst Robel), Frances Mercanti-Anthony (u/s The Adult Women), Stephen Spinella (The Adult Men)",
            "notes": "AMAZING capture, closeups, performances. Not to be missed. A+",
            "format": "VOB (with smalls)",
            "size": "4.05 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-0"
        }
    ],
    "Stranger Things: The First Shadow": [],
    "Suffs": [
        {
            "id": "e-2000138",
            "tour": "Broadway",
            "date": "2024-04",
            "time": "Unknown",
            "master": "allisforgiven",
            "cast": "Shaina Taub (Alice Paul), Nikki M. James (Ida B. Wells), Jenn Colella (Carrie Chapman Catt), Hannah Cruz (Inez Milholland), Ally Bonino (Lucy Burns), Kim Blanck (Ruza Wenclawska), Nadia Dandashi (Doris Stevens), Emily Skinner (Alva Belmont/Phoebe Burn), Tsilala Brock (Dudley Malone), Grace McLean (Woodrow Wilson), Anastacia McCleskey (Mary Church Terrell), Laila Drew (Phyllis Terrell/Robin), Jaygee Macapugay (Mollie Hay), Jenna Bainbridge (Harry T. Burn/Major Sylvester), Ada Westfall (Mrs. Herndon), Monica Tulia Ramirez (Speaker of the House), Dana Costello (Doctor White/Mailman)",
            "notes": "<p>Pretty good stage shot, filmed between heads. There is a head that obstructs the right side of the stage and there are a few blackouts while actors are behind that head. When possible, things happening elsewhere on stage are still in frame.</p>",
            "format": "MP4",
            "size": "9.45 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        }
    ],
    "Sunset Boulevard": [
        {
            "id": "e-1148861",
            "tour": "Third West End Revival",
            "date": "2023-10",
            "time": "Unknown",
            "master": "Lasagna",
            "cast": "Nicole Scherzinger (Norma Desmond), Tom Francis (Joe Gillis), Grace Hodgett-Young (Betty Schaefer), David Thaxton (Max Von Mayerling), Jon Tsouras (Cecil B. DeMille/Finance Man/Stan), Ahmed Hamad (Artie Green), Hannah Yun Chamberlain (Young Norma/Patsy)",
            "notes": "Unobstructed capture of this innovative production! Wanders a little due to the darkness but everything is captured.",
            "format": "MP4",
            "size": "9.85 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-0"
        },
        {
            "id": "e-1138432",
            "tour": "Broadway Center Stage",
            "date": "2023-02",
            "time": "Unknown",
            "master": "catherinewasamassivec",
            "cast": "Stephanie J. Block (Norma Desmond), Derek Klena (Joe Gillis), Auli'i Cravalho (Betty Schaefer), Nathan Gunn (Max Von Mayerling), Paul Schoeffler (Cecil B. DeMille), Michael Maliakel (Artie Green), Tyley Ross (Manfred), Kevin Pariseau (Sheldrake), Lance Roberts (Sammy)",
            "notes": "MASTER NOTES: This is an excellent video with lots of well-focused close-ups (and they were ready for them).<br><br>GENERAL NOTES: Master released this as month and year. Please do not add the full date even if you know it.",
            "format": "MP4",
            "size": "9.62 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-1"
        }
    ],
    "Sweeney Todd: The Demon Barber of Fleet Street": [
        {
            "id": "e-1143661",
            "tour": "Third Broadway Revival",
            "date": "2023-05-31",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Josh Groban (Sweeney Todd), Annaleigh Ashford (Mrs. Lovett), Jordan Fisher (Anthony Hope), Maria Bilbao (Johanna), Jamie Jackson (Judge Turpin), Gaten Matarazzo (Tobias Ragg), John Rapson (Beadle Bamford), Jeanna de Waal (s/b Beggar Woman), Nicholas Christopher (Adolfo Pirelli), Danny Rothman (t/r Jonas Fogg), Dwayne Cooper (s/w Bird Seller), Patricia Phillips (Passerby), Galyana Castillo (Ensemble), Taeler Cyrus (Ensemble), Timothy Hughes (Ensemble), Paul-Jordan Jansen (Ensemble), Alicia Kaori (Ensemble), Raymond J. Lee (Ensemble), Samantha Pollino (Ensemble), Lexi Rabadi (Ensemble), Nathan Salstone (Ensemble), Kristie Dale Sanders (Ensemble), Daniel Torres (Ensemble), Felix Torrez-Ponce (Ensemble), DeLaney Westfall (Ensemble)",
            "notes": "Excellent 4K capture of this revival! Increased wandering/readjustment and unfocusing throughout. Some minor head obstruction in the second act that is worked around very well. Other obstruction throughout only lasts for a second or two each time. Due to the angle, some of Johanna's moments are blocked off by the archway. Includes curtain call, audio is fed from external source.",
            "format": "MP4",
            "size": "11.91 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-2"
        },
        {
            "id": "e-1291",
            "tour": "First US National Tour",
            "date": "1981-09",
            "time": "E",
            "master": "Proshot",
            "cast": "George Hearn (Sweeney Todd), Angela Lansbury (Mrs. Lovett), Cris Groenendaal (Anthony Hope), Betsy Joslyn (Johanna), Edmund Lyndeck (Judge Turpin), Ken Jennings (Tobias Ragg), Calvin Remsberg (Beadle Bamford), Sara Woods (Beggar Woman), Sal Mistretta (Adolfo Pirelli), Michael Kalinyen (Jonas Fogg)",
            "notes": "Commercial proshot video. Often mislabelled as being September 12th, 1982, HOWEVER, that is when it aired on PBS, not when it was recorded.",
            "format": "VOB (with smalls)",
            "size": "6.44 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-2"
        },
        {
            "id": "e-69",
            "tour": "New York Philharmonic Concert",
            "date": "2014-03",
            "time": "E",
            "master": "Proshot",
            "cast": "Bryn Terfel (Sweeney Todd), Emma Thompson (Mrs. Lovett), Jay Armstrong Johnson (Anthony Hope), Erin Mackey (Johanna), Philip Quast (Judge Turpin), Kyle Brenn (Tobias Ragg), Jeff Blumenkrantz (Beadle Bamford), Audra McDonald (Beggar Woman), Christian Borle (Adolfo Pirelli)",
            "notes": "Filmed in March 2014 and aired on PBS on September 26, 2014.",
            "format": "MP4",
            "size": "2.86 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-0"
        }
    ],
    "Thoroughly Modern Millie": [
        {
            "id": "e-511",
            "tour": "Broadway",
            "date": "2004-06-12",
            "time": "E",
            "master": "Unknown",
            "cast": "Susan Egan (Millie Dillmount), Christian Borle (Jimmy Smith), Harriet Harris (Mrs. Meers), Emily Rozek (Miss Dorothy Brown), Kevin Earley (Mr. Trevor Graydon), Leslie Uggams (Muzzy Van Hossmere), Liz McCartney (Miss Flannery), Peter Kim (Bun Foo), David Rhee (Ching Ho)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "3.84 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-1"
        },
        {
            "id": "e-510",
            "tour": "Broadway",
            "date": "2002-04-13",
            "time": "E",
            "master": "Unknown",
            "cast": "Sutton Foster (Millie Dillmount), Gavin Creel (Jimmy Smith), Harriet Harris (Mrs. Meers), Angela Christian (Miss Dorothy Brown), Marc Kudisch (Mr. Trevor Graydon), Sheryl Lee Ralph (Muzzy Van Hossmere), Anne L. Nathan (Miss Flannery), Francis Jue (Bun Foo), Ken Leung (Ching Ho)",
            "notes": "Shot from the second row mezz on the side with lots of close-ups. Very clear and steady video with very good sound.",
            "format": "VOB (with smalls)",
            "size": "4.23 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        }
    ],
    "Titanique": [
        {
            "id": "e-2003403",
            "tour": "Off-Broadway Remount",
            "date": "2024-08",
            "time": "M",
            "master": "TheatreCouple14",
            "cast": "Dee Roscioli (Céline Dion), Michael Evan Williams (Jack), Tess Marshall (u/s Rose), Nathan Lee Graham (Ruth), Terrence Williams Jr. (u/s Victor Garber/u/s Luigi), Marcus Antonio (The Seaman/Iceberg), Lisa Howard (Molly Brown), Brandon Contreras (Cal), Sara Gallo (Background Vocalist), Garrett Poladian (Background Vocalist), Rae Davenport (Background Vocalist)",
            "notes": "Near-perfect wide-shot phone boot from center orchestra. Minor obstruction by heads in the very front left that only covers 2 or 3 lines. Funny improv about Rose recreating Frankenstein. Nathan messes up the timing in the Ruth breakdown scene, leading to a long time of him wandering the stage being confused.<br><br>MY NOTES: Also includes audio tracked and untracked (MP3)",
            "format": "MP4",
            "size": "7.3 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-0"
        }
    ],
    "Uncle Vanya": [
        {
            "id": "e-2000221",
            "tour": "Tenth Broadway Revival",
            "date": "2024-05-15",
            "time": "M",
            "master": "bikinibottomday",
            "cast": "Steve Carell (Vanya), William Jackson Harper (Mikhail Lvovich Astrov), Anika Noni Rose (Helena Andreyevna Serebryakova [Yelena]), Alison Pill (Sofia Alexandrovna Serebryakova [Sonya]), Jayne Houdyshell (Maria Vasilyevna Voynitskya), Alfred Molina (Aleksandr Vladimirovich Serebryakov), Mia Katigbak (Marina), Jonathan Hadary (Waffles)",
            "notes": "Excellent 4K capture of this revival! Some moments of wandering and unfocusing. Includes curtain call, audio is fed from external source.",
            "format": "MP4",
            "size": "10.48 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-1"
        }
    ],
    "Waitress": [
        {
            "id": "e-364",
            "tour": "Broadway",
            "date": "2016-06-14",
            "time": "E",
            "master": "SJ Bernly",
            "cast": "Jessie Mueller (Jenna), Keala Settle (Becky), Kimiko Glenn (Dawn), Drew Gehling (Dr. Pomatter), Christopher Fitzgerald (Ogie), Eric Anderson (Cal), Dakin Matthews (Joe), Nick Cordero (Earl), Ryan Vasquez (Father)",
            "notes": "Fantastic performances from the entire original cast. Jessie's voice fits beautifully with the score, and she gives a gut-wrenching performance of She Used to Be Mine. Drew, Kimiko, Keala, and Christopher are each hilarious and endearing. Nicely captured with just a few quick dropouts and no major blackouts. There is one head on the left that can occasionally be seen, but it never blocks the action. There is some slight washout in some of the wider shots. It's filmed in 16:9, with a mix of wides, mediums, and close-ups. The sound is excellent. Includes curtain call and playbill scans.<br><br>MY NOTES: Missing act 2 smalls",
            "format": "VOB (incomplete smalls)",
            "size": "8.8 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-1"
        },
        {
            "id": "e-236",
            "tour": "Broadway",
            "date": "2016-03-30",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Jessie Mueller (Jenna), Keala Settle (Becky), Kimiko Glenn (Dawn), Drew Gehling (Dr. Pomatter), Christopher Fitzgerald (Ogie), Eric Anderson (Cal), Dakin Matthews (Joe), Nick Cordero (Earl)",
            "notes": "Beautiful capture of this stunning Broadway transfer. This is the performance where the set broke and Sara Bareilles came out while it was being fixed. She sang a cut song from the show and Part of Your World and talked with the audience, which is included. A+",
            "format": "VOB (with smalls)",
            "size": "8.81 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-0"
        },
        {
            "id": "e-9394",
            "tour": "Broadway",
            "date": "2019-04",
            "time": "E",
            "master": "StarCuffedJeans",
            "cast": "Shoshana Bean (Jenna), Charity Angél Dawson (Becky), Molly Jobe (u/s Dawn), Jeremy Jordan (Dr. Pomatter), Eddie Jemison (Ogie), Benny Elledge (Cal), Larry Marshall (Joe), Ben Thompson (Earl), Melody A. Betts (Nurse Norma), Stephanie Torns (Francine Pomatter), Tess Murphy (Lulu), Molly Hager (Mother), Dan Tracy (Father)",
            "notes": "A nearly perfect video and ABSOLUTELY PERFECT performance. Small obstructions occur at Joe's table (but who cares) and during Negative. The rest of show, however, is captured gorgeously (and this time not diagonally). The video is very Shoshana focused, but I try to give everyone (yes, Jeremy too) their moments. The colors are absolutely vivid and I was trying new stabilization settings on my camera and god I'm gonna keep it this way. Do not list this video with an exact date.",
            "format": "MP4",
            "size": "20.1 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-1"
        },
        {
            "id": "e-16367",
            "tour": "Broadway",
            "date": "2019-01",
            "time": "E",
            "master": "NYCG8R",
            "cast": "Sara Bareilles (Jenna), Charity Angél Dawson (Becky), Lenne Klingaman (Dawn), Gavin Creel (Dr. Pomatter), Tyrone Davis Jr. (u/s Ogie), Andrew Fitch (u/s Cal), Larry Marshall (Joe), Ben Thompson (Earl), Anastacia McCleskey (Nurse Norma), Molly Jobe (s/w Francine Pomatter), Regan Ciccarelli (Lulu), Molly Hager (Mother), Dan Tracy (Father)",
            "notes": "Filmed early in Saras third run, before she added new riffs, but she still gives off a wonderful performance to a very reactive audience.",
            "format": "VOB (with smalls)",
            "size": "4.52 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-0"
        }
    ],
    "Water for Elephants": [
        {
            "id": "e-2000223",
            "tour": "Broadway",
            "date": "2024-05-23",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Grant Gustin (Jacob Jankowski), Gregg Edelman (Mr. Jankowski), Isabelle McCalla (Marlena), Paul Alexander Nolan (August), Stan Brown (Camel), Joe De Paul (Walter), Sara Gettelfinger (Barbara), Wade McCollum (Wade), Keaton Hentoff-Killian (u/s Silver Star), Paul Castree (Ensemble), Taylor Colleton (Ensemble), Gabriel Olivera De Paula Costa (Ensemble), Isabella Luisa Diaz (Ensemble), Harley McLeish (s/w Ensemble), Nicolas Jelmoni (Ensemble), Caroline Kane (Ensemble), Michael Mendez (Ensemble), Samuel Renaud (Ensemble), Marissa Rosen (Ensemble), Charles South (Ensemble), Sean Stack (Ensemble), Matthew Varvar (Ensemble), Rachael Boyd (s/w Ensemble), Alexandra Gaelle Royer (Ensemble)",
            "notes": "Excellent 4K capture of this new musical! Two short blackouts (about 30 seconds total) during Act Two. Act Two starts 30 seconds late. Some moments of wandering and unfocusing. Includes curtain call, audio is fed from external source.",
            "format": "MP4",
            "size": "11.77 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        }
    ],
    "Wicked": [
        {
            "id": "e-2001365",
            "tour": "Broadway",
            "date": "2024-05-30",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Mary Kate Morrissey (Elphaba), Alexandra Socha (Glinda), Jordan Litz (Fiyero), Brad Oscar (The Wizard), Donna McKechnie (Madame Morrible), Natalie Ortega (Nessarose), Jake Pedersen (Boq), William Youmans (Doctor Dillamond), Chase Madigan (Chistery), Christianne Tisdale (Midwife), Alison Jantzie (Witch's Mother), Michael Thatcher (Witch's Father/Ozian Official)",
            "notes": "<p>Excellent 4K capture of the full cast! Some moments of wandering and unfocusing. Some washout on the wider shots. Includes curtain call, audio fed from external source.</p>",
            "format": "MP4",
            "size": "12.1 GB",
            "nft": "No",
            "gifting": "ng",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-2"
        },
        {
            "id": "e-392",
            "tour": "Broadway",
            "date": "2013-07-20",
            "time": "M",
            "master": "totheemeraldcitytrades",
            "cast": "Lindsay Mendez (Elphaba), Katie Rose Clarke (Glinda), Derek Klena (Fiyero), Adam Grupper (The Wizard), Carol Kane (Madame Morrible), Catherine Charlebois (Nessarose), Michael Wartella (Boq), John Schiappa (Doctor Dillamond)",
            "notes": "MINIMAL HIGHLIGHTS including Defying Gravity, I'm Not That Girl (Reprise), and As Long as You're Mine until the line “I'm so bad at giving directions.” If you're expecting HD quality, this isn't it, but I'm 99% sure it's the only video released of this cast.",
            "format": "MP4 x2",
            "size": "478.9 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-01-0"
        },
        {
            "id": "e-314",
            "tour": "Broadway",
            "date": "2008-03-13",
            "time": "E",
            "master": "juniper47",
            "cast": "Stephanie J. Block (Elphaba), Annaleigh Ashford (Glinda), David Burnham (Fiyero), Lenny Wolpe (The Wizard), Miriam Margolyes (Madame Morrible), Cristy Candler (Nessarose), Ben Liebert (Boq), Steven Skybell (Doctor Dillamond), Jason Davies (u/s Chistery)",
            "notes": "",
            "format": "VOB (with smalls)",
            "size": "4.49 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        },
        {
            "id": "e-313",
            "tour": "Broadway",
            "date": "2008-06-15",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Stephanie J. Block (Elphaba), Kendra Kassebaum (Glinda), David Burnham (Fiyero), Lenny Wolpe (The Wizard), Kathy Santen (t/r Madame Morrible), Cristy Candler (Nessarose), Ben Liebert (Boq), Michael DeVries (u/s Doctor Dillamond)",
            "notes": "Final performance for Stephanie J. Block. Great capture of possibly the best performance ever given by an Elphaba. SJB lit the stage on fire, honestly this is one of the best individual performances I have ever attended. With such power and control, this is one Wicked NOT to be missed, you will be amazed! Kendra and SJB get emotional during For Good and it's a beautiful moment between them.",
            "format": "VOB (with smalls)",
            "size": "4.38 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        },
        {
            "id": "e-312",
            "tour": "First US National Tour (Emerald City)",
            "date": "2009-02-26",
            "time": "M",
            "master": "SunsetBlvd79",
            "cast": "Merideth Kaye Clark (s/b Elphaba), Katie Rose Clarke (Glinda), Richard H. Blake (Fiyero), Lenny Wolpe (The Wizard), Myra Lucretia Taylor (Madame Morrible), Amanda Rose (Nessarose), Ben Liebert (Boq), Paul Slade Smith (Doctor Dillamond)",
            "notes": "T/W: This video contains a PETA advertisement at the beginning, which contains graphic images and may be distressing.  This was included by the master on release.\n\nThis was the performance where the fire alarm went off as No Good Deed started. Meredith kept going through half the song, while the alarms and lights were flickering. Finally an announcement was made and she walked off stage in character. The show resumed after the evacuation from where she left off.<br><br>MY NOTES: The smalls don't work with act 2",
            "format": "VOB (with smalls)",
            "size": "4.47 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-0"
        },
        {
            "id": "e-278",
            "tour": "Broadway",
            "date": "2013-05-12",
            "time": "E",
            "master": "Lanelle",
            "cast": "Willemijn Verkaik (Elphaba), Katie Rose Clarke (Glinda), Kyle Dean Massey (Fiyero), Adam Grupper (The Wizard), Randy Danson (Madame Morrible), Catherine Charlebois (Nessarose), F. Michael Haynie (Boq), John Schiappa (Doctor Dillamond)",
            "notes": "Filmed from the right orchestra, at a slight angle, but excellent quality. The taper originally released this as a blu-ray, 2-disc DVDs or 1-disc DVD, so make sure to get the version that best suits your needs.",
            "format": "M2TS",
            "size": "25.79 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-09-1"
        },
        {
            "id": "e-42",
            "tour": "First US National Tour (Emerald City)",
            "date": "2009-08-16",
            "time": "E",
            "master": "SJ Bernly",
            "cast": "Donna Vivino (Elphaba), Katie Rose Clarke (Glinda), Richard H. Blake (Fiyero), Lenny Wolpe (The Wizard), Myra Lucretia Taylor (Madame Morrible), Amanda Rose (Nessarose), Ben Liebert (Boq), Paul Slade Smith (Doctor Dillamond)",
            "notes": "Katie's last performance.",
            "format": "VOB (with smalls)",
            "size": "6.19 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-12-2"
        },
        {
            "id": "e-24",
            "tour": "Broadway",
            "date": "2007-10-09",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Stephanie J. Block (Elphaba), Annaleigh Ashford (Glinda), Sebastian Arcelus (Fiyero), Lenny Wolpe (The Wizard), Kathy Santen (u/s Madame Morrible), Cristy Candler (Nessarose), Logan Lipton (Boq), Steven Skybell (Doctor Dillamond)",
            "notes": "MASTER NOTES: First performances of Stephanie J. Block and Annaleigh Ashford. Beautifully captured and wonderful closeups, jaw-dropping footage. Excellent performances all around, Stephanie commands the stage. A+<br><br>GENERAL NOTES: T/W: This video contains a PETA advertisement at the beginning, which contains graphic images and may be distressing.  This was included by the master on release.",
            "format": "VOB (with smalls)",
            "size": "4.42 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-0"
        },
        {
            "id": "e-14",
            "tour": "Broadway",
            "date": "2004-07-18",
            "time": "M",
            "master": "Unknown",
            "cast": "Idina Menzel (Elphaba), Kristin Chenoweth (Glinda), Norbert Leo Butz (Fiyero), Sean McCourt (u/s The Wizard), Carole Shelley (Madame Morrible), Michelle Federer (Nessarose), Randy Harrison (t/r Boq), William Youmans (Doctor Dillamond)",
            "notes": "This is Kristin and Norbert's last show. It was also supposed to be Joel Grey's last show, but he was ill. Video is sound only for first 4 minutes, and the last 30 seconds of Defying Gravity. This is a great video and excellent sound. Includes the speech by Idina. This bootleg is a treasure.",
            "format": "VOB (with smalls)",
            "size": "8.38 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-0"
        },
        {
            "id": "e-9",
            "tour": "Broadway",
            "date": "2013-02-10",
            "time": "E",
            "master": "Eleka-Nahmen",
            "cast": "Donna Vivino (s/b Elphaba), Alli Mauzey (Glinda), Kyle Dean Massey (Fiyero), Adam Grupper (The Wizard), Randy Danson (Madame Morrible), Catherine Charlebois (Nessarose), F. Michael Haynie (Boq), Tom Flynn (Doctor Dillamond)",
            "notes": "Amazing video from the orchestra from a great angle. Shaky when zooming in and out in the first 30 minutes, and a few heads in frame at times, but the filming is unmatched. This was supposed to be Jackie Burns’ last night, but she’d been sick since late January and ended up missing this performance. Donna is just INCREDIBLE as Elphaba… Master has released a new 2023 remaster that is available through him.",
            "format": "Remastered MP4",
            "size": "2.9 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-2"
        },
        {
            "id": "e-8",
            "tour": "Broadway",
            "date": "2015-02-01",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Lilli Cooper (s/b Elphaba), Kara Lindsay (Glinda), Jerad Bortz (u/s Fiyero), Brian Munn (u/s The Wizard), Kathy Fitzgerald (Madame Morrible), Catherine Charlebois (Nessarose), Robin de Jesús (Boq), Timothy Britten Parker (Doctor Dillamond)",
            "notes": "Beautiful HD capture from the orchestra. Lilli did a wonderful job in the role and made it her own. A",
            "format": "VOB (with smalls)",
            "size": "8.84 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-02-0"
        },
        {
            "id": "e-1143702",
            "tour": "Broadway",
            "date": "2023-05-30",
            "time": "E",
            "master": "bikinibottomday",
            "cast": "Alyssa Fox (Elphaba), McKenzie Kurtz (Glinda), Jordan Litz (Fiyero), John Dossett (The Wizard), Michele Pawk (Madame Morrible), Kimber Elayne Sprawl (Nessarose), Michael Wartella (Boq), William Youmans (Doctor Dillamond), Chase Madigan (Chistery), Christianne Tisdale (Midwife), Lisa Finegold (s/w Witch's Mother), Michael Thatcher (Witch's Father/Ozian Official)",
            "notes": "Excellent 4K capture of (almost) the full anniversary cast! Very slight obstruction on the bottom right that only blocks a moment or two. Some wandering and unfocusing throughout. Some washout on the wider shots. Includes curtain call, audio is fed from external source.",
            "format": "MP4",
            "size": "11.51 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-04-2"
        },
        {
            "id": "e-1135384",
            "tour": "Broadway",
            "date": "2013-08",
            "time": "Unknown",
            "master": "Unknown",
            "cast": "Lindsay Mendez (Elphaba), Katie Rose Clarke (Glinda), Derek Klena (Fiyero)",
            "notes": "Highlights include The Wizard & I, Defying Gravity, and No Good Deed. A head blocks the front of the stage (and a lot of the action)",
            "format": "MP4 x3",
            "size": "192.5 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2025-04-2"
        },
        {
            "id": "e-1147911",
            "tour": "Broadway",
            "date": "2023-02",
            "time": "E",
            "master": "StarCuffedJeans",
            "cast": "Talia Suskauer (Elphaba), Brittney Johnson (Glinda), James D. Gish (Fiyero), Cleavant Derricks (The Wizard), Michele Pawk (Madame Morrible), Mikayla Renfrow (Nessarose), Michael Wartella (Boq), Clifton Davis (Doctor Dillamond), Chase Madigan (Chistery), Christianne Tisdale (Midwife), Kristina Doucette (Witch's Mother), Michael Thatcher (Witch's Father/Ozian Official), Alex Aquilino (Ensemble), Randy Castillo (Ensemble), Olivia Cei Cicchi (Ensemble), Meg Doherty (Ensemble), Hannah Florence (Ensemble), Dan Gleason (Ensemble), Josh Daniel Green (Ensemble), Jeff Heimbrock (Ensemble), Celia Hottenstein (Ensemble), Zachary Daniel Jones (Ensemble), Emily Rogers (Ensemble), Gabriela M. Soto (Ensemble), Travis Taber (Ensemble), Jeremy Thompson (Ensemble), Michael Williams (Ensemble)",
            "notes": "<p>britney’s last! also a very important day.</p>",
            "format": "MP4",
            "size": "6.99 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-05-0"
        },
        {
            "id": "e-1000308",
            "tour": "Broadway",
            "date": "2003-10",
            "time": "Unknown",
            "master": "Press Reel",
            "cast": "Idina Menzel (Elphaba), Kristin Chenoweth (Glinda), Jennifer Laura Thompson (Glinda), Norbert Leo Butz (Fiyero), Joel Grey (The Wizard), Carole Shelley (Madame Morrible)",
            "notes": "About 20 minutes of proshot footage. Includes No One Mourns the Wicked, The Wizard and I, Dancing Through Life, Popular, One Short Day, Defying Gravity, Thank Goodness, Wonderful, As Long As You're Mine, and For Good.",
            "format": "MPG x10",
            "size": "301 MB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "highlights",
            "collected": "2024-11-2"
        },
        {
            "id": "e-1122691",
            "tour": "Broadway",
            "date": "2022-02",
            "time": "Unknown",
            "master": "juniper47",
            "cast": "Lindsay Heather Pearce (Elphaba), Brittney Johnson (Glinda), Sam Gravitte (Fiyero), Michael McCormick (The Wizard), Sharon Sachs (Madame Morrible), Mili Diaz (Nessarose), Jordan Barrow (Boq), Michael X. Martin (Doctor Dillamond), Chase Madigan (Chistery), Christianne Tisdale (Midwife), Gabriela M. Soto (Witch's Mother), Peter C Ermides (Witch's Father/Ozian Official), Alicia Albright (s/w Ensemble), Jenny Florkowski (s/w Ensemble), Alison Jantzie (s/w Ensemble), Dashi Mitchell (s/w Ensemble), Nicky Venditti (s/w Ensemble)",
            "notes": "Filmed in 4K (released as 1080p and 4K). A historic night on Broadway, with Brittney Johnson's first show as full-time Glinda after having been a standby for 3 years, being the first POC to play the role ever. Also Sharon Sach's first show as Madame Morrible after a transfer from the Tour, making her Broadway debut. No significant obstructions, minimal spotlight washout—excellent picture throughout. Only significant dropout is at the start of “Dancing Through Life” (literally only 20 seconds). Never to be sold except by master, never to be posted anywhere online.",
            "format": "MP4",
            "size": "20.75 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-03-2"
        },
        {
            "id": "e-27880",
            "tour": "Broadway",
            "date": "2019-09",
            "time": "E",
            "master": "StarCuffedJeans",
            "cast": "Hannah Corneau (Elphaba), Brittney Johnson (s/b Glinda), Kyle Dean Massey (t/r Fiyero), Michael McCormick (The Wizard), Nancy Opel (Madame Morrible), Gizel Jimenez (Nessarose), Jesse JP Johnson (Boq), Jamie Jackson (Doctor Dillamond), Chase Madigan (Chistery), Christianne Tisdale (Midwife), Courtney Iventosch (Witch's Mother)",
            "notes": "Excellent HD capture of Broadway's first Black Glinda and the first Elphaba to have never played the role before in over half a decade! A very Elphaba and Glinda-centric video, it's filmed from the left orchestra with a mix of wides, mediums, and many closeups, with occasional dropouts due to ushers. A bit shaky throughout. Both acts start a minute in. Please do not post screenshots of this video on Twitter ever. Gifs on Tumblr are okay after the NFT date, but don't go linking things to actors and shows.",
            "format": "MP4",
            "size": "7.02 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2025-01-3"
        },
        {
            "id": "e-11031",
            "tour": "Broadway",
            "date": "2003-10-12",
            "time": "E",
            "master": "Unknown",
            "cast": "Idina Menzel (Elphaba), Kristin Chenoweth (Glinda), Norbert Leo Butz (Fiyero), Joel Grey (The Wizard), Carole Shelley (Madame Morrible), Michelle Federer (Nessarose), Christopher Fitzgerald (Boq), William Youmans (Doctor Dillamond)",
            "notes": "An amazing video that captures all the action smoothly, with a great mix of wides and zooms, no blackouts and no obstruction. Some spotlight washout on faces. Overall the best of the early Wicked videos. Multiple versions circulate, so check with traders. (One-disc version includes NY1 Review Segment, Today Show performance, and Letterman performance. Two-disc version is lower generation (higher quality) but does not include the extras.)<br><br>MY NOTES: Does not include the extras",
            "format": "VOB (with smalls)",
            "size": "5.2 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-2"
        },
        {
            "id": "e-14125",
            "tour": "First US National Tour (Emerald City)",
            "date": "2009-07-19",
            "time": "M",
            "master": "SJ Bernly",
            "cast": "Merideth Kaye Clark (s/b Elphaba), Katie Rose Clarke (Glinda), Richard H. Blake (Fiyero), Lenny Wolpe (The Wizard), Myra Lucretia Taylor (Madame Morrible), Amanda Rose (Nessarose), Ben Liebert (Boq), Paul Slade Smith (Doctor Dillamond)",
            "notes": "There appears to be 2 copies of this; 4.84GB and 5.76GB. The 4.84GB version skips from 'No Good Deed' to just after 'For Good'.<br><br>MY NOTES: I have the complete version",
            "format": "VOB (with smalls)",
            "size": "6.19 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-10-3"
        },
        {
            "id": "e-6210",
            "tour": "Broadway",
            "date": "2010-04-09",
            "time": "E",
            "master": "SunsetBlvd79",
            "cast": "Mandy Gonzalez (Elphaba), Katie Rose Clarke (Glinda), Andy Karl (Fiyero), P.J. Benjamin (The Wizard), Rondi Reed (Madame Morrible), Jenny Fellner (Nessarose), Alex Brightman (Boq), Timothy Britten Parker (Doctor Dillamond)",
            "notes": "T/W: This video contains a PETA advertisement at the beginning, which contains graphic images and may be distressing.  This was included by the master on release.",
            "format": "VOB (with smalls)",
            "size": "9.27 GB",
            "nft": "No",
            "gifting": "none",
            "limited": "Unrestricted",
            "amount": "full",
            "collected": "2024-11-0"
        }
    ]
}